#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PosingSpy_Weapon_Xiu_Mod2_3p

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeceiveInc_structs.hpp"


namespace SDK::Params
{

// Function ABP_PosingSpy_Weapon_Xiu_Mod2_3p.ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C.ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p
// 0x0050 (0x0050 - 0x0000)
struct ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESpyToolEvent EventType, class ABaseSpyTool* SpyTool)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpyToolEvent                                 K2Node_CustomEvent_EventType;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseSpyTool*                           K2Node_CustomEvent_SpyTool;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseSpyTool*                           K2Node_DynamicCast_AsBase_Spy_Tool;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_2;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_3;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_4;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p) == 0x000008, "Wrong alignment on ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p");
static_assert(sizeof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p) == 0x000050, "Wrong size on ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, EntryPoint) == 0x000000, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, CallFunc_GetOwningActor_ReturnValue) == 0x000018, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, K2Node_CustomEvent_EventType) == 0x000020, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, K2Node_CustomEvent_SpyTool) == 0x000028, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::K2Node_CustomEvent_SpyTool' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, K2Node_DynamicCast_AsBase_Spy_Tool) == 0x000030, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::K2Node_DynamicCast_AsBase_Spy_Tool' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, CallFunc_Montage_Play_ReturnValue) == 0x00003C, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, CallFunc_Montage_Play_ReturnValue_1) == 0x000040, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::CallFunc_Montage_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, CallFunc_Montage_Play_ReturnValue_2) == 0x000044, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::CallFunc_Montage_Play_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, CallFunc_Montage_Play_ReturnValue_3) == 0x000048, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::CallFunc_Montage_Play_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p, CallFunc_Montage_Play_ReturnValue_4) == 0x00004C, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p::CallFunc_Montage_Play_ReturnValue_4' has a wrong offset!");

// Function ABP_PosingSpy_Weapon_Xiu_Mod2_3p.ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C.OnSpyToolEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0 final
{
public:
	ESpyToolEvent                                 EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseSpyTool*                           SpyTool;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0) == 0x000008, "Wrong alignment on ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0");
static_assert(sizeof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0) == 0x000010, "Wrong size on ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0, EventType) == 0x000000, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0::EventType' has a wrong offset!");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0, SpyTool) == 0x000008, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_OnSpyToolEvent_Event_0::SpyTool' has a wrong offset!");

// Function ABP_PosingSpy_Weapon_Xiu_Mod2_3p.ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph");
static_assert(sizeof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph) == 0x000010, "Wrong size on ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph");
static_assert(offsetof(ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

