#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PosingSpy_Weapon_Xiu_Mod2_3p

#include "Basic.hpp"

#include "DeceiveInc_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PosingSpy_Weapon_Xiu_Mod2_3p.ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C
// 0x0B60 (0x0E20 - 0x02C0)
class UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0368(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0390(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0410(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0440(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04F0(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x05A0(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x05C0(0x0830)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DF0(0x0020)()
	bool                                          Secondary;                                         // 0x0E10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E11[0x3];                                      // 0x0E11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                External_Force;                                    // 0x0E14(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_PosingSpy_Weapon_Xiu_Mod2_3p(int32 EntryPoint);
	void OnSpyToolEvent_Event_0(ESpyToolEvent EventType, class ABaseSpyTool* SpyTool);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PosingSpy_Weapon_Xiu_Mod2_3p_C">();
	}
	static class UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C>();
	}
};
static_assert(alignof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C) == 0x000010, "Wrong alignment on UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C");
static_assert(sizeof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C) == 0x000E20, "Wrong size on UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_Slot) == 0x0002F8, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_TransitionResult_1) == 0x000340, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_TransitionResult) == 0x000368, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_SequencePlayer_1) == 0x000390, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_StateResult_1) == 0x000410, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_SequencePlayer) == 0x000440, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_StateResult) == 0x0004C0, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_StateMachine) == 0x0004F0, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_LocalToComponentSpace) == 0x0005A0, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_RigidBody) == 0x0005C0, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, AnimGraphNode_ComponentToLocalSpace) == 0x000DF0, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, Secondary) == 0x000E10, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::Secondary' has a wrong offset!");
static_assert(offsetof(UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C, External_Force) == 0x000E14, "Member 'UABP_PosingSpy_Weapon_Xiu_Mod2_3p_C::External_Force' has a wrong offset!");

}

