#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Briefcase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Briefcase.BP_Briefcase_C.ExecuteUbergraph_BP_Briefcase
// 0x0070 (0x0070 - 0x0000)
struct BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter_1;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable_1;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayResourcesComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VO_C>             K2Node_DynamicCast_AsBPI_VO;                       // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationUserWidget*                  K2Node_DynamicCast_AsNavigation_User_Widget;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNowHidden;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase) == 0x000008, "Wrong alignment on BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase");
static_assert(sizeof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase) == 0x000070, "Wrong size on BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, EntryPoint) == 0x000000, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_ComponentBoundEvent_Interacter_1) == 0x000008, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_ComponentBoundEvent_Interacter_1' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_ComponentBoundEvent_Interactable_1) == 0x000010, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_ComponentBoundEvent_Interacter) == 0x000028, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_ComponentBoundEvent_Interacter' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_ComponentBoundEvent_Interactable) == 0x000030, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, CallFunc_GetOwner_ReturnValue_1) == 0x000038, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, CallFunc_GetWidget_ReturnValue) == 0x000040, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_DynamicCast_AsBPI_VO) == 0x000048, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_DynamicCast_AsBPI_VO' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_DynamicCast_AsNavigation_User_Widget) == 0x000060, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_DynamicCast_AsNavigation_User_Widget' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase, K2Node_Event_bNowHidden) == 0x000069, "Member 'BP_Briefcase_C_ExecuteUbergraph_BP_Briefcase::K2Node_Event_bNowHidden' has a wrong offset!");

// Function BP_Briefcase.BP_Briefcase_C.BP_OnHiddenInContainerChange
// 0x0001 (0x0001 - 0x0000)
struct BP_Briefcase_C_BP_OnHiddenInContainerChange final
{
public:
	bool                                          bNowHidden;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Briefcase_C_BP_OnHiddenInContainerChange) == 0x000001, "Wrong alignment on BP_Briefcase_C_BP_OnHiddenInContainerChange");
static_assert(sizeof(BP_Briefcase_C_BP_OnHiddenInContainerChange) == 0x000001, "Wrong size on BP_Briefcase_C_BP_OnHiddenInContainerChange");
static_assert(offsetof(BP_Briefcase_C_BP_OnHiddenInContainerChange, bNowHidden) == 0x000000, "Member 'BP_Briefcase_C_BP_OnHiddenInContainerChange::bNowHidden' has a wrong offset!");

// Function BP_Briefcase.BP_Briefcase_C.BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Briefcase_C_BndEvt__BP_Briefcase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_Briefcase.BP_Briefcase_C.BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Briefcase_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

}

