#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasePickableActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeceiveInc_structs.hpp"
#include "DeceiveInc_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BasePickableActor.BP_BasePickableActor_C
// 0x0038 (0x0328 - 0x02F0)
class ABP_BasePickableActor_C : public ABasePickableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USingleUserConditionComponent*          SingleUserCondition;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Outline;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UActiveAbilityConditionComponent*       ActiveAbilityCondition;                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URayCastConditionComponent*             RayCastCondition;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      VFX;                                               // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaxUseConditionComponent*              MaxUseCondition;                                   // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BasePickableActor(int32 EntryPoint);
	void OnInteractionIconStateChanged(EInteractionIconState NewState, EInteractionIconState OldState);
	void BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature(class UInteractionIconComponent* OldIcon, class UInteractionIconComponent* NewIcon);
	void BP_OnHiddenInContainerChange(bool bNowHidden);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BasePickableActor_C">();
	}
	static class ABP_BasePickableActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BasePickableActor_C>();
	}
};
static_assert(alignof(ABP_BasePickableActor_C) == 0x000008, "Wrong alignment on ABP_BasePickableActor_C");
static_assert(sizeof(ABP_BasePickableActor_C) == 0x000328, "Wrong size on ABP_BasePickableActor_C");
static_assert(offsetof(ABP_BasePickableActor_C, UberGraphFrame) == 0x0002F0, "Member 'ABP_BasePickableActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BasePickableActor_C, SingleUserCondition) == 0x0002F8, "Member 'ABP_BasePickableActor_C::SingleUserCondition' has a wrong offset!");
static_assert(offsetof(ABP_BasePickableActor_C, FX_Outline) == 0x000300, "Member 'ABP_BasePickableActor_C::FX_Outline' has a wrong offset!");
static_assert(offsetof(ABP_BasePickableActor_C, ActiveAbilityCondition) == 0x000308, "Member 'ABP_BasePickableActor_C::ActiveAbilityCondition' has a wrong offset!");
static_assert(offsetof(ABP_BasePickableActor_C, RayCastCondition) == 0x000310, "Member 'ABP_BasePickableActor_C::RayCastCondition' has a wrong offset!");
static_assert(offsetof(ABP_BasePickableActor_C, VFX) == 0x000318, "Member 'ABP_BasePickableActor_C::VFX' has a wrong offset!");
static_assert(offsetof(ABP_BasePickableActor_C, MaxUseCondition) == 0x000320, "Member 'ABP_BasePickableActor_C::MaxUseCondition' has a wrong offset!");

}

