#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BasePowerup

#include "Basic.hpp"

#include "DeceiveInc_structs.hpp"


namespace SDK::Params
{

// Function BP_BasePowerup.BP_BasePowerup_C.ExecuteUbergraph_BP_BasePowerup
// 0x0178 (0x0178 - 0x0000)
struct BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNowHidden;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSpyOwner_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VO_C>             K2Node_DynamicCast_AsBPI_VO;                       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpy*                                   K2Node_DynamicCast_AsSpy;                          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalSpy_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractionIconComponent*              K2Node_ComponentBoundEvent_OldIcon;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractionIconComponent*              K2Node_ComponentBoundEvent_NewIcon;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EInteractionIconState NewState, EInteractionIconState OldState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInteractionIconState                         K2Node_CustomEvent_NewState;                       // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionIconState                         K2Node_CustomEvent_OldState;                       // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ADeceiveIncPlayerController* PlayerController, class ASpy* Spy)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UDISessionSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDISerializedDeckEntry                 CallFunc_GetEquippedDeck_ReturnValue;              // 0x0090(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPowerupInfo                           CallFunc_GetPowerupInfos_PowerupInfo;              // 0x00A8(0x00A8)()
	class ULocalSpyEventBus*                      CallFunc_GetLocalSpyEventBus_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADeceiveIncPlayerController*            K2Node_CustomEvent_PlayerController;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpy*                                   K2Node_CustomEvent_Spy;                            // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup) == 0x000008, "Wrong alignment on BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup");
static_assert(sizeof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup) == 0x000178, "Wrong size on BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, EntryPoint) == 0x000000, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_Event_bNowHidden) == 0x000004, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_Event_bNowHidden' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_ComponentBoundEvent_Interacter) == 0x000008, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_ComponentBoundEvent_Interacter' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_ComponentBoundEvent_Interactable) == 0x000010, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_GetSpyOwner_ReturnValue) == 0x000018, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_GetSpyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_DynamicCast_AsBPI_VO) == 0x000020, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_DynamicCast_AsBPI_VO' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_DynamicCast_AsSpy) == 0x000038, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_DynamicCast_AsSpy' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_IsLocalSpy_ReturnValue) == 0x000041, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_IsLocalSpy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_ComponentBoundEvent_OldIcon) == 0x000048, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_ComponentBoundEvent_OldIcon' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_ComponentBoundEvent_NewIcon) == 0x000050, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_ComponentBoundEvent_NewIcon' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_IsValid_ReturnValue_1) == 0x000069, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_CustomEvent_NewState) == 0x00006A, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_CustomEvent_OldState) == 0x00006B, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_CustomEvent_OldState' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_MakeLiteralByte_ReturnValue) == 0x00006C, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000080, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_Subtract_ByteByte_ReturnValue) == 0x000088, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00008C, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_GetEquippedDeck_ReturnValue) == 0x000090, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_GetEquippedDeck_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A4, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_GetPowerupInfos_PowerupInfo) == 0x0000A8, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_GetPowerupInfos_PowerupInfo' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_GetLocalSpyEventBus_ReturnValue) == 0x000150, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_GetLocalSpyEventBus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_IsValid_ReturnValue_2) == 0x000158, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000160, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_CustomEvent_PlayerController) == 0x000168, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup, K2Node_CustomEvent_Spy) == 0x000170, "Member 'BP_BasePowerup_C_ExecuteUbergraph_BP_BasePowerup::K2Node_CustomEvent_Spy' has a wrong offset!");

// Function BP_BasePowerup.BP_BasePowerup_C.OnNewSpySpawnedEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0 final
{
public:
	class ADeceiveIncPlayerController*            PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpy*                                   Spy;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0) == 0x000008, "Wrong alignment on BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0");
static_assert(sizeof(BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0) == 0x000010, "Wrong size on BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0");
static_assert(offsetof(BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0, PlayerController) == 0x000000, "Member 'BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0, Spy) == 0x000008, "Member 'BP_BasePowerup_C_OnNewSpySpawnedEvent_Event_0::Spy' has a wrong offset!");

// Function BP_BasePowerup.BP_BasePowerup_C.OnInteractionIconStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_BasePowerup_C_OnInteractionIconStateChanged final
{
public:
	EInteractionIconState                         NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionIconState                         OldState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasePowerup_C_OnInteractionIconStateChanged) == 0x000001, "Wrong alignment on BP_BasePowerup_C_OnInteractionIconStateChanged");
static_assert(sizeof(BP_BasePowerup_C_OnInteractionIconStateChanged) == 0x000002, "Wrong size on BP_BasePowerup_C_OnInteractionIconStateChanged");
static_assert(offsetof(BP_BasePowerup_C_OnInteractionIconStateChanged, NewState) == 0x000000, "Member 'BP_BasePowerup_C_OnInteractionIconStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_OnInteractionIconStateChanged, OldState) == 0x000001, "Member 'BP_BasePowerup_C_OnInteractionIconStateChanged::OldState' has a wrong offset!");

// Function BP_BasePowerup.BP_BasePowerup_C.BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature final
{
public:
	class UInteractionIconComponent*              OldIcon;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractionIconComponent*              NewIcon;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature");
static_assert(sizeof(BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature) == 0x000010, "Wrong size on BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature");
static_assert(offsetof(BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature, OldIcon) == 0x000000, "Member 'BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature::OldIcon' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature, NewIcon) == 0x000008, "Member 'BP_BasePowerup_C_BndEvt__BP_BaseIntelActor_InteractableComp_K2Node_ComponentBoundEvent_3_OnInteractionIconChanged__DelegateSignature::NewIcon' has a wrong offset!");

// Function BP_BasePowerup.BP_BasePowerup_C.BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_BasePowerup_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_BasePowerup.BP_BasePowerup_C.BP_OnHiddenInContainerChange
// 0x0001 (0x0001 - 0x0000)
struct BP_BasePowerup_C_BP_OnHiddenInContainerChange final
{
public:
	bool                                          bNowHidden;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BasePowerup_C_BP_OnHiddenInContainerChange) == 0x000001, "Wrong alignment on BP_BasePowerup_C_BP_OnHiddenInContainerChange");
static_assert(sizeof(BP_BasePowerup_C_BP_OnHiddenInContainerChange) == 0x000001, "Wrong size on BP_BasePowerup_C_BP_OnHiddenInContainerChange");
static_assert(offsetof(BP_BasePowerup_C_BP_OnHiddenInContainerChange, bNowHidden) == 0x000000, "Member 'BP_BasePowerup_C_BP_OnHiddenInContainerChange::bNowHidden' has a wrong offset!");

// Function BP_BasePowerup.BP_BasePowerup_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_BasePowerup_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BasePowerup_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_BasePowerup_C_UserConstructionScript");
static_assert(sizeof(BP_BasePowerup_C_UserConstructionScript) == 0x000018, "Wrong size on BP_BasePowerup_C_UserConstructionScript");
static_assert(offsetof(BP_BasePowerup_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'BP_BasePowerup_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_BasePowerup_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BasePowerup_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'BP_BasePowerup_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

