#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Display_Powerup_Civilian

#include "Basic.hpp"

#include "DeceiveInc_structs.hpp"


namespace SDK::Params
{

// Function BP_Display_Powerup_Civilian.BP_Display_Powerup_Civilian_C.ExecuteUbergraph_BP_Display_Powerup_Civilian
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDISessionSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Subtract_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDISerializedDeckEntry                 CallFunc_GetEquippedDeck_ReturnValue;              // 0x0020(0x0010)()
	struct FPowerupInfo                           CallFunc_GetPowerupInfos_PowerupInfo;              // 0x0030(0x00A8)()
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian) == 0x000008, "Wrong alignment on BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian");
static_assert(sizeof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian) == 0x0000E0, "Wrong size on BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, EntryPoint) == 0x000000, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_Subtract_ByteByte_ReturnValue) == 0x000018, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_Subtract_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_GetEquippedDeck_ReturnValue) == 0x000020, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_GetEquippedDeck_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_GetPowerupInfos_PowerupInfo) == 0x000030, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_GetPowerupInfos_PowerupInfo' has a wrong offset!");
static_assert(offsetof(BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000D8, "Member 'BP_Display_Powerup_Civilian_C_ExecuteUbergraph_BP_Display_Powerup_Civilian::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

