#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Display_Powerup_Civilian

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeceiveInc_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Display_Powerup_Civilian.BP_Display_Powerup_Civilian_C
// 0x0030 (0x0250 - 0x0220)
class ABP_Display_Powerup_Civilian_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   SecurityColors;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EGameplayResourcesType                        ResourceTypeToGive;                                // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Display_Powerup_Civilian(int32 EntryPoint);
	void SetupPowerup();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Display_Powerup_Civilian_C">();
	}
	static class ABP_Display_Powerup_Civilian_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Display_Powerup_Civilian_C>();
	}
};
static_assert(alignof(ABP_Display_Powerup_Civilian_C) == 0x000008, "Wrong alignment on ABP_Display_Powerup_Civilian_C");
static_assert(sizeof(ABP_Display_Powerup_Civilian_C) == 0x000250, "Wrong size on ABP_Display_Powerup_Civilian_C");
static_assert(offsetof(ABP_Display_Powerup_Civilian_C, UberGraphFrame) == 0x000220, "Member 'ABP_Display_Powerup_Civilian_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Display_Powerup_Civilian_C, StaticMesh) == 0x000228, "Member 'ABP_Display_Powerup_Civilian_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Display_Powerup_Civilian_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_Display_Powerup_Civilian_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Display_Powerup_Civilian_C, SecurityColors) == 0x000238, "Member 'ABP_Display_Powerup_Civilian_C::SecurityColors' has a wrong offset!");
static_assert(offsetof(ABP_Display_Powerup_Civilian_C, ResourceTypeToGive) == 0x000248, "Member 'ABP_Display_Powerup_Civilian_C::ResourceTypeToGive' has a wrong offset!");

}

