#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HealingConsumable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HealingConsumable.BP_HealingConsumable_C.ExecuteUbergraph_BP_HealingConsumable
// 0x0070 (0x0070 - 0x0000)
struct BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable_1;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSpyOwner_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpy*                                   K2Node_DynamicCast_AsSpy;                          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_VO_C>             K2Node_DynamicCast_AsBPI_VO;                       // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable) == 0x000008, "Wrong alignment on BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable");
static_assert(sizeof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable) == 0x000070, "Wrong size on BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, EntryPoint) == 0x000000, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000010, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, CallFunc_PostEventAtLocation_ReturnValue) == 0x00001C, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_ComponentBoundEvent_Interacter_1) == 0x000020, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_ComponentBoundEvent_Interacter_1' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_ComponentBoundEvent_Interactable_1) == 0x000028, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_ComponentBoundEvent_Interacter) == 0x000030, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_ComponentBoundEvent_Interacter' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_ComponentBoundEvent_Interactable) == 0x000038, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, CallFunc_GetSpyOwner_ReturnValue) == 0x000040, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::CallFunc_GetSpyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_DynamicCast_AsSpy) == 0x000048, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_DynamicCast_AsSpy' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_DynamicCast_AsBPI_VO) == 0x000058, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_DynamicCast_AsBPI_VO' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_HealingConsumable_C_ExecuteUbergraph_BP_HealingConsumable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_HealingConsumable.BP_HealingConsumable_C.BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_HealingConsumable.BP_HealingConsumable_C.BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_HealingConsumable_C_BndEvt__BP_FoodBase_InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

}

