#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Keycard_Parent

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_BasePickableActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Keycard_Parent.BP_Keycard_Parent_C
// 0x0020 (0x0348 - 0x0328)
class ABP_Keycard_Parent_C : public ABP_BasePickableActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Keycard_Parent_C;                // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointOfInterestComponent*              PointOfInterest;                                   // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaxResourceConditionComponent*         MaxResourceCondition;                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           IdleSound;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Keycard_Parent(int32 EntryPoint);
	void BP_OnHiddenInContainerChange(bool bNowHidden);
	void BP_OnInteractionComplete(class UInteracterComponent* Interacter, class UInteractableComponent* Interactable);
	void ReceiveBeginPlay();
	void BPI_VO_Agent_OCT_ShootNoIntel();
	void BPI_VO_Agent_ShootNoAmmo_Secondary();
	void BPI_VO_Agent_Laugh();
	void BPI_VO_Agent_Loot_Generic();
	void BPI_VO_Agent_SOC_Active_StanceIn();
	void BPI_VO_IRIS_InGame_VaultTerminalAlreadyShutDown();
	void BPI_VO_IRIS_InGame_ExtractionZoneMoved();
	void BPI_VO_IRIS_InGame_ExtractionBlocked();
	void BPI_VO_IRIS_InGame_EmpoweredNavMode_LowIntel();
	void BPI_VO_IRIS_InGame_EmpoweredNavMode_Start();
	void BPI_VO_IRIS_InGame_NavMode_DestinationReached();
	void BPI_VO_IRIS_InGame_NavMode_ObjectSelected();
	void BPI_VO_IRIS_InGame_AllyPickedUpObjective();
	void BPI_VO_Agent_Jump_Exert();
	void BPI_VO_Agent_DeployingGadget();
	void BPI_VO_Agent_TeamComm();
	void BPI_VO_IRIS_Bucket_Positive();
	void BPI_VO_IRIS_Bucket_Negative();
	void BPI_VO_IRIS_HealingStation();
	void BPI_VO_IRIS_Options_Language();
	void BPI_VO_IRIS_PreGameLobby_PepTalk();
	void BPI_VO_IRIS_Options_Voice_Volume();
	void BPI_VO_IRIS_InGame_VaultTerminal_Shutdown_Friendly();
	void BPI_VO_IRIS_InGame_VaultTerminal_Shutdown_Enemy();
	void BPI_VO_IRIS_InGame_VaultTerminalDiscovery_Positive();
	void BPI_VO_IRIS_InGame_VaultTerminalDiscovery_Negative();
	void BPI_VO_IRIS_InGame_VaultOpen();
	void BPI_VO_IRIS_InGame_Traced();
	void BPI_VO_IRIS_InGame_Teammate_RezRequest();
	void BPI_VO_IRIS_InGame_Teammate_Down();
	void BPI_VO_IRIS_InGame_Teammate_Death();
	void BPI_VO_IRIS_InGame_LowHealth_Alert();
	void BPI_VO_IRIS_InGame_LowHealth_Reminder();
	void BPI_VO_IRIS_InGame_GadgetDestroyed();
	void BPI_VO_IRIS_InGame_ExtractionCalled_LastAgentStanding();
	void BPI_VO_IRIs_InGame_ExtractionArrived_WithObjective();
	void BPI_VO_IRIS_InGame_ExtractionArrived_NoObjective();
	void BPI_VO_IRIS_InGame_CoverBreak_NoDMG();
	void BPI_VO_IRIS_InGame_CharacterName();
	void BPI_VO_Agent_LootSpyDrop();
	void BPI_VO_Agent_ShootNoAmmo();
	void BPI_VO_OutroCar_StartVictoryLineProcess();
	void BPI_VO_Agent_VictoryLine();
	void BPI_VO_Agent_AgentSelect();
	void BPI_VO_Agent_PassiveTriggered();
	void BPI_VO_Agent_CAV_Expertise_TrackStart(int32 ChaseLevel);
	void BPI_VO_Agent_CAV_Expertise_Failure();
	void BPI_VO_Agent_CAV_Expertise_InteractClue();
	void BPI_VO_Agent_LowHealth();
	void BPI_VO_Agent_Exert();
	void BPI_VO_Agent_Hurt();
	void BPI_VO_Agent_KillSpyGeneric();
	void BPI_VO_Agent_ObjectiveCapturedByOthers();
	void BPI_VO_Agent_LootObjective();
	void BPI_VO_Agent_LootPowerUp();
	void BPI_VO_Agent_LootAmmoPack();
	void BPI_VO_Agent_ExpertiseActivated();
	void BPI_VO_Agent_HackingSpyCache();
	void BPI_VO_Agent_Death();
	void BPI_VO_Agent_LootKeycard();
	void BPI_VO_Agent_ChangeCover_Staff();
	void BPI_VO_Agent_ChangeCover_VIP();
	void BPI_VO_Agent_ChangeCover_Technician();
	void BPI_VO_Agent_ChangeCover_Guard();
	void BPI_VO_Agent_ChangeCover_Civilian();
	void BPI_VO_Agent_HackingShort();
	void BPI_VO_Agent_HackingLong();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Keycard_Parent_C">();
	}
	static class ABP_Keycard_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Keycard_Parent_C>();
	}
};
static_assert(alignof(ABP_Keycard_Parent_C) == 0x000008, "Wrong alignment on ABP_Keycard_Parent_C");
static_assert(sizeof(ABP_Keycard_Parent_C) == 0x000348, "Wrong size on ABP_Keycard_Parent_C");
static_assert(offsetof(ABP_Keycard_Parent_C, UberGraphFrame_BP_Keycard_Parent_C) == 0x000328, "Member 'ABP_Keycard_Parent_C::UberGraphFrame_BP_Keycard_Parent_C' has a wrong offset!");
static_assert(offsetof(ABP_Keycard_Parent_C, PointOfInterest) == 0x000330, "Member 'ABP_Keycard_Parent_C::PointOfInterest' has a wrong offset!");
static_assert(offsetof(ABP_Keycard_Parent_C, MaxResourceCondition) == 0x000338, "Member 'ABP_Keycard_Parent_C::MaxResourceCondition' has a wrong offset!");
static_assert(offsetof(ABP_Keycard_Parent_C, IdleSound) == 0x000340, "Member 'ABP_Keycard_Parent_C::IdleSound' has a wrong offset!");

}

