#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Keycard_Parent

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Keycard_Parent.BP_Keycard_Parent_C.ExecuteUbergraph_BP_Keycard_Parent
// 0x0090 (0x0090 - 0x0000)
struct BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x001C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ChaseLevel;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteracterComponent*                   K2Node_Event_Interacter;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_Event_Interactable;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalInteracter_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetSpyOwner_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VO_C>             K2Node_DynamicCast_AsBPI_VO;                       // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNowHidden;                           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue_1;      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent) == 0x000008, "Wrong alignment on BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent");
static_assert(sizeof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent) == 0x000090, "Wrong size on BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, EntryPoint) == 0x000000, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, Temp_struct_Variable) == 0x000008, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, CallFunc_IsVisible_ReturnValue) == 0x000018, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, Temp_delegate_Variable) == 0x00001C, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, Temp_struct_Variable_1) == 0x000030, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, Temp_delegate_Variable_1) == 0x000040, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, K2Node_Event_ChaseLevel) == 0x000050, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::K2Node_Event_ChaseLevel' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, CallFunc_PostAssociatedAkEvent_ReturnValue) == 0x000054, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::CallFunc_PostAssociatedAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, K2Node_Event_Interacter) == 0x000058, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::K2Node_Event_Interacter' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, K2Node_Event_Interactable) == 0x000060, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::K2Node_Event_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, CallFunc_IsLocalInteracter_ReturnValue) == 0x000068, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::CallFunc_IsLocalInteracter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, CallFunc_GetSpyOwner_ReturnValue) == 0x000070, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::CallFunc_GetSpyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, K2Node_DynamicCast_AsBPI_VO) == 0x000078, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::K2Node_DynamicCast_AsBPI_VO' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, K2Node_Event_bNowHidden) == 0x000089, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::K2Node_Event_bNowHidden' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x00008A, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent, CallFunc_PostAssociatedAkEvent_ReturnValue_1) == 0x00008C, "Member 'BP_Keycard_Parent_C_ExecuteUbergraph_BP_Keycard_Parent::CallFunc_PostAssociatedAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_Keycard_Parent.BP_Keycard_Parent_C.BP_OnHiddenInContainerChange
// 0x0001 (0x0001 - 0x0000)
struct BP_Keycard_Parent_C_BP_OnHiddenInContainerChange final
{
public:
	bool                                          bNowHidden;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Keycard_Parent_C_BP_OnHiddenInContainerChange) == 0x000001, "Wrong alignment on BP_Keycard_Parent_C_BP_OnHiddenInContainerChange");
static_assert(sizeof(BP_Keycard_Parent_C_BP_OnHiddenInContainerChange) == 0x000001, "Wrong size on BP_Keycard_Parent_C_BP_OnHiddenInContainerChange");
static_assert(offsetof(BP_Keycard_Parent_C_BP_OnHiddenInContainerChange, bNowHidden) == 0x000000, "Member 'BP_Keycard_Parent_C_BP_OnHiddenInContainerChange::bNowHidden' has a wrong offset!");

// Function BP_Keycard_Parent.BP_Keycard_Parent_C.BP_OnInteractionComplete
// 0x0010 (0x0010 - 0x0000)
struct BP_Keycard_Parent_C_BP_OnInteractionComplete final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Keycard_Parent_C_BP_OnInteractionComplete) == 0x000008, "Wrong alignment on BP_Keycard_Parent_C_BP_OnInteractionComplete");
static_assert(sizeof(BP_Keycard_Parent_C_BP_OnInteractionComplete) == 0x000010, "Wrong size on BP_Keycard_Parent_C_BP_OnInteractionComplete");
static_assert(offsetof(BP_Keycard_Parent_C_BP_OnInteractionComplete, Interacter) == 0x000000, "Member 'BP_Keycard_Parent_C_BP_OnInteractionComplete::Interacter' has a wrong offset!");
static_assert(offsetof(BP_Keycard_Parent_C_BP_OnInteractionComplete, Interactable) == 0x000008, "Member 'BP_Keycard_Parent_C_BP_OnInteractionComplete::Interactable' has a wrong offset!");

// Function BP_Keycard_Parent.BP_Keycard_Parent_C.BPI_VO_Agent_CAV_Expertise_TrackStart
// 0x0004 (0x0004 - 0x0000)
struct BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart final
{
public:
	int32                                         ChaseLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart) == 0x000004, "Wrong alignment on BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart");
static_assert(sizeof(BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart) == 0x000004, "Wrong size on BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart");
static_assert(offsetof(BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart, ChaseLevel) == 0x000000, "Member 'BP_Keycard_Parent_C_BPI_VO_Agent_CAV_Expertise_TrackStart::ChaseLevel' has a wrong offset!");

}

