#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PressStartAudio

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_PressStartAudio.BP_PressStartAudio_C.OnBlueprintEbusStringEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0 final
{
public:
	class FString                                 StringEvent;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0) == 0x000008, "Wrong alignment on BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0");
static_assert(sizeof(BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0) == 0x000010, "Wrong size on BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0");
static_assert(offsetof(BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0, StringEvent) == 0x000000, "Member 'BP_PressStartAudio_C_OnBlueprintEbusStringEvent_Event_0::StringEvent' has a wrong offset!");

// Function BP_PressStartAudio.BP_PressStartAudio_C.ExecuteUbergraph_BP_PressStartAudio
// 0x0080 (0x0080 - 0x0000)
struct BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGlobalEBusSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(const class FString& StringEvent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	class FString                                 K2Node_CustomEvent_StringEvent;                    // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio) == 0x000008, "Wrong alignment on BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio");
static_assert(sizeof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio) == 0x000080, "Wrong size on BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, EntryPoint) == 0x000000, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, Temp_delegate_Variable) == 0x000004, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, Temp_struct_Variable) == 0x000020, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, Temp_delegate_Variable_1) == 0x000040, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, CallFunc_PostAkEvent_ReturnValue) == 0x000050, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, Temp_struct_Variable_1) == 0x000058, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, K2Node_CustomEvent_StringEvent) == 0x000068, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::K2Node_CustomEvent_StringEvent' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, CallFunc_PostAkEvent_ReturnValue_1) == 0x000078, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x00007C, "Member 'BP_PressStartAudio_C_ExecuteUbergraph_BP_PressStartAudio::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

}

