#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spy_SpyPack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Spy_SpyPack.BP_Spy_SpyPack_C.ExecuteUbergraph_BP_Spy_SpyPack
// 0x0140 (0x0140 - 0x0000)
struct BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVictimEffect*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter_1;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable_1;         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00B0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVictimEffect*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayResourcesComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteracterComponent*                   K2Node_ComponentBoundEvent_Interacter;             // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 K2Node_ComponentBoundEvent_Interactable;           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetSpyOwner_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_VO_C>             K2Node_DynamicCast_AsBPI_VO;                       // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack) == 0x000010, "Wrong alignment on BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack");
static_assert(sizeof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack) == 0x000140, "Wrong size on BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, EntryPoint) == 0x000000, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_BreakTransform_Location) == 0x000048, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_BreakTransform_Rotation) == 0x000054, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_BreakTransform_Scale) == 0x000060, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00006C, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_PostEventAtLocation_ReturnValue) == 0x000084, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000088, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, K2Node_ComponentBoundEvent_Interacter_1) == 0x000090, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::K2Node_ComponentBoundEvent_Interacter_1' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, K2Node_ComponentBoundEvent_Interactable_1) == 0x000098, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_GetTransform_ReturnValue) == 0x0000B0, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_GetLocalRole_ReturnValue) == 0x0000E0, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E8, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F8, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_GetComponentByClass_ReturnValue) == 0x000100, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, K2Node_ComponentBoundEvent_Interacter) == 0x000110, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::K2Node_ComponentBoundEvent_Interacter' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, K2Node_ComponentBoundEvent_Interactable) == 0x000118, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, CallFunc_GetSpyOwner_ReturnValue) == 0x000120, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::CallFunc_GetSpyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, K2Node_DynamicCast_AsBPI_VO) == 0x000128, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::K2Node_DynamicCast_AsBPI_VO' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_Spy_SpyPack_C_ExecuteUbergraph_BP_Spy_SpyPack::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Spy_SpyPack.BP_Spy_SpyPack_C.BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Spy_SpyPack_C_BndEvt__BP_Spy_SpyPack_InteractableComp_K2Node_ComponentBoundEvent_1_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

// Function BP_Spy_SpyPack.BP_Spy_SpyPack_C.BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(sizeof(BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature");
static_assert(offsetof(BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interacter) == 0x000000, "Member 'BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interacter' has a wrong offset!");
static_assert(offsetof(BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature, Interactable) == 0x000008, "Member 'BP_Spy_SpyPack_C_BndEvt__InteractableComp_K2Node_ComponentBoundEvent_0_OnInteractionDelegate__DelegateSignature::Interactable' has a wrong offset!");

}

