#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VictimEffect_SocialBattery

#include "Basic.hpp"

#include "DeceiveInc_structs.hpp"


namespace SDK::Params
{

// Function BP_VictimEffect_SocialBattery.BP_VictimEffect_SocialBattery_C.ExecuteUbergraph_BP_VictimEffect_SocialBattery
// 0x0138 (0x0138 - 0x0000)
struct BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpy*                                   K2Node_DynamicCast_AsSpy;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialBatteryData                     CallFunc_GetSocialBatteryData_SocialBatteryData;   // 0x0018(0x0060)()
	ESecurityLevel                                CallFunc_GetPowerupLevel_Level;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPowerupLevel_bAvailable;               // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVictimEffectTickBehavior*              K2Node_Event_TickEffect;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSocialBatteryData                     CallFunc_GetSocialBatteryData_SocialBatteryData_1; // 0x0088(0x0060)()
	class UVictimEffectTickBehavior_Damage*       K2Node_DynamicCast_AsVictim_Effect_Tick_Behavior_Damage; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVictimEffect*                          K2Node_Event_Effect;                               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Victim;                               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSocialBatteryPerLevelData             CallFunc_Map_Find_Value;                           // 0x0108(0x000C)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpy*                                   K2Node_DynamicCast_AsSpy_1;                        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESecurityLevel                                CallFunc_GetPowerupLevel_Level_1;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPowerupLevel_bAvailable_1;             // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialBatteryPerLevelData             CallFunc_Map_Find_Value_1;                         // 0x0124(0x000C)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery) == 0x000008, "Wrong alignment on BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery");
static_assert(sizeof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery) == 0x000138, "Wrong size on BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, EntryPoint) == 0x000000, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_DynamicCast_AsSpy) == 0x000008, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_DynamicCast_AsSpy' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_GetSocialBatteryData_SocialBatteryData) == 0x000018, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_GetSocialBatteryData_SocialBatteryData' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_GetPowerupLevel_Level) == 0x000078, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_GetPowerupLevel_Level' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_GetPowerupLevel_bAvailable) == 0x000079, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_GetPowerupLevel_bAvailable' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_Event_TickEffect) == 0x000080, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_Event_TickEffect' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_GetSocialBatteryData_SocialBatteryData_1) == 0x000088, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_GetSocialBatteryData_SocialBatteryData_1' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_DynamicCast_AsVictim_Effect_Tick_Behavior_Damage) == 0x0000E8, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_DynamicCast_AsVictim_Effect_Tick_Behavior_Damage' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_Event_Effect) == 0x0000F8, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_Event_Effect' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_Event_Victim) == 0x000100, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_Event_Victim' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_Map_Find_Value) == 0x000108, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_Map_Find_ReturnValue) == 0x000114, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_DynamicCast_AsSpy_1) == 0x000118, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_DynamicCast_AsSpy_1' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_GetPowerupLevel_Level_1) == 0x000121, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_GetPowerupLevel_Level_1' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_GetPowerupLevel_bAvailable_1) == 0x000122, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_GetPowerupLevel_bAvailable_1' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_Map_Find_Value_1) == 0x000124, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery, CallFunc_Map_Find_ReturnValue_1) == 0x000130, "Member 'BP_VictimEffect_SocialBattery_C_ExecuteUbergraph_BP_VictimEffect_SocialBattery::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function BP_VictimEffect_SocialBattery.BP_VictimEffect_SocialBattery_C.BP_OnEffectStart
// 0x0010 (0x0010 - 0x0000)
struct BP_VictimEffect_SocialBattery_C_BP_OnEffectStart final
{
public:
	class AVictimEffect*                          Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Victim;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VictimEffect_SocialBattery_C_BP_OnEffectStart) == 0x000008, "Wrong alignment on BP_VictimEffect_SocialBattery_C_BP_OnEffectStart");
static_assert(sizeof(BP_VictimEffect_SocialBattery_C_BP_OnEffectStart) == 0x000010, "Wrong size on BP_VictimEffect_SocialBattery_C_BP_OnEffectStart");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_BP_OnEffectStart, Effect) == 0x000000, "Member 'BP_VictimEffect_SocialBattery_C_BP_OnEffectStart::Effect' has a wrong offset!");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_BP_OnEffectStart, Victim) == 0x000008, "Member 'BP_VictimEffect_SocialBattery_C_BP_OnEffectStart::Victim' has a wrong offset!");

// Function BP_VictimEffect_SocialBattery.BP_VictimEffect_SocialBattery_C.BP_InitializeTickEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect final
{
public:
	class UVictimEffectTickBehavior*              TickEffect;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect) == 0x000008, "Wrong alignment on BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect");
static_assert(sizeof(BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect) == 0x000008, "Wrong size on BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect");
static_assert(offsetof(BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect, TickEffect) == 0x000000, "Member 'BP_VictimEffect_SocialBattery_C_BP_InitializeTickEffect::TickEffect' has a wrong offset!");

}

