#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFunctionLibrary_ObjectHighlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "DeceiveInc_structs.hpp"


namespace SDK::Params
{

// Function BPFunctionLibrary_ObjectHighlight.BPFunctionLibrary_ObjectHighlight_C.BPLibrary_ObjectHighlight
// 0x0058 (0x0058 - 0x0000)
struct BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight final
{
public:
	class UPrimitiveComponent*                    HighlightedMesh;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionIconState                         NewStateEnum;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionIconState                         OldStateEnum;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      FXOutline;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ValidColor;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InvalidColor;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX;                                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionIconState                         NewLocalVar_0;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight) == 0x000008, "Wrong alignment on BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight");
static_assert(sizeof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight) == 0x000058, "Wrong size on BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, HighlightedMesh) == 0x000000, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::HighlightedMesh' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, NewStateEnum) == 0x000008, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::NewStateEnum' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, OldStateEnum) == 0x000009, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::OldStateEnum' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, FXOutline) == 0x000010, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::FXOutline' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, __WorldContext) == 0x000018, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, ValidColor) == 0x000020, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::ValidColor' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, InvalidColor) == 0x000030, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::InvalidColor' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, FX) == 0x000040, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::FX' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, NewLocalVar_0) == 0x000048, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000049, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004A, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00004B, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00004C, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_BooleanOR_ReturnValue) == 0x00004D, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00004E, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00004F, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_BooleanOR_ReturnValue_1) == 0x000050, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_Greater_IntInt_ReturnValue) == 0x000052, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlight::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFunctionLibrary_ObjectHighlight.BPFunctionLibrary_ObjectHighlight_C.BPLibrary_ObjectHighlightFXSetup
// 0x00C8 (0x00C8 - 0x0000)
struct BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup final
{
public:
	class UPrimitiveComponent*                    Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX;                                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x003C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup) == 0x000008, "Wrong alignment on BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup");
static_assert(sizeof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup) == 0x0000C8, "Wrong size on BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, Mesh) == 0x000000, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::Mesh' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, FX) == 0x000008, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::FX' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, __WorldContext) == 0x000010, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_GetComponentBounds_Origin) == 0x000018, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_GetComponentBounds_BoxExtent) == 0x000024, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_GetComponentBounds_SphereRadius) == 0x000030, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00003C, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup, CallFunc_IsValid_ReturnValue_1) == 0x0000C4, "Member 'BPFunctionLibrary_ObjectHighlight_C_BPLibrary_ObjectHighlightFXSetup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

