#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeceiveInc

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DeceiveInc_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "AccelByteUe4Sdk_structs.hpp"
#include "EnhancedInput_classes.hpp"


namespace SDK
{

// Class DeceiveInc.BotAction
// 0x0020 (0x0048 - 0x0028)
class UBotAction : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnBotActionEnd;                                    // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BotAction">();
	}
	static class UBotAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBotAction>();
	}
};
static_assert(alignof(UBotAction) == 0x000008, "Wrong alignment on UBotAction");
static_assert(sizeof(UBotAction) == 0x000048, "Wrong size on UBotAction");
static_assert(offsetof(UBotAction, OnBotActionEnd) == 0x000028, "Member 'UBotAction::OnBotActionEnd' has a wrong offset!");

// Class DeceiveInc.BotActionInteract
// 0x0070 (0x00B8 - 0x0048)
class UBotActionInteract final : public UBotAction
{
public:
	uint8                                         Pad_48[0x70];                                      // 0x0048(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLocaInteractionCompleted(class UInteracterComponent* Interacter, class UInteractableComponent* Interactable);
	void OnReceiveMoveCompleted(const struct FAIRequestID& RequestId, EPathFollowingResult Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BotActionInteract">();
	}
	static class UBotActionInteract* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBotActionInteract>();
	}
};
static_assert(alignof(UBotActionInteract) == 0x000008, "Wrong alignment on UBotActionInteract");
static_assert(sizeof(UBotActionInteract) == 0x0000B8, "Wrong size on UBotActionInteract");

// Class DeceiveInc.SweetAimAssistInputModifier
// 0x0010 (0x0038 - 0x0028)
class USweetAimAssistInputModifier : public UInputModifier
{
public:
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputThreshold;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeThreshold;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SweetAimAssistInputModifier">();
	}
	static class USweetAimAssistInputModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<USweetAimAssistInputModifier>();
	}
};
static_assert(alignof(USweetAimAssistInputModifier) == 0x000008, "Wrong alignment on USweetAimAssistInputModifier");
static_assert(sizeof(USweetAimAssistInputModifier) == 0x000038, "Wrong size on USweetAimAssistInputModifier");
static_assert(offsetof(USweetAimAssistInputModifier, InputThreshold) == 0x00002C, "Member 'USweetAimAssistInputModifier::InputThreshold' has a wrong offset!");
static_assert(offsetof(USweetAimAssistInputModifier, TimeThreshold) == 0x000030, "Member 'USweetAimAssistInputModifier::TimeThreshold' has a wrong offset!");

// Class DeceiveInc.DIDedicatedServerManager
// 0x00D8 (0x0100 - 0x0028)
class UDIDedicatedServerManager : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldContext;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0xC0];                                      // 0x0040(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DIDedicatedServerManager">();
	}
	static class UDIDedicatedServerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDIDedicatedServerManager>();
	}
};
static_assert(alignof(UDIDedicatedServerManager) == 0x000008, "Wrong alignment on UDIDedicatedServerManager");
static_assert(sizeof(UDIDedicatedServerManager) == 0x000100, "Wrong size on UDIDedicatedServerManager");
static_assert(offsetof(UDIDedicatedServerManager, WorldContext) == 0x000038, "Member 'UDIDedicatedServerManager::WorldContext' has a wrong offset!");

// Class DeceiveInc.BotActionMoveTo
// 0x0018 (0x0060 - 0x0048)
class UBotActionMoveTo final : public UBotAction
{
public:
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReceiveMoveCompleted(const struct FAIRequestID& RequestId, EPathFollowingResult Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BotActionMoveTo">();
	}
	static class UBotActionMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBotActionMoveTo>();
	}
};
static_assert(alignof(UBotActionMoveTo) == 0x000008, "Wrong alignment on UBotActionMoveTo");
static_assert(sizeof(UBotActionMoveTo) == 0x000060, "Wrong size on UBotActionMoveTo");

// Class DeceiveInc.DeceiveIncCheatManager
// 0x0000 (0x0088 - 0x0088)
class UDeceiveIncCheatManager : public UCheatManager
{
public:
	void CheatEndGame();
	void CheatEndGameSrv();
	void CheatIgnorePrivateLobbyMinimumPlayerCount();
	void CheatMenuCatalogueTogglePageLock();
	void CheatMenuEnableFreeLootBundle(int32 ItemId0, int32 ItemId1, int32 ItemId2);
	void CheatMenuEnableInventory();
	void CheatMenuGiveFakeLootBundles(int32 Amount);
	void CheatSetXpTypeLvlAndXp(const class FString& XpType, int32 Lvl, int32 XpAmount, EXpProgressionType ProgressionType);
	void CheatShowcollisionPatch(bool bShow);
	void CheatTestSpawnPlayers(int32 NbTeams, int32 NbPlayersPerTeam);
	void CheatToggleDebugInputAccelerator();
	void CheatToggleDebugWidgetScale();
	void CheatTriggerShaderPrecompile(bool bShowMenu);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DeceiveIncCheatManager">();
	}
	static class UDeceiveIncCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeceiveIncCheatManager>();
	}
};
static_assert(alignof(UDeceiveIncCheatManager) == 0x000008, "Wrong alignment on UDeceiveIncCheatManager");
static_assert(sizeof(UDeceiveIncCheatManager) == 0x000088, "Wrong size on UDeceiveIncCheatManager");

// Class DeceiveInc.AccelByteDedicatedServerManager
// 0x02F0 (0x03F0 - 0x0100)
class alignas(0x10) UAccelByteDedicatedServerManager final : public UDIDedicatedServerManager
{
public:
	uint8                                         Pad_100[0xA0];                                     // 0x0100(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              PendingValidationBeforeMatchUpdate;                // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x240];                                    // 0x01B0(0x0240)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteDedicatedServerManager">();
	}
	static class UAccelByteDedicatedServerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteDedicatedServerManager>();
	}
};
static_assert(alignof(UAccelByteDedicatedServerManager) == 0x000010, "Wrong alignment on UAccelByteDedicatedServerManager");
static_assert(sizeof(UAccelByteDedicatedServerManager) == 0x0003F0, "Wrong size on UAccelByteDedicatedServerManager");
static_assert(offsetof(UAccelByteDedicatedServerManager, PendingValidationBeforeMatchUpdate) == 0x0001A0, "Member 'UAccelByteDedicatedServerManager::PendingValidationBeforeMatchUpdate' has a wrong offset!");

// Class DeceiveInc.BotObjectiveRequirement
// 0x0008 (0x0030 - 0x0028)
class UBotObjectiveRequirement : public UObject
{
public:
	class UBotObjective*                          ObjectiveToResolveRequirement;                     // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BotObjectiveRequirement">();
	}
	static class UBotObjectiveRequirement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBotObjectiveRequirement>();
	}
};
static_assert(alignof(UBotObjectiveRequirement) == 0x000008, "Wrong alignment on UBotObjectiveRequirement");
static_assert(sizeof(UBotObjectiveRequirement) == 0x000030, "Wrong size on UBotObjectiveRequirement");
static_assert(offsetof(UBotObjectiveRequirement, ObjectiveToResolveRequirement) == 0x000028, "Member 'UBotObjectiveRequirement::ObjectiveToResolveRequirement' has a wrong offset!");

// Class DeceiveInc.BotObjectiveRequirementResource
// 0x0008 (0x0038 - 0x0030)
class UBotObjectiveRequirementResource final : public UBotObjectiveRequirement
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BotObjectiveRequirementResource">();
	}
	static class UBotObjectiveRequirementResource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBotObjectiveRequirementResource>();
	}
};
static_assert(alignof(UBotObjectiveRequirementResource) == 0x000008, "Wrong alignment on UBotObjectiveRequirementResource");
static_assert(sizeof(UBotObjectiveRequirementResource) == 0x000038, "Wrong size on UBotObjectiveRequirementResource");

// Class DeceiveInc.BaseSpyTool
// 0x0310 (0x0530 - 0x0220)
class ABaseSpyTool : public AActor
{
public:
	FMulticastInlineDelegateProperty_             OnSpyToolEvent;                                    // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSpyToolNewOwner;                                 // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnOperatorRelease;                                 // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnActionTextDataChanged;                           // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnChargeAmountChanged;                             // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnVisibilityChanged;                               // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnToolAttachToComponents;                          // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnToolCooldownChanged;                             // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bBlockLeftHandFlavorAnimationsOnADS;               // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MovementSet3P;                                     // 0x02A4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              Anim_1P_Class;                                     // 0x02B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAnimInstance>              Anim_3P_Class;                                     // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLinkAnimation;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayResourcesType                        ToolResourceType;                                  // 0x02C1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpyToolType                                  SpyToolType;                                       // 0x02C2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ToolResourceToGiveAtStart;                         // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FToolWidgetParam>               ToolWidgetsToSpawn;                                // 0x02C8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class USlateBrushAsset*                       ToolIcon;                                          // 0x02D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   ToolPrimaryActionText;                             // 0x02E0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   ToolSecondaryActionText;                           // 0x02F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowReticule;                                     // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlockRunOnADS;                                    // 0x0311(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlockRunFire;                                     // 0x0312(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBeShowWithOtherTool;                           // 0x0313(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PreferredAttachSocket;                             // 0x0314(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBAimAssistConfigDataAsset*            AimAssistConfig;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ToolBalancingName;                                 // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             ToolBalancingDataTable;                            // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bToolGeneratesHeat;                                // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             ActiveToolBalancingDataTable;                      // 0x0340(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreRightArmInHurtAdditive;                     // 0x0348(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorAffectedComponent*                EMPAffectedComponent;                              // 0x0350(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActorAffectedComponent*                ScramblerAffectedComponent;                        // 0x0358(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FToolAssetsId                          ToolAssetsId;                                      // 0x0360(0x0024)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               PoudrierPreviewTexture;                            // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UMaterialInstance>> ToolWrapMaterials;                                 // 0x0390(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class ABaseSpyTool*                           SecondaryTool;                                     // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABaseSpyTool*                           IsSecondaryToolFor;                                // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABaseSpyTool*                           OwningTool;                                        // 0x03B0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UActorComponent*>                ComponentsToApplyWrap;                             // 0x03B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class AActor*>              AnimationProps1P;                                  // 0x03C8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class AActor*>              AnimationProps3P;                                  // 0x0418(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_468[0x10];                                     // 0x0468(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    ShowedHUD;                                         // 0x0478(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSet<class AActor*>                           IgnoredActors;                                     // 0x0488(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UUserWidget*>         ToolWidgets;                                       // 0x04D8(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_528[0x8];                                      // 0x0528(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddActorToIgnoreList(class AActor* TargetActor);
	bool AnimSwitchToPoudrier(bool bFirstPerson);
	void ApplyNewBalancingTableAndUpdateStats(class UDataTable* NewTable, class FName NewBalancingName);
	void ApplyWrapToComponent(class UMeshComponent* TargetComponent, bool ApplyToChildrens);
	void AttachToNewPreferredAttachSocket(class USceneComponent* Parent, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies, class FName NewPreferredAttachSocket);
	void BP_HideToolFromAnim(bool bShouldAffectSecondaryTool);
	void BP_OnGameRulesetChanged();
	void BP_OnOperatorRelease(class AActor* ReleasingOperator);
	void BP_OnOwnerSet(class ABaseSpyTool* SpyTool);
	void BP_OnPrimaryBegin(class ABaseSpyTool* SpyTool);
	void BP_OnPrimaryEnd(class ABaseSpyTool* SpyTool);
	void BP_OnPrimaryFailed(class ABaseSpyTool* SpyTool);
	void BP_OnRecycleBegin(class ABaseSpyTool* SpyTool);
	void BP_OnRecycleEnd(class ABaseSpyTool* SpyTool);
	void BP_OnSecondaryBegin(class ABaseSpyTool* SpyTool);
	void BP_OnSecondaryEnd(class ABaseSpyTool* SpyTool);
	void BP_OnSecondaryFailed(class ABaseSpyTool* SpyTool);
	void BP_OnSetupResource(class ABaseSpyTool* SpyTool);
	void BP_OnSpyToolEvent(ESpyToolEvent Event, class ABaseSpyTool* SpyTool);
	void BP_OnSwitchAwayFrom(class ABaseSpyTool* SpyTool);
	void BP_OnSwitchTo(class ABaseSpyTool* SpyTool);
	void BP_ShowToolFromAnim(bool bShouldAffectSecondaryTool);
	void BP_ShowToolFromSecondaryVisibilityFromAnim(bool bShouldAffectSecondaryTool);
	void BP_ShowToolHUD(class FName HUDName, bool bShowIn);
	class AActor* CreateAnimationProp(class FName NameID, TSubclassOf<class AActor> ActorToCreate, class FName AttachSocket, bool bFirstPerson);
	void DestroyAllAnimationProps();
	void DestroyAnimationProp(class FName NameID, bool bFirstPerson);
	void FireEvent(ESpyToolEvent Event);
	class AActor* GetAnimationProp(class FName NameID, bool bFirstPerson);
	EVisibilityMode GetCurrentVisibility();
	void GetToolActionsData(struct FToolActionTextData* PrimaryActionData, struct FToolActionTextData* SecondaryActionData);
	void HandleEMPIsAffectedChanged(bool bIsAffected, class AActor* AffectedActor);
	void HandleGameRulesChanged(EDIGameRuleset NewRuleset);
	void HandleLoadoutSpawnComplete(class UToolLoadoutComponent* ToolLoadout);
	void HandleScramblerIsAffectedChanged(bool bIsAffected, class AActor* AffectedActor);
	void HandleToolCooldownChange(bool bOnCooldown);
	bool IsAllowingMelee();
	void NetMulticast_NotifyPrimaryGadgetUse(bool bStart);
	void NetMulticast_NotifySecondaryGadgetUse(bool bStart);
	void OnAnyHandToolShowed(class ABaseSpyTool* SpyTool, ELoadoutSlot HandToolSlot);
	void OnPlayerHUDVisibilityChange(bool bVisible);
	void OnRep_NewToolAssetsId();
	void OnSpyDeath(class AActor* DeadActor);
	void PrimaryBegin();
	void PrimaryEnd();
	void PrimaryFailed();
	void RecycleBegin();
	void RecycleEnd();
	void RemoveActorFromIgnoreList(class AActor* TargetActor);
	void SecondaryBegin();
	void SecondaryEnd();
	void SecondaryFailed();
	void Server_NotifyPrimaryGadgetUse(bool bStart);
	void Server_NotifySecondaryGadgetUse(bool bStart);
	void SetLocalVisibility(EVisibilityMode InMode, bool bCanShowPoudrier, EToolVisibilityChangeReason InReason);
	void SetVisibility(bool bVisible);
	bool ShouldShowPoudrierMesh();
	void SwitchAwayFrom();
	void SwitchTo();
	void UpdateActionTextData();
	void UpdateStatsFromBalancingTable();

	bool CanBeUse() const;
	bool CanRecycle() const;
	class USBAimAssistConfigDataAsset* GetAimAssistConfiguration() const;
	TSubclassOf<class UAnimInstance> GetAnim1PClass() const;
	TSubclassOf<class UAnimInstance> GetAnim3PClass() const;
	int32 GetComittedResourceNum() const;
	class USkeletalMeshComponent* GetCurrentActiveMesh() const;
	const TSet<class AActor*> GetIgnoredActors() const;
	int32 GetInitChargeCount() const;
	int32 GetMaxResourceNum() const;
	class USkeletalMeshComponent* GetMeshComponent1P() const;
	class USkeletalMeshComponent* GetMeshComponent3P() const;
	class AController* GetOperatingController() const;
	struct FVector GetPositionerBeamLocation() const;
	class FName GetPreferredAttachSocket() const;
	float GetRechargeDuration() const;
	float GetRecycleRatio() const;
	int32 GetResourceNum() const;
	class ABaseSpyTool* GetSecondaryTool() const;
	const ESpyToolType GetSpyToolType() const;
	class UCooldownComponent* GetToolCooldownComponent() const;
	float GetToolCooldownRatio() const;
	class USlateBrushAsset* GetToolIconSlateBrush() const;
	const EGameplayResourcesType GetToolResourceType() const;
	class UUserWidget* GetToolWidget(int32 WidgetIndex) const;
	class UUserWidget* GetToolWidgetByName(class FName WidgetName) const;
	int32 GetUncomittedResourceNum() const;
	bool IsActorInIgnoreList(class AActor* TargetActor) const;
	bool IsKillcamViewTarget() const;
	bool IsLocallyControlled() const;
	bool IsOnCooldown() const;
	bool IsOwnedByBot() const;
	bool IsPrimaryActive() const;
	bool IsPrimaryAvailable() const;
	bool IsRecycleActive() const;
	bool IsRecycleRequested() const;
	bool IsSecondaryActive() const;
	bool IsSecondaryAvailable() const;
	bool IsToolActive() const;
	bool IsToolDisabled() const;
	bool IsToolSelected() const;
	bool IsUserViewIn1P() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseSpyTool">();
	}
	static class ABaseSpyTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseSpyTool>();
	}
};
static_assert(alignof(ABaseSpyTool) == 0x000008, "Wrong alignment on ABaseSpyTool");
static_assert(sizeof(ABaseSpyTool) == 0x000530, "Wrong size on ABaseSpyTool");
static_assert(offsetof(ABaseSpyTool, OnSpyToolEvent) == 0x000220, "Member 'ABaseSpyTool::OnSpyToolEvent' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnSpyToolNewOwner) == 0x000230, "Member 'ABaseSpyTool::OnSpyToolNewOwner' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnOperatorRelease) == 0x000240, "Member 'ABaseSpyTool::OnOperatorRelease' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnActionTextDataChanged) == 0x000250, "Member 'ABaseSpyTool::OnActionTextDataChanged' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnChargeAmountChanged) == 0x000260, "Member 'ABaseSpyTool::OnChargeAmountChanged' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnVisibilityChanged) == 0x000270, "Member 'ABaseSpyTool::OnVisibilityChanged' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnToolAttachToComponents) == 0x000280, "Member 'ABaseSpyTool::OnToolAttachToComponents' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OnToolCooldownChanged) == 0x000290, "Member 'ABaseSpyTool::OnToolCooldownChanged' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bBlockLeftHandFlavorAnimationsOnADS) == 0x0002A0, "Member 'ABaseSpyTool::bBlockLeftHandFlavorAnimationsOnADS' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, MovementSet3P) == 0x0002A4, "Member 'ABaseSpyTool::MovementSet3P' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, Anim_1P_Class) == 0x0002B0, "Member 'ABaseSpyTool::Anim_1P_Class' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, Anim_3P_Class) == 0x0002B8, "Member 'ABaseSpyTool::Anim_3P_Class' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bLinkAnimation) == 0x0002C0, "Member 'ABaseSpyTool::bLinkAnimation' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolResourceType) == 0x0002C1, "Member 'ABaseSpyTool::ToolResourceType' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, SpyToolType) == 0x0002C2, "Member 'ABaseSpyTool::SpyToolType' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolResourceToGiveAtStart) == 0x0002C4, "Member 'ABaseSpyTool::ToolResourceToGiveAtStart' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolWidgetsToSpawn) == 0x0002C8, "Member 'ABaseSpyTool::ToolWidgetsToSpawn' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolIcon) == 0x0002D8, "Member 'ABaseSpyTool::ToolIcon' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolPrimaryActionText) == 0x0002E0, "Member 'ABaseSpyTool::ToolPrimaryActionText' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolSecondaryActionText) == 0x0002F8, "Member 'ABaseSpyTool::ToolSecondaryActionText' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bShowReticule) == 0x000310, "Member 'ABaseSpyTool::bShowReticule' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bBlockRunOnADS) == 0x000311, "Member 'ABaseSpyTool::bBlockRunOnADS' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bBlockRunFire) == 0x000312, "Member 'ABaseSpyTool::bBlockRunFire' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bCanBeShowWithOtherTool) == 0x000313, "Member 'ABaseSpyTool::bCanBeShowWithOtherTool' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, PreferredAttachSocket) == 0x000314, "Member 'ABaseSpyTool::PreferredAttachSocket' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, AimAssistConfig) == 0x000320, "Member 'ABaseSpyTool::AimAssistConfig' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolBalancingName) == 0x000328, "Member 'ABaseSpyTool::ToolBalancingName' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolBalancingDataTable) == 0x000330, "Member 'ABaseSpyTool::ToolBalancingDataTable' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bToolGeneratesHeat) == 0x000338, "Member 'ABaseSpyTool::bToolGeneratesHeat' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ActiveToolBalancingDataTable) == 0x000340, "Member 'ABaseSpyTool::ActiveToolBalancingDataTable' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, bIgnoreRightArmInHurtAdditive) == 0x000348, "Member 'ABaseSpyTool::bIgnoreRightArmInHurtAdditive' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, EMPAffectedComponent) == 0x000350, "Member 'ABaseSpyTool::EMPAffectedComponent' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ScramblerAffectedComponent) == 0x000358, "Member 'ABaseSpyTool::ScramblerAffectedComponent' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolAssetsId) == 0x000360, "Member 'ABaseSpyTool::ToolAssetsId' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, PoudrierPreviewTexture) == 0x000388, "Member 'ABaseSpyTool::PoudrierPreviewTexture' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolWrapMaterials) == 0x000390, "Member 'ABaseSpyTool::ToolWrapMaterials' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, SecondaryTool) == 0x0003A0, "Member 'ABaseSpyTool::SecondaryTool' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, IsSecondaryToolFor) == 0x0003A8, "Member 'ABaseSpyTool::IsSecondaryToolFor' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, OwningTool) == 0x0003B0, "Member 'ABaseSpyTool::OwningTool' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ComponentsToApplyWrap) == 0x0003B8, "Member 'ABaseSpyTool::ComponentsToApplyWrap' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, AnimationProps1P) == 0x0003C8, "Member 'ABaseSpyTool::AnimationProps1P' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, AnimationProps3P) == 0x000418, "Member 'ABaseSpyTool::AnimationProps3P' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ShowedHUD) == 0x000478, "Member 'ABaseSpyTool::ShowedHUD' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, IgnoredActors) == 0x000488, "Member 'ABaseSpyTool::IgnoredActors' has a wrong offset!");
static_assert(offsetof(ABaseSpyTool, ToolWidgets) == 0x0004D8, "Member 'ABaseSpyTool::ToolWidgets' has a wrong offset!");

// Class DeceiveInc.BaseSpyActiveAbility
// 0x0060 (0x0590 - 0x0530)
class ABaseSpyActiveAbility : public ABaseSpyTool
{
public:
	uint8                                         Pad_530[0x8];                                      // 0x0530(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCooldownComponent*                     CooldownComponent;                                 // 0x0538(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UToolLoadoutComponent*                  LoadoutComponent;                                  // 0x0540(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveDuration;                                    // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentToRefund;                                   // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayToCanCancel;                                  // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayToSwitchBackToWeapon;                         // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoDelayToSwitchBackToWeaponOnCancel;              // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisablesInteractWhenActive;                       // 0x0559(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCancelable;                                       // 0x055A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeSilencedWhenActive;                          // 0x055B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNavmodeCancelAbility;                             // 0x055C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCancelableOnPrimaryClick;                         // 0x055D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSwitchToSlot;                                     // 0x055E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceGadgetWhenSwitchingToSlot;                   // 0x055F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSwitchToWeaponOnActiveEnd;                        // 0x0560(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerCooldownOnCancel;                          // 0x0561(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFinitDuration;                                    // 0x0562(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowMeleeWhenActive;                             // 0x0563(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockedByMelee;                                   // 0x0564(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowHealingConsumableWhenActive;                 // 0x0565(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActivated;                                      // 0x0566(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_567[0x1];                                      // 0x0567(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActiveTime;                                        // 0x0568(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56C[0x24];                                     // 0x056C(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnActiveBegin();
	void BP_OnActiveBeginLocal();
	void BP_OnActiveBeginReplicated();
	void BP_OnActiveEnd();
	void BP_OnActiveEndLocal();
	void BP_OnActiveEndReplicated();
	float GetActivePowerRatio();
	void OnSetToStartCooldownTimerEnd();
	void OnSwitchBackToWeaponTimerEnd();
	void OnVaultLockedPhaseStart(class UVaultLockedPhaseInfo* PhaseInfo);
	void OwnerTrigerActiveFailed();
	void ResetPendingActiveAbilityOutAnimation();
	void Server_CancelActivePower(bool bRefundActive);
	void TriggerActivePower();
	void TriggerActivePowerNetMulticast();
	void TriggerDeactivatePowerNetMulticast();
	void TriggerUnhandledActivePressedMulticast();
	void UnhandledActivePressed();

	bool BP_IsActiveInProgress() const;
	float GetActiveTimeLeft() const;
	bool HasPendingActiveAbilityOutAnimation() const;
	bool IsActive() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseSpyActiveAbility">();
	}
	static class ABaseSpyActiveAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseSpyActiveAbility>();
	}
};
static_assert(alignof(ABaseSpyActiveAbility) == 0x000008, "Wrong alignment on ABaseSpyActiveAbility");
static_assert(sizeof(ABaseSpyActiveAbility) == 0x000590, "Wrong size on ABaseSpyActiveAbility");
static_assert(offsetof(ABaseSpyActiveAbility, CooldownComponent) == 0x000538, "Member 'ABaseSpyActiveAbility::CooldownComponent' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, LoadoutComponent) == 0x000540, "Member 'ABaseSpyActiveAbility::LoadoutComponent' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, ActiveDuration) == 0x000548, "Member 'ABaseSpyActiveAbility::ActiveDuration' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, PercentToRefund) == 0x00054C, "Member 'ABaseSpyActiveAbility::PercentToRefund' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, DelayToCanCancel) == 0x000550, "Member 'ABaseSpyActiveAbility::DelayToCanCancel' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, DelayToSwitchBackToWeapon) == 0x000554, "Member 'ABaseSpyActiveAbility::DelayToSwitchBackToWeapon' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bDoDelayToSwitchBackToWeaponOnCancel) == 0x000558, "Member 'ABaseSpyActiveAbility::bDoDelayToSwitchBackToWeaponOnCancel' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bDisablesInteractWhenActive) == 0x000559, "Member 'ABaseSpyActiveAbility::bDisablesInteractWhenActive' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bCancelable) == 0x00055A, "Member 'ABaseSpyActiveAbility::bCancelable' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bCanBeSilencedWhenActive) == 0x00055B, "Member 'ABaseSpyActiveAbility::bCanBeSilencedWhenActive' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bNavmodeCancelAbility) == 0x00055C, "Member 'ABaseSpyActiveAbility::bNavmodeCancelAbility' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bCancelableOnPrimaryClick) == 0x00055D, "Member 'ABaseSpyActiveAbility::bCancelableOnPrimaryClick' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bSwitchToSlot) == 0x00055E, "Member 'ABaseSpyActiveAbility::bSwitchToSlot' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bForceGadgetWhenSwitchingToSlot) == 0x00055F, "Member 'ABaseSpyActiveAbility::bForceGadgetWhenSwitchingToSlot' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bSwitchToWeaponOnActiveEnd) == 0x000560, "Member 'ABaseSpyActiveAbility::bSwitchToWeaponOnActiveEnd' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bTriggerCooldownOnCancel) == 0x000561, "Member 'ABaseSpyActiveAbility::bTriggerCooldownOnCancel' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bFinitDuration) == 0x000562, "Member 'ABaseSpyActiveAbility::bFinitDuration' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bAllowMeleeWhenActive) == 0x000563, "Member 'ABaseSpyActiveAbility::bAllowMeleeWhenActive' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bBlockedByMelee) == 0x000564, "Member 'ABaseSpyActiveAbility::bBlockedByMelee' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bAllowHealingConsumableWhenActive) == 0x000565, "Member 'ABaseSpyActiveAbility::bAllowHealingConsumableWhenActive' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, bIsActivated) == 0x000566, "Member 'ABaseSpyActiveAbility::bIsActivated' has a wrong offset!");
static_assert(offsetof(ABaseSpyActiveAbility, ActiveTime) == 0x000568, "Member 'ABaseSpyActiveAbility::ActiveTime' has a wrong offset!");

// Class DeceiveInc.ChavezActiveAbilityMod2_1
// 0x0098 (0x0628 - 0x0590)
class AChavezActiveAbilityMod2_1 final : public ABaseSpyActiveAbility
{
public:
	float                                         TriggerDelay;                                      // 0x0590(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_594[0xC];                                      // 0x0594(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpulseStrength;                                   // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ImpulseStrengthOOCSpy;                             // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SweepHalfExtends;                                  // 0x05A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ForwardSweepOffestMul;                             // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BumpOOCSpyDamage;                                  // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BumpImpulseVerticalOffset;                         // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          BumpBlowCoverSpiesAlways;                          // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          BumpOpenLockedDoors;                               // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          BumpDestroysTools;                                 // 0x05C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C3[0x1];                                      // 0x05C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BumpDelayAfterSpy;                                 // 0x05C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DoorBumpOpenDuration;                              // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             BumpCollCheck;                                     // 0x05CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBumpAffectAllies;                                 // 0x05CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAllStarActive;                                  // 0x05CE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5CF[0x1];                                      // 0x05CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnChavezBumpActor;                                 // 0x05D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnChavezBumpSpy;                                   // 0x05E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnChavezBumpNPC;                                   // 0x05F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnChavezBumpDoor;                                  // 0x0600(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnChavezBumpTool;                                  // 0x0610(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 CurrentBumpedActor;                                // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_DoorBumped(class ABaseDoorActor* Door);
	void MulticastBumpActor(class AActor* BumpedActor);
	void OnTriggerDelayTimer();
	void TryBumpActor(class AActor* ToBump);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChavezActiveAbilityMod2_1">();
	}
	static class AChavezActiveAbilityMod2_1* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChavezActiveAbilityMod2_1>();
	}
};
static_assert(alignof(AChavezActiveAbilityMod2_1) == 0x000008, "Wrong alignment on AChavezActiveAbilityMod2_1");
static_assert(sizeof(AChavezActiveAbilityMod2_1) == 0x000628, "Wrong size on AChavezActiveAbilityMod2_1");
static_assert(offsetof(AChavezActiveAbilityMod2_1, TriggerDelay) == 0x000590, "Member 'AChavezActiveAbilityMod2_1::TriggerDelay' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, ImpulseStrength) == 0x0005A0, "Member 'AChavezActiveAbilityMod2_1::ImpulseStrength' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, ImpulseStrengthOOCSpy) == 0x0005A4, "Member 'AChavezActiveAbilityMod2_1::ImpulseStrengthOOCSpy' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, SweepHalfExtends) == 0x0005A8, "Member 'AChavezActiveAbilityMod2_1::SweepHalfExtends' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, ForwardSweepOffestMul) == 0x0005B4, "Member 'AChavezActiveAbilityMod2_1::ForwardSweepOffestMul' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpOOCSpyDamage) == 0x0005B8, "Member 'AChavezActiveAbilityMod2_1::BumpOOCSpyDamage' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpImpulseVerticalOffset) == 0x0005BC, "Member 'AChavezActiveAbilityMod2_1::BumpImpulseVerticalOffset' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpBlowCoverSpiesAlways) == 0x0005C0, "Member 'AChavezActiveAbilityMod2_1::BumpBlowCoverSpiesAlways' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpOpenLockedDoors) == 0x0005C1, "Member 'AChavezActiveAbilityMod2_1::BumpOpenLockedDoors' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpDestroysTools) == 0x0005C2, "Member 'AChavezActiveAbilityMod2_1::BumpDestroysTools' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpDelayAfterSpy) == 0x0005C4, "Member 'AChavezActiveAbilityMod2_1::BumpDelayAfterSpy' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, DoorBumpOpenDuration) == 0x0005C8, "Member 'AChavezActiveAbilityMod2_1::DoorBumpOpenDuration' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, BumpCollCheck) == 0x0005CC, "Member 'AChavezActiveAbilityMod2_1::BumpCollCheck' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, bBumpAffectAllies) == 0x0005CD, "Member 'AChavezActiveAbilityMod2_1::bBumpAffectAllies' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, bIsAllStarActive) == 0x0005CE, "Member 'AChavezActiveAbilityMod2_1::bIsAllStarActive' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, OnChavezBumpActor) == 0x0005D0, "Member 'AChavezActiveAbilityMod2_1::OnChavezBumpActor' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, OnChavezBumpSpy) == 0x0005E0, "Member 'AChavezActiveAbilityMod2_1::OnChavezBumpSpy' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, OnChavezBumpNPC) == 0x0005F0, "Member 'AChavezActiveAbilityMod2_1::OnChavezBumpNPC' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, OnChavezBumpDoor) == 0x000600, "Member 'AChavezActiveAbilityMod2_1::OnChavezBumpDoor' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, OnChavezBumpTool) == 0x000610, "Member 'AChavezActiveAbilityMod2_1::OnChavezBumpTool' has a wrong offset!");
static_assert(offsetof(AChavezActiveAbilityMod2_1, CurrentBumpedActor) == 0x000620, "Member 'AChavezActiveAbilityMod2_1::CurrentBumpedActor' has a wrong offset!");

// Class DeceiveInc.DISessionSubsystem
// 0x0168 (0x0198 - 0x0030)
class UDISessionSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xD0];                                      // 0x0030(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSessionUpdated;                                  // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCheatEnableInventoryCheck;                       // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCheatMenuEnableFreeLootBundle;                   // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 BanditId;                                          // 0x0148(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ProfileVisibility;                                 // 0x0158(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TwitchAccountLinked;                               // 0x0159(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBetaAccess;                                    // 0x015A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSteamSharing;                                   // 0x015B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsToxic;                                          // 0x015C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GameLiftPlayerSessionId;                           // 0x0160(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDISessionProgression*                  Progression;                                       // 0x0170(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDISessionSelections*                   SessionSelections;                                 // 0x0178(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDISessionInventory*                    PlayerInventory;                                   // 0x0180(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDISessionLoot*                         PlayerLoot;                                        // 0x0188(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
