#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeceiveInc

#include "Basic.hpp"

#include "DeceiveInc_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Agones_structs.hpp"
#include "OnlineSubsystemAccelByte_structs.hpp"
#include "AccelByteUe4Sdk_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DeceiveInc.BotActionInteract.OnLocaInteractionCompleted
// 0x0010 (0x0010 - 0x0000)
struct BotActionInteract_OnLocaInteractionCompleted final
{
public:
	class UInteracterComponent*                   Interacter;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInteractableComponent*                 Interactable;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BotActionInteract_OnLocaInteractionCompleted) == 0x000008, "Wrong alignment on BotActionInteract_OnLocaInteractionCompleted");
static_assert(sizeof(BotActionInteract_OnLocaInteractionCompleted) == 0x000010, "Wrong size on BotActionInteract_OnLocaInteractionCompleted");
static_assert(offsetof(BotActionInteract_OnLocaInteractionCompleted, Interacter) == 0x000000, "Member 'BotActionInteract_OnLocaInteractionCompleted::Interacter' has a wrong offset!");
static_assert(offsetof(BotActionInteract_OnLocaInteractionCompleted, Interactable) == 0x000008, "Member 'BotActionInteract_OnLocaInteractionCompleted::Interactable' has a wrong offset!");

// Function DeceiveInc.BotActionInteract.OnReceiveMoveCompleted
// 0x0008 (0x0008 - 0x0000)
struct BotActionInteract_OnReceiveMoveCompleted final
{
public:
	struct FAIRequestID                           RequestId;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPathFollowingResult                          Result;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BotActionInteract_OnReceiveMoveCompleted) == 0x000004, "Wrong alignment on BotActionInteract_OnReceiveMoveCompleted");
static_assert(sizeof(BotActionInteract_OnReceiveMoveCompleted) == 0x000008, "Wrong size on BotActionInteract_OnReceiveMoveCompleted");
static_assert(offsetof(BotActionInteract_OnReceiveMoveCompleted, RequestId) == 0x000000, "Member 'BotActionInteract_OnReceiveMoveCompleted::RequestId' has a wrong offset!");
static_assert(offsetof(BotActionInteract_OnReceiveMoveCompleted, Result) == 0x000004, "Member 'BotActionInteract_OnReceiveMoveCompleted::Result' has a wrong offset!");

// Function DeceiveInc.BotActionMoveTo.OnReceiveMoveCompleted
// 0x0008 (0x0008 - 0x0000)
struct BotActionMoveTo_OnReceiveMoveCompleted final
{
public:
	struct FAIRequestID                           RequestId;                                         // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPathFollowingResult                          Result;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BotActionMoveTo_OnReceiveMoveCompleted) == 0x000004, "Wrong alignment on BotActionMoveTo_OnReceiveMoveCompleted");
static_assert(sizeof(BotActionMoveTo_OnReceiveMoveCompleted) == 0x000008, "Wrong size on BotActionMoveTo_OnReceiveMoveCompleted");
static_assert(offsetof(BotActionMoveTo_OnReceiveMoveCompleted, RequestId) == 0x000000, "Member 'BotActionMoveTo_OnReceiveMoveCompleted::RequestId' has a wrong offset!");
static_assert(offsetof(BotActionMoveTo_OnReceiveMoveCompleted, Result) == 0x000004, "Member 'BotActionMoveTo_OnReceiveMoveCompleted::Result' has a wrong offset!");

// Function DeceiveInc.DeceiveIncCheatManager.CheatMenuEnableFreeLootBundle
// 0x000C (0x000C - 0x0000)
struct DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle final
{
public:
	int32                                         ItemId0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemId1;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemId2;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle) == 0x000004, "Wrong alignment on DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle");
static_assert(sizeof(DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle) == 0x00000C, "Wrong size on DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle");
static_assert(offsetof(DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle, ItemId0) == 0x000000, "Member 'DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle::ItemId0' has a wrong offset!");
static_assert(offsetof(DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle, ItemId1) == 0x000004, "Member 'DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle::ItemId1' has a wrong offset!");
static_assert(offsetof(DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle, ItemId2) == 0x000008, "Member 'DeceiveIncCheatManager_CheatMenuEnableFreeLootBundle::ItemId2' has a wrong offset!");

// Function DeceiveInc.DeceiveIncCheatManager.CheatMenuGiveFakeLootBundles
// 0x0004 (0x0004 - 0x0000)
struct DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles) == 0x000004, "Wrong alignment on DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles");
static_assert(sizeof(DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles) == 0x000004, "Wrong size on DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles");
static_assert(offsetof(DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles, Amount) == 0x000000, "Member 'DeceiveIncCheatManager_CheatMenuGiveFakeLootBundles::Amount' has a wrong offset!");

// Function DeceiveInc.DeceiveIncCheatManager.CheatSetXpTypeLvlAndXp
// 0x0020 (0x0020 - 0x0000)
struct DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp final
{
public:
	class FString                                 XpType;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Lvl;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XpAmount;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EXpProgressionType                            ProgressionType;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp) == 0x000008, "Wrong alignment on DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp");
static_assert(sizeof(DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp) == 0x000020, "Wrong size on DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp");
static_assert(offsetof(DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp, XpType) == 0x000000, "Member 'DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp::XpType' has a wrong offset!");
static_assert(offsetof(DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp, Lvl) == 0x000010, "Member 'DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp::Lvl' has a wrong offset!");
static_assert(offsetof(DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp, XpAmount) == 0x000014, "Member 'DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp::XpAmount' has a wrong offset!");
static_assert(offsetof(DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp, ProgressionType) == 0x000018, "Member 'DeceiveIncCheatManager_CheatSetXpTypeLvlAndXp::ProgressionType' has a wrong offset!");

// Function DeceiveInc.DeceiveIncCheatManager.CheatShowcollisionPatch
// 0x0001 (0x0001 - 0x0000)
struct DeceiveIncCheatManager_CheatShowcollisionPatch final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeceiveIncCheatManager_CheatShowcollisionPatch) == 0x000001, "Wrong alignment on DeceiveIncCheatManager_CheatShowcollisionPatch");
static_assert(sizeof(DeceiveIncCheatManager_CheatShowcollisionPatch) == 0x000001, "Wrong size on DeceiveIncCheatManager_CheatShowcollisionPatch");
static_assert(offsetof(DeceiveIncCheatManager_CheatShowcollisionPatch, bShow) == 0x000000, "Member 'DeceiveIncCheatManager_CheatShowcollisionPatch::bShow' has a wrong offset!");

// Function DeceiveInc.DeceiveIncCheatManager.CheatTestSpawnPlayers
// 0x0008 (0x0008 - 0x0000)
struct DeceiveIncCheatManager_CheatTestSpawnPlayers final
{
public:
	int32                                         NbTeams;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NbPlayersPerTeam;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeceiveIncCheatManager_CheatTestSpawnPlayers) == 0x000004, "Wrong alignment on DeceiveIncCheatManager_CheatTestSpawnPlayers");
static_assert(sizeof(DeceiveIncCheatManager_CheatTestSpawnPlayers) == 0x000008, "Wrong size on DeceiveIncCheatManager_CheatTestSpawnPlayers");
static_assert(offsetof(DeceiveIncCheatManager_CheatTestSpawnPlayers, NbTeams) == 0x000000, "Member 'DeceiveIncCheatManager_CheatTestSpawnPlayers::NbTeams' has a wrong offset!");
static_assert(offsetof(DeceiveIncCheatManager_CheatTestSpawnPlayers, NbPlayersPerTeam) == 0x000004, "Member 'DeceiveIncCheatManager_CheatTestSpawnPlayers::NbPlayersPerTeam' has a wrong offset!");

// Function DeceiveInc.DeceiveIncCheatManager.CheatTriggerShaderPrecompile
// 0x0001 (0x0001 - 0x0000)
struct DeceiveIncCheatManager_CheatTriggerShaderPrecompile final
{
public:
	bool                                          bShowMenu;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DeceiveIncCheatManager_CheatTriggerShaderPrecompile) == 0x000001, "Wrong alignment on DeceiveIncCheatManager_CheatTriggerShaderPrecompile");
static_assert(sizeof(DeceiveIncCheatManager_CheatTriggerShaderPrecompile) == 0x000001, "Wrong size on DeceiveIncCheatManager_CheatTriggerShaderPrecompile");
static_assert(offsetof(DeceiveIncCheatManager_CheatTriggerShaderPrecompile, bShowMenu) == 0x000000, "Member 'DeceiveIncCheatManager_CheatTriggerShaderPrecompile::bShowMenu' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.AddActorToIgnoreList
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_AddActorToIgnoreList final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_AddActorToIgnoreList) == 0x000008, "Wrong alignment on BaseSpyTool_AddActorToIgnoreList");
static_assert(sizeof(BaseSpyTool_AddActorToIgnoreList) == 0x000008, "Wrong size on BaseSpyTool_AddActorToIgnoreList");
static_assert(offsetof(BaseSpyTool_AddActorToIgnoreList, TargetActor) == 0x000000, "Member 'BaseSpyTool_AddActorToIgnoreList::TargetActor' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.AnimSwitchToPoudrier
// 0x0002 (0x0002 - 0x0000)
struct BaseSpyTool_AnimSwitchToPoudrier final
{
public:
	bool                                          bFirstPerson;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_AnimSwitchToPoudrier) == 0x000001, "Wrong alignment on BaseSpyTool_AnimSwitchToPoudrier");
static_assert(sizeof(BaseSpyTool_AnimSwitchToPoudrier) == 0x000002, "Wrong size on BaseSpyTool_AnimSwitchToPoudrier");
static_assert(offsetof(BaseSpyTool_AnimSwitchToPoudrier, bFirstPerson) == 0x000000, "Member 'BaseSpyTool_AnimSwitchToPoudrier::bFirstPerson' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_AnimSwitchToPoudrier, ReturnValue) == 0x000001, "Member 'BaseSpyTool_AnimSwitchToPoudrier::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.ApplyNewBalancingTableAndUpdateStats
// 0x0010 (0x0010 - 0x0000)
struct BaseSpyTool_ApplyNewBalancingTableAndUpdateStats final
{
public:
	class UDataTable*                             NewTable;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewBalancingName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_ApplyNewBalancingTableAndUpdateStats) == 0x000008, "Wrong alignment on BaseSpyTool_ApplyNewBalancingTableAndUpdateStats");
static_assert(sizeof(BaseSpyTool_ApplyNewBalancingTableAndUpdateStats) == 0x000010, "Wrong size on BaseSpyTool_ApplyNewBalancingTableAndUpdateStats");
static_assert(offsetof(BaseSpyTool_ApplyNewBalancingTableAndUpdateStats, NewTable) == 0x000000, "Member 'BaseSpyTool_ApplyNewBalancingTableAndUpdateStats::NewTable' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_ApplyNewBalancingTableAndUpdateStats, NewBalancingName) == 0x000008, "Member 'BaseSpyTool_ApplyNewBalancingTableAndUpdateStats::NewBalancingName' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.ApplyWrapToComponent
// 0x0010 (0x0010 - 0x0000)
struct BaseSpyTool_ApplyWrapToComponent final
{
public:
	class UMeshComponent*                         TargetComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyToChildrens;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseSpyTool_ApplyWrapToComponent) == 0x000008, "Wrong alignment on BaseSpyTool_ApplyWrapToComponent");
static_assert(sizeof(BaseSpyTool_ApplyWrapToComponent) == 0x000010, "Wrong size on BaseSpyTool_ApplyWrapToComponent");
static_assert(offsetof(BaseSpyTool_ApplyWrapToComponent, TargetComponent) == 0x000000, "Member 'BaseSpyTool_ApplyWrapToComponent::TargetComponent' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_ApplyWrapToComponent, ApplyToChildrens) == 0x000008, "Member 'BaseSpyTool_ApplyWrapToComponent::ApplyToChildrens' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.AttachToNewPreferredAttachSocket
// 0x0018 (0x0018 - 0x0000)
struct BaseSpyTool_AttachToNewPreferredAttachSocket final
{
public:
	class USceneComponent*                        Parent;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewPreferredAttachSocket;                          // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseSpyTool_AttachToNewPreferredAttachSocket) == 0x000008, "Wrong alignment on BaseSpyTool_AttachToNewPreferredAttachSocket");
static_assert(sizeof(BaseSpyTool_AttachToNewPreferredAttachSocket) == 0x000018, "Wrong size on BaseSpyTool_AttachToNewPreferredAttachSocket");
static_assert(offsetof(BaseSpyTool_AttachToNewPreferredAttachSocket, Parent) == 0x000000, "Member 'BaseSpyTool_AttachToNewPreferredAttachSocket::Parent' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_AttachToNewPreferredAttachSocket, LocationRule) == 0x000008, "Member 'BaseSpyTool_AttachToNewPreferredAttachSocket::LocationRule' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_AttachToNewPreferredAttachSocket, RotationRule) == 0x000009, "Member 'BaseSpyTool_AttachToNewPreferredAttachSocket::RotationRule' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_AttachToNewPreferredAttachSocket, ScaleRule) == 0x00000A, "Member 'BaseSpyTool_AttachToNewPreferredAttachSocket::ScaleRule' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_AttachToNewPreferredAttachSocket, bWeldSimulatedBodies) == 0x00000B, "Member 'BaseSpyTool_AttachToNewPreferredAttachSocket::bWeldSimulatedBodies' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_AttachToNewPreferredAttachSocket, NewPreferredAttachSocket) == 0x00000C, "Member 'BaseSpyTool_AttachToNewPreferredAttachSocket::NewPreferredAttachSocket' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_HideToolFromAnim
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_BP_HideToolFromAnim final
{
public:
	bool                                          bShouldAffectSecondaryTool;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_HideToolFromAnim) == 0x000001, "Wrong alignment on BaseSpyTool_BP_HideToolFromAnim");
static_assert(sizeof(BaseSpyTool_BP_HideToolFromAnim) == 0x000001, "Wrong size on BaseSpyTool_BP_HideToolFromAnim");
static_assert(offsetof(BaseSpyTool_BP_HideToolFromAnim, bShouldAffectSecondaryTool) == 0x000000, "Member 'BaseSpyTool_BP_HideToolFromAnim::bShouldAffectSecondaryTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnOperatorRelease
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnOperatorRelease final
{
public:
	class AActor*                                 ReleasingOperator;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnOperatorRelease) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnOperatorRelease");
static_assert(sizeof(BaseSpyTool_BP_OnOperatorRelease) == 0x000008, "Wrong size on BaseSpyTool_BP_OnOperatorRelease");
static_assert(offsetof(BaseSpyTool_BP_OnOperatorRelease, ReleasingOperator) == 0x000000, "Member 'BaseSpyTool_BP_OnOperatorRelease::ReleasingOperator' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnOwnerSet
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnOwnerSet final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnOwnerSet) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnOwnerSet");
static_assert(sizeof(BaseSpyTool_BP_OnOwnerSet) == 0x000008, "Wrong size on BaseSpyTool_BP_OnOwnerSet");
static_assert(offsetof(BaseSpyTool_BP_OnOwnerSet, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnOwnerSet::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnPrimaryBegin
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnPrimaryBegin final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnPrimaryBegin) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnPrimaryBegin");
static_assert(sizeof(BaseSpyTool_BP_OnPrimaryBegin) == 0x000008, "Wrong size on BaseSpyTool_BP_OnPrimaryBegin");
static_assert(offsetof(BaseSpyTool_BP_OnPrimaryBegin, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnPrimaryBegin::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnPrimaryEnd
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnPrimaryEnd final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnPrimaryEnd) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnPrimaryEnd");
static_assert(sizeof(BaseSpyTool_BP_OnPrimaryEnd) == 0x000008, "Wrong size on BaseSpyTool_BP_OnPrimaryEnd");
static_assert(offsetof(BaseSpyTool_BP_OnPrimaryEnd, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnPrimaryEnd::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnPrimaryFailed
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnPrimaryFailed final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnPrimaryFailed) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnPrimaryFailed");
static_assert(sizeof(BaseSpyTool_BP_OnPrimaryFailed) == 0x000008, "Wrong size on BaseSpyTool_BP_OnPrimaryFailed");
static_assert(offsetof(BaseSpyTool_BP_OnPrimaryFailed, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnPrimaryFailed::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnRecycleBegin
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnRecycleBegin final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnRecycleBegin) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnRecycleBegin");
static_assert(sizeof(BaseSpyTool_BP_OnRecycleBegin) == 0x000008, "Wrong size on BaseSpyTool_BP_OnRecycleBegin");
static_assert(offsetof(BaseSpyTool_BP_OnRecycleBegin, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnRecycleBegin::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnRecycleEnd
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnRecycleEnd final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnRecycleEnd) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnRecycleEnd");
static_assert(sizeof(BaseSpyTool_BP_OnRecycleEnd) == 0x000008, "Wrong size on BaseSpyTool_BP_OnRecycleEnd");
static_assert(offsetof(BaseSpyTool_BP_OnRecycleEnd, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnRecycleEnd::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSecondaryBegin
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnSecondaryBegin final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSecondaryBegin) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSecondaryBegin");
static_assert(sizeof(BaseSpyTool_BP_OnSecondaryBegin) == 0x000008, "Wrong size on BaseSpyTool_BP_OnSecondaryBegin");
static_assert(offsetof(BaseSpyTool_BP_OnSecondaryBegin, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnSecondaryBegin::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSecondaryEnd
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnSecondaryEnd final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSecondaryEnd) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSecondaryEnd");
static_assert(sizeof(BaseSpyTool_BP_OnSecondaryEnd) == 0x000008, "Wrong size on BaseSpyTool_BP_OnSecondaryEnd");
static_assert(offsetof(BaseSpyTool_BP_OnSecondaryEnd, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnSecondaryEnd::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSecondaryFailed
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnSecondaryFailed final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSecondaryFailed) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSecondaryFailed");
static_assert(sizeof(BaseSpyTool_BP_OnSecondaryFailed) == 0x000008, "Wrong size on BaseSpyTool_BP_OnSecondaryFailed");
static_assert(offsetof(BaseSpyTool_BP_OnSecondaryFailed, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnSecondaryFailed::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSetupResource
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnSetupResource final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSetupResource) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSetupResource");
static_assert(sizeof(BaseSpyTool_BP_OnSetupResource) == 0x000008, "Wrong size on BaseSpyTool_BP_OnSetupResource");
static_assert(offsetof(BaseSpyTool_BP_OnSetupResource, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnSetupResource::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSpyToolEvent
// 0x0010 (0x0010 - 0x0000)
struct BaseSpyTool_BP_OnSpyToolEvent final
{
public:
	ESpyToolEvent                                 Event;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseSpyTool*                           SpyTool;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSpyToolEvent) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSpyToolEvent");
static_assert(sizeof(BaseSpyTool_BP_OnSpyToolEvent) == 0x000010, "Wrong size on BaseSpyTool_BP_OnSpyToolEvent");
static_assert(offsetof(BaseSpyTool_BP_OnSpyToolEvent, Event) == 0x000000, "Member 'BaseSpyTool_BP_OnSpyToolEvent::Event' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_BP_OnSpyToolEvent, SpyTool) == 0x000008, "Member 'BaseSpyTool_BP_OnSpyToolEvent::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSwitchAwayFrom
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnSwitchAwayFrom final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSwitchAwayFrom) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSwitchAwayFrom");
static_assert(sizeof(BaseSpyTool_BP_OnSwitchAwayFrom) == 0x000008, "Wrong size on BaseSpyTool_BP_OnSwitchAwayFrom");
static_assert(offsetof(BaseSpyTool_BP_OnSwitchAwayFrom, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnSwitchAwayFrom::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_OnSwitchTo
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_BP_OnSwitchTo final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_OnSwitchTo) == 0x000008, "Wrong alignment on BaseSpyTool_BP_OnSwitchTo");
static_assert(sizeof(BaseSpyTool_BP_OnSwitchTo) == 0x000008, "Wrong size on BaseSpyTool_BP_OnSwitchTo");
static_assert(offsetof(BaseSpyTool_BP_OnSwitchTo, SpyTool) == 0x000000, "Member 'BaseSpyTool_BP_OnSwitchTo::SpyTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_ShowToolFromAnim
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_BP_ShowToolFromAnim final
{
public:
	bool                                          bShouldAffectSecondaryTool;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_ShowToolFromAnim) == 0x000001, "Wrong alignment on BaseSpyTool_BP_ShowToolFromAnim");
static_assert(sizeof(BaseSpyTool_BP_ShowToolFromAnim) == 0x000001, "Wrong size on BaseSpyTool_BP_ShowToolFromAnim");
static_assert(offsetof(BaseSpyTool_BP_ShowToolFromAnim, bShouldAffectSecondaryTool) == 0x000000, "Member 'BaseSpyTool_BP_ShowToolFromAnim::bShouldAffectSecondaryTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_ShowToolFromSecondaryVisibilityFromAnim
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim final
{
public:
	bool                                          bShouldAffectSecondaryTool;                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim) == 0x000001, "Wrong alignment on BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim");
static_assert(sizeof(BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim) == 0x000001, "Wrong size on BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim");
static_assert(offsetof(BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim, bShouldAffectSecondaryTool) == 0x000000, "Member 'BaseSpyTool_BP_ShowToolFromSecondaryVisibilityFromAnim::bShouldAffectSecondaryTool' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.BP_ShowToolHUD
// 0x000C (0x000C - 0x0000)
struct BaseSpyTool_BP_ShowToolHUD final
{
public:
	class FName                                   HUDName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowIn;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseSpyTool_BP_ShowToolHUD) == 0x000004, "Wrong alignment on BaseSpyTool_BP_ShowToolHUD");
static_assert(sizeof(BaseSpyTool_BP_ShowToolHUD) == 0x00000C, "Wrong size on BaseSpyTool_BP_ShowToolHUD");
static_assert(offsetof(BaseSpyTool_BP_ShowToolHUD, HUDName) == 0x000000, "Member 'BaseSpyTool_BP_ShowToolHUD::HUDName' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_BP_ShowToolHUD, bShowIn) == 0x000008, "Member 'BaseSpyTool_BP_ShowToolHUD::bShowIn' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.CreateAnimationProp
// 0x0028 (0x0028 - 0x0000)
struct BaseSpyTool_CreateAnimationProp final
{
public:
	class FName                                   NameID;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorToCreate;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachSocket;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFirstPerson;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_CreateAnimationProp) == 0x000008, "Wrong alignment on BaseSpyTool_CreateAnimationProp");
static_assert(sizeof(BaseSpyTool_CreateAnimationProp) == 0x000028, "Wrong size on BaseSpyTool_CreateAnimationProp");
static_assert(offsetof(BaseSpyTool_CreateAnimationProp, NameID) == 0x000000, "Member 'BaseSpyTool_CreateAnimationProp::NameID' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_CreateAnimationProp, ActorToCreate) == 0x000008, "Member 'BaseSpyTool_CreateAnimationProp::ActorToCreate' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_CreateAnimationProp, AttachSocket) == 0x000010, "Member 'BaseSpyTool_CreateAnimationProp::AttachSocket' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_CreateAnimationProp, bFirstPerson) == 0x000018, "Member 'BaseSpyTool_CreateAnimationProp::bFirstPerson' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_CreateAnimationProp, ReturnValue) == 0x000020, "Member 'BaseSpyTool_CreateAnimationProp::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.DestroyAnimationProp
// 0x000C (0x000C - 0x0000)
struct BaseSpyTool_DestroyAnimationProp final
{
public:
	class FName                                   NameID;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFirstPerson;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseSpyTool_DestroyAnimationProp) == 0x000004, "Wrong alignment on BaseSpyTool_DestroyAnimationProp");
static_assert(sizeof(BaseSpyTool_DestroyAnimationProp) == 0x00000C, "Wrong size on BaseSpyTool_DestroyAnimationProp");
static_assert(offsetof(BaseSpyTool_DestroyAnimationProp, NameID) == 0x000000, "Member 'BaseSpyTool_DestroyAnimationProp::NameID' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_DestroyAnimationProp, bFirstPerson) == 0x000008, "Member 'BaseSpyTool_DestroyAnimationProp::bFirstPerson' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.FireEvent
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_FireEvent final
{
public:
	ESpyToolEvent                                 Event;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_FireEvent) == 0x000001, "Wrong alignment on BaseSpyTool_FireEvent");
static_assert(sizeof(BaseSpyTool_FireEvent) == 0x000001, "Wrong size on BaseSpyTool_FireEvent");
static_assert(offsetof(BaseSpyTool_FireEvent, Event) == 0x000000, "Member 'BaseSpyTool_FireEvent::Event' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.GetAnimationProp
// 0x0018 (0x0018 - 0x0000)
struct BaseSpyTool_GetAnimationProp final
{
public:
	class FName                                   NameID;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFirstPerson;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_GetAnimationProp) == 0x000008, "Wrong alignment on BaseSpyTool_GetAnimationProp");
static_assert(sizeof(BaseSpyTool_GetAnimationProp) == 0x000018, "Wrong size on BaseSpyTool_GetAnimationProp");
static_assert(offsetof(BaseSpyTool_GetAnimationProp, NameID) == 0x000000, "Member 'BaseSpyTool_GetAnimationProp::NameID' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_GetAnimationProp, bFirstPerson) == 0x000008, "Member 'BaseSpyTool_GetAnimationProp::bFirstPerson' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_GetAnimationProp, ReturnValue) == 0x000010, "Member 'BaseSpyTool_GetAnimationProp::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.GetCurrentVisibility
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_GetCurrentVisibility final
{
public:
	EVisibilityMode                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_GetCurrentVisibility) == 0x000001, "Wrong alignment on BaseSpyTool_GetCurrentVisibility");
static_assert(sizeof(BaseSpyTool_GetCurrentVisibility) == 0x000001, "Wrong size on BaseSpyTool_GetCurrentVisibility");
static_assert(offsetof(BaseSpyTool_GetCurrentVisibility, ReturnValue) == 0x000000, "Member 'BaseSpyTool_GetCurrentVisibility::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.GetToolActionsData
// 0x0040 (0x0040 - 0x0000)
struct BaseSpyTool_GetToolActionsData final
{
public:
	struct FToolActionTextData                    PrimaryActionData;                                 // 0x0000(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FToolActionTextData                    SecondaryActionData;                               // 0x0020(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_GetToolActionsData) == 0x000008, "Wrong alignment on BaseSpyTool_GetToolActionsData");
static_assert(sizeof(BaseSpyTool_GetToolActionsData) == 0x000040, "Wrong size on BaseSpyTool_GetToolActionsData");
static_assert(offsetof(BaseSpyTool_GetToolActionsData, PrimaryActionData) == 0x000000, "Member 'BaseSpyTool_GetToolActionsData::PrimaryActionData' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_GetToolActionsData, SecondaryActionData) == 0x000020, "Member 'BaseSpyTool_GetToolActionsData::SecondaryActionData' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.HandleEMPIsAffectedChanged
// 0x0010 (0x0010 - 0x0000)
struct BaseSpyTool_HandleEMPIsAffectedChanged final
{
public:
	bool                                          bIsAffected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AffectedActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_HandleEMPIsAffectedChanged) == 0x000008, "Wrong alignment on BaseSpyTool_HandleEMPIsAffectedChanged");
static_assert(sizeof(BaseSpyTool_HandleEMPIsAffectedChanged) == 0x000010, "Wrong size on BaseSpyTool_HandleEMPIsAffectedChanged");
static_assert(offsetof(BaseSpyTool_HandleEMPIsAffectedChanged, bIsAffected) == 0x000000, "Member 'BaseSpyTool_HandleEMPIsAffectedChanged::bIsAffected' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_HandleEMPIsAffectedChanged, AffectedActor) == 0x000008, "Member 'BaseSpyTool_HandleEMPIsAffectedChanged::AffectedActor' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.HandleGameRulesChanged
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_HandleGameRulesChanged final
{
public:
	EDIGameRuleset                                NewRuleset;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_HandleGameRulesChanged) == 0x000001, "Wrong alignment on BaseSpyTool_HandleGameRulesChanged");
static_assert(sizeof(BaseSpyTool_HandleGameRulesChanged) == 0x000001, "Wrong size on BaseSpyTool_HandleGameRulesChanged");
static_assert(offsetof(BaseSpyTool_HandleGameRulesChanged, NewRuleset) == 0x000000, "Member 'BaseSpyTool_HandleGameRulesChanged::NewRuleset' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.HandleLoadoutSpawnComplete
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_HandleLoadoutSpawnComplete final
{
public:
	class UToolLoadoutComponent*                  ToolLoadout;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_HandleLoadoutSpawnComplete) == 0x000008, "Wrong alignment on BaseSpyTool_HandleLoadoutSpawnComplete");
static_assert(sizeof(BaseSpyTool_HandleLoadoutSpawnComplete) == 0x000008, "Wrong size on BaseSpyTool_HandleLoadoutSpawnComplete");
static_assert(offsetof(BaseSpyTool_HandleLoadoutSpawnComplete, ToolLoadout) == 0x000000, "Member 'BaseSpyTool_HandleLoadoutSpawnComplete::ToolLoadout' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.HandleScramblerIsAffectedChanged
// 0x0010 (0x0010 - 0x0000)
struct BaseSpyTool_HandleScramblerIsAffectedChanged final
{
public:
	bool                                          bIsAffected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AffectedActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_HandleScramblerIsAffectedChanged) == 0x000008, "Wrong alignment on BaseSpyTool_HandleScramblerIsAffectedChanged");
static_assert(sizeof(BaseSpyTool_HandleScramblerIsAffectedChanged) == 0x000010, "Wrong size on BaseSpyTool_HandleScramblerIsAffectedChanged");
static_assert(offsetof(BaseSpyTool_HandleScramblerIsAffectedChanged, bIsAffected) == 0x000000, "Member 'BaseSpyTool_HandleScramblerIsAffectedChanged::bIsAffected' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_HandleScramblerIsAffectedChanged, AffectedActor) == 0x000008, "Member 'BaseSpyTool_HandleScramblerIsAffectedChanged::AffectedActor' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.HandleToolCooldownChange
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_HandleToolCooldownChange final
{
public:
	bool                                          bOnCooldown;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_HandleToolCooldownChange) == 0x000001, "Wrong alignment on BaseSpyTool_HandleToolCooldownChange");
static_assert(sizeof(BaseSpyTool_HandleToolCooldownChange) == 0x000001, "Wrong size on BaseSpyTool_HandleToolCooldownChange");
static_assert(offsetof(BaseSpyTool_HandleToolCooldownChange, bOnCooldown) == 0x000000, "Member 'BaseSpyTool_HandleToolCooldownChange::bOnCooldown' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.IsAllowingMelee
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_IsAllowingMelee final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_IsAllowingMelee) == 0x000001, "Wrong alignment on BaseSpyTool_IsAllowingMelee");
static_assert(sizeof(BaseSpyTool_IsAllowingMelee) == 0x000001, "Wrong size on BaseSpyTool_IsAllowingMelee");
static_assert(offsetof(BaseSpyTool_IsAllowingMelee, ReturnValue) == 0x000000, "Member 'BaseSpyTool_IsAllowingMelee::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.NetMulticast_NotifyPrimaryGadgetUse
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse) == 0x000001, "Wrong alignment on BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse");
static_assert(sizeof(BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse) == 0x000001, "Wrong size on BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse");
static_assert(offsetof(BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse, bStart) == 0x000000, "Member 'BaseSpyTool_NetMulticast_NotifyPrimaryGadgetUse::bStart' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.NetMulticast_NotifySecondaryGadgetUse
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse) == 0x000001, "Wrong alignment on BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse");
static_assert(sizeof(BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse) == 0x000001, "Wrong size on BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse");
static_assert(offsetof(BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse, bStart) == 0x000000, "Member 'BaseSpyTool_NetMulticast_NotifySecondaryGadgetUse::bStart' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.OnAnyHandToolShowed
// 0x0010 (0x0010 - 0x0000)
struct BaseSpyTool_OnAnyHandToolShowed final
{
public:
	class ABaseSpyTool*                           SpyTool;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELoadoutSlot                                  HandToolSlot;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BaseSpyTool_OnAnyHandToolShowed) == 0x000008, "Wrong alignment on BaseSpyTool_OnAnyHandToolShowed");
static_assert(sizeof(BaseSpyTool_OnAnyHandToolShowed) == 0x000010, "Wrong size on BaseSpyTool_OnAnyHandToolShowed");
static_assert(offsetof(BaseSpyTool_OnAnyHandToolShowed, SpyTool) == 0x000000, "Member 'BaseSpyTool_OnAnyHandToolShowed::SpyTool' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_OnAnyHandToolShowed, HandToolSlot) == 0x000008, "Member 'BaseSpyTool_OnAnyHandToolShowed::HandToolSlot' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.OnPlayerHUDVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_OnPlayerHUDVisibilityChange final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_OnPlayerHUDVisibilityChange) == 0x000001, "Wrong alignment on BaseSpyTool_OnPlayerHUDVisibilityChange");
static_assert(sizeof(BaseSpyTool_OnPlayerHUDVisibilityChange) == 0x000001, "Wrong size on BaseSpyTool_OnPlayerHUDVisibilityChange");
static_assert(offsetof(BaseSpyTool_OnPlayerHUDVisibilityChange, bVisible) == 0x000000, "Member 'BaseSpyTool_OnPlayerHUDVisibilityChange::bVisible' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.OnSpyDeath
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_OnSpyDeath final
{
public:
	class AActor*                                 DeadActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_OnSpyDeath) == 0x000008, "Wrong alignment on BaseSpyTool_OnSpyDeath");
static_assert(sizeof(BaseSpyTool_OnSpyDeath) == 0x000008, "Wrong size on BaseSpyTool_OnSpyDeath");
static_assert(offsetof(BaseSpyTool_OnSpyDeath, DeadActor) == 0x000000, "Member 'BaseSpyTool_OnSpyDeath::DeadActor' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.RemoveActorFromIgnoreList
// 0x0008 (0x0008 - 0x0000)
struct BaseSpyTool_RemoveActorFromIgnoreList final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_RemoveActorFromIgnoreList) == 0x000008, "Wrong alignment on BaseSpyTool_RemoveActorFromIgnoreList");
static_assert(sizeof(BaseSpyTool_RemoveActorFromIgnoreList) == 0x000008, "Wrong size on BaseSpyTool_RemoveActorFromIgnoreList");
static_assert(offsetof(BaseSpyTool_RemoveActorFromIgnoreList, TargetActor) == 0x000000, "Member 'BaseSpyTool_RemoveActorFromIgnoreList::TargetActor' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.Server_NotifyPrimaryGadgetUse
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_Server_NotifyPrimaryGadgetUse final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_Server_NotifyPrimaryGadgetUse) == 0x000001, "Wrong alignment on BaseSpyTool_Server_NotifyPrimaryGadgetUse");
static_assert(sizeof(BaseSpyTool_Server_NotifyPrimaryGadgetUse) == 0x000001, "Wrong size on BaseSpyTool_Server_NotifyPrimaryGadgetUse");
static_assert(offsetof(BaseSpyTool_Server_NotifyPrimaryGadgetUse, bStart) == 0x000000, "Member 'BaseSpyTool_Server_NotifyPrimaryGadgetUse::bStart' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.Server_NotifySecondaryGadgetUse
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_Server_NotifySecondaryGadgetUse final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_Server_NotifySecondaryGadgetUse) == 0x000001, "Wrong alignment on BaseSpyTool_Server_NotifySecondaryGadgetUse");
static_assert(sizeof(BaseSpyTool_Server_NotifySecondaryGadgetUse) == 0x000001, "Wrong size on BaseSpyTool_Server_NotifySecondaryGadgetUse");
static_assert(offsetof(BaseSpyTool_Server_NotifySecondaryGadgetUse, bStart) == 0x000000, "Member 'BaseSpyTool_Server_NotifySecondaryGadgetUse::bStart' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.SetLocalVisibility
// 0x0003 (0x0003 - 0x0000)
struct BaseSpyTool_SetLocalVisibility final
{
public:
	EVisibilityMode                               InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanShowPoudrier;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EToolVisibilityChangeReason                   InReason;                                          // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_SetLocalVisibility) == 0x000001, "Wrong alignment on BaseSpyTool_SetLocalVisibility");
static_assert(sizeof(BaseSpyTool_SetLocalVisibility) == 0x000003, "Wrong size on BaseSpyTool_SetLocalVisibility");
static_assert(offsetof(BaseSpyTool_SetLocalVisibility, InMode) == 0x000000, "Member 'BaseSpyTool_SetLocalVisibility::InMode' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_SetLocalVisibility, bCanShowPoudrier) == 0x000001, "Member 'BaseSpyTool_SetLocalVisibility::bCanShowPoudrier' has a wrong offset!");
static_assert(offsetof(BaseSpyTool_SetLocalVisibility, InReason) == 0x000002, "Member 'BaseSpyTool_SetLocalVisibility::InReason' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_SetVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_SetVisibility) == 0x000001, "Wrong alignment on BaseSpyTool_SetVisibility");
static_assert(sizeof(BaseSpyTool_SetVisibility) == 0x000001, "Wrong size on BaseSpyTool_SetVisibility");
static_assert(offsetof(BaseSpyTool_SetVisibility, bVisible) == 0x000000, "Member 'BaseSpyTool_SetVisibility::bVisible' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.ShouldShowPoudrierMesh
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_ShouldShowPoudrierMesh final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_ShouldShowPoudrierMesh) == 0x000001, "Wrong alignment on BaseSpyTool_ShouldShowPoudrierMesh");
static_assert(sizeof(BaseSpyTool_ShouldShowPoudrierMesh) == 0x000001, "Wrong size on BaseSpyTool_ShouldShowPoudrierMesh");
static_assert(offsetof(BaseSpyTool_ShouldShowPoudrierMesh, ReturnValue) == 0x000000, "Member 'BaseSpyTool_ShouldShowPoudrierMesh::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.CanBeUse
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_CanBeUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_CanBeUse) == 0x000001, "Wrong alignment on BaseSpyTool_CanBeUse");
static_assert(sizeof(BaseSpyTool_CanBeUse) == 0x000001, "Wrong size on BaseSpyTool_CanBeUse");
static_assert(offsetof(BaseSpyTool_CanBeUse, ReturnValue) == 0x000000, "Member 'BaseSpyTool_CanBeUse::ReturnValue' has a wrong offset!");

// Function DeceiveInc.BaseSpyTool.CanRecycle
// 0x0001 (0x0001 - 0x0000)
struct BaseSpyTool_CanRecycle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BaseSpyTool_CanRecycle) == 0x000001, "Wrong alignment on BaseSpyTool_CanRecycle");
