#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_PP_Base

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "DeceiveInc_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_PP_Base.HUD_PP_Base_C
// 0x0270 (0x0530 - 0x02C0)
class UHUD_PP_Base_C final : public UNavigationUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DistanceValue;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Effect_Progress;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pin;                                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PP_Icon;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             PP_Icon_Texture;                                   // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            PP_Border_Tint;                                    // 0x02F8(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            PP_Pin_Tint;                                       // 0x0320(0x0028)(Edit, BlueprintVisible)
	struct FVector2D                              PP_Pin_Icon_Size;                                  // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PP_Show_ProgressBar;                               // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            PP_Pin_Icon_Tint;                                  // 0x0358(0x0028)(Edit, BlueprintVisible)
	struct FProgressBarStyle                      PP_ProgressBar_Style;                              // 0x0380(0x01A0)(Edit, BlueprintVisible)
	struct FLinearColor                           PP_ProgressBar_FillColorAndOpacity;                // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUD_PP_Base(int32 EntryPoint);
	void SetPPTexture(class UTexture2D* NewPPTexture);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void GetDistanceInM(int32* Distance);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_PP_Base_C">();
	}
	static class UHUD_PP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_PP_Base_C>();
	}
};
static_assert(alignof(UHUD_PP_Base_C) == 0x000008, "Wrong alignment on UHUD_PP_Base_C");
static_assert(sizeof(UHUD_PP_Base_C) == 0x000530, "Wrong size on UHUD_PP_Base_C");
static_assert(offsetof(UHUD_PP_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UHUD_PP_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, Border) == 0x0002C8, "Member 'UHUD_PP_Base_C::Border' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, DistanceValue) == 0x0002D0, "Member 'UHUD_PP_Base_C::DistanceValue' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, Effect_Progress) == 0x0002D8, "Member 'UHUD_PP_Base_C::Effect_Progress' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, Pin) == 0x0002E0, "Member 'UHUD_PP_Base_C::Pin' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Icon) == 0x0002E8, "Member 'UHUD_PP_Base_C::PP_Icon' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Icon_Texture) == 0x0002F0, "Member 'UHUD_PP_Base_C::PP_Icon_Texture' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Border_Tint) == 0x0002F8, "Member 'UHUD_PP_Base_C::PP_Border_Tint' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Pin_Tint) == 0x000320, "Member 'UHUD_PP_Base_C::PP_Pin_Tint' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Pin_Icon_Size) == 0x000348, "Member 'UHUD_PP_Base_C::PP_Pin_Icon_Size' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Show_ProgressBar) == 0x000350, "Member 'UHUD_PP_Base_C::PP_Show_ProgressBar' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_Pin_Icon_Tint) == 0x000358, "Member 'UHUD_PP_Base_C::PP_Pin_Icon_Tint' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_ProgressBar_Style) == 0x000380, "Member 'UHUD_PP_Base_C::PP_ProgressBar_Style' has a wrong offset!");
static_assert(offsetof(UHUD_PP_Base_C, PP_ProgressBar_FillColorAndOpacity) == 0x000520, "Member 'UHUD_PP_Base_C::PP_ProgressBar_FillColorAndOpacity' has a wrong offset!");

}

