#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_VC_UserV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "DeceiveInc_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_VC_UserV2.HUD_VC_UserV2_C
// 0x0020 (0x02A0 - 0x0280)
class UHUD_VC_UserV2_C final : public UVoicechatMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHUD_PlayerInfoV2_C*                    HUD_PlayerInfoV2_C_0;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeakerIcon;                                       // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUD_VC_UserV2(int32 EntryPoint);
	void OnPlayerInfoUpdated();
	ESlateVisibility Get_SpeakerIcon_Visibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_VC_UserV2_C">();
	}
	static class UHUD_VC_UserV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_VC_UserV2_C>();
	}
};
static_assert(alignof(UHUD_VC_UserV2_C) == 0x000008, "Wrong alignment on UHUD_VC_UserV2_C");
static_assert(sizeof(UHUD_VC_UserV2_C) == 0x0002A0, "Wrong size on UHUD_VC_UserV2_C");
static_assert(offsetof(UHUD_VC_UserV2_C, UberGraphFrame) == 0x000280, "Member 'UHUD_VC_UserV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_VC_UserV2_C, CanvasPanel_0) == 0x000288, "Member 'UHUD_VC_UserV2_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UHUD_VC_UserV2_C, HUD_PlayerInfoV2_C_0) == 0x000290, "Member 'UHUD_VC_UserV2_C::HUD_PlayerInfoV2_C_0' has a wrong offset!");
static_assert(offsetof(UHUD_VC_UserV2_C, SpeakerIcon) == 0x000298, "Member 'UHUD_VC_UserV2_C::SpeakerIcon' has a wrong offset!");

}

