#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_VC_UserV2

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HUD_VC_UserV2.HUD_VC_UserV2_C.ExecuteUbergraph_HUD_VC_UserV2
// 0x0010 (0x0010 - 0x0000)
struct HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADIPlayerState*                         CallFunc_GetPlayerState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2) == 0x000008, "Wrong alignment on HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2");
static_assert(sizeof(HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2) == 0x000010, "Wrong size on HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2");
static_assert(offsetof(HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2, EntryPoint) == 0x000000, "Member 'HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2, CallFunc_GetPlayerState_ReturnValue) == 0x000008, "Member 'HUD_VC_UserV2_C_ExecuteUbergraph_HUD_VC_UserV2::CallFunc_GetPlayerState_ReturnValue' has a wrong offset!");

// Function HUD_VC_UserV2.HUD_VC_UserV2_C.Get_SpeakerIcon_Visibility
// 0x0006 (0x0006 - 0x0000)
struct HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTalking_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility) == 0x000001, "Wrong alignment on HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility");
static_assert(sizeof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility) == 0x000006, "Wrong size on HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility");
static_assert(offsetof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility, ReturnValue) == 0x000000, "Member 'HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility, Temp_bool_Variable) == 0x000001, "Member 'HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility, Temp_byte_Variable) == 0x000002, "Member 'HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility, CallFunc_IsPlayerTalking_ReturnValue) == 0x000004, "Member 'HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility::CallFunc_IsPlayerTalking_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility, K2Node_Select_Default) == 0x000005, "Member 'HUD_VC_UserV2_C_Get_SpeakerIcon_Visibility::K2Node_Select_Default' has a wrong offset!");

}

