#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_Player_VoicechatV2_Master

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HUD_Player_VoicechatV2_Master.HUD_Player_VoicechatV2_Master_C.ExecuteUbergraph_HUD_Player_VoicechatV2_Master
// 0x0068 (0x0068 - 0x0000)
struct HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& StringEvent)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoicechatMemberWidget*                 K2Node_Event_MemberWidget_1;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVoicechatMemberWidget*                 K2Node_Event_MemberWidget;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGlobalEBusSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_StringEvent;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master) == 0x000008, "Wrong alignment on HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master");
static_assert(sizeof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master) == 0x000068, "Wrong size on HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, EntryPoint) == 0x000000, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, K2Node_Event_MemberWidget_1) == 0x000018, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::K2Node_Event_MemberWidget_1' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, K2Node_Event_MemberWidget) == 0x000020, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::K2Node_Event_MemberWidget' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, CallFunc_RemoveChild_ReturnValue) == 0x000030, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, K2Node_MakeStruct_Margin) == 0x000034, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, K2Node_CustomEvent_StringEvent) == 0x000050, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::K2Node_CustomEvent_StringEvent' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000060, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000061, "Member 'HUD_Player_VoicechatV2_Master_C_ExecuteUbergraph_HUD_Player_VoicechatV2_Master::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");

// Function HUD_Player_VoicechatV2_Master.HUD_Player_VoicechatV2_Master_C.OnBlueprintEbusStringEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0 final
{
public:
	class FString                                 StringEvent;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0) == 0x000008, "Wrong alignment on HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0");
static_assert(sizeof(HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0) == 0x000010, "Wrong size on HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0, StringEvent) == 0x000000, "Member 'HUD_Player_VoicechatV2_Master_C_OnBlueprintEbusStringEvent_Event_0::StringEvent' has a wrong offset!");

// Function HUD_Player_VoicechatV2_Master.HUD_Player_VoicechatV2_Master_C.FreeSlotForMemberWidget
// 0x0008 (0x0008 - 0x0000)
struct HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget final
{
public:
	class UVoicechatMemberWidget*                 MemberWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget) == 0x000008, "Wrong alignment on HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget");
static_assert(sizeof(HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget) == 0x000008, "Wrong size on HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget, MemberWidget) == 0x000000, "Member 'HUD_Player_VoicechatV2_Master_C_FreeSlotForMemberWidget::MemberWidget' has a wrong offset!");

// Function HUD_Player_VoicechatV2_Master.HUD_Player_VoicechatV2_Master_C.ReserveSlotForMemberWidget
// 0x0008 (0x0008 - 0x0000)
struct HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget final
{
public:
	class UVoicechatMemberWidget*                 MemberWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget) == 0x000008, "Wrong alignment on HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget");
static_assert(sizeof(HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget) == 0x000008, "Wrong size on HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget");
static_assert(offsetof(HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget, MemberWidget) == 0x000000, "Member 'HUD_Player_VoicechatV2_Master_C_ReserveSlotForMemberWidget::MemberWidget' has a wrong offset!");

}

