#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD_PlayerInfoV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DeceiveInc_structs.hpp"
#include "DeceiveInc_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUD_PlayerInfoV2.HUD_PlayerInfoV2_C
// 0x0138 (0x03A8 - 0x0270)
class UHUD_PlayerInfoV2_C final : public UPlayerInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BtnPlayerInfo;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlatformIcon;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UserNameTxt;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Icon_Brush;                                        // 0x0298(0x0088)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         Text_Font;                                         // 0x0320(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            Text_ColorAndOpacity;                              // 0x0378(0x0028)(Edit, BlueprintVisible)
	ETextJustify                                  Text_Justification;                                // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUD_PlayerInfoV2(int32 EntryPoint);
	void OnPlayerInfoUpdated();
	void BndEvt__HUD_PlayerInfo_BtnPlayerInfo_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetupPlatform();
	bool IsPlayerStateValid();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUD_PlayerInfoV2_C">();
	}
	static class UHUD_PlayerInfoV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUD_PlayerInfoV2_C>();
	}
};
static_assert(alignof(UHUD_PlayerInfoV2_C) == 0x000008, "Wrong alignment on UHUD_PlayerInfoV2_C");
static_assert(sizeof(UHUD_PlayerInfoV2_C) == 0x0003A8, "Wrong size on UHUD_PlayerInfoV2_C");
static_assert(offsetof(UHUD_PlayerInfoV2_C, UberGraphFrame) == 0x000270, "Member 'UHUD_PlayerInfoV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, BtnPlayerInfo) == 0x000278, "Member 'UHUD_PlayerInfoV2_C::BtnPlayerInfo' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, PlatformIcon) == 0x000280, "Member 'UHUD_PlayerInfoV2_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, SizeBox_0) == 0x000288, "Member 'UHUD_PlayerInfoV2_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, UserNameTxt) == 0x000290, "Member 'UHUD_PlayerInfoV2_C::UserNameTxt' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, Icon_Brush) == 0x000298, "Member 'UHUD_PlayerInfoV2_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, Text_Font) == 0x000320, "Member 'UHUD_PlayerInfoV2_C::Text_Font' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, Text_ColorAndOpacity) == 0x000378, "Member 'UHUD_PlayerInfoV2_C::Text_ColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UHUD_PlayerInfoV2_C, Text_Justification) == 0x0003A0, "Member 'UHUD_PlayerInfoV2_C::Text_Justification' has a wrong offset!");

}

