#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LVL_StartupClient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LVL_StartupClient.LVL_StartupClient_C
// 0x0018 (0x0240 - 0x0228)
class ALVL_StartupClient_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvas*                                LegalMenu;                                         // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDIGameInstanceBase*                    DIGameInstanceBase;                                // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LVL_StartupClient(int32 EntryPoint);
	void CustomEvent_0();
	void OnIntentToJoinSession_Event_0();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LVL_StartupClient_C">();
	}
	static class ALVL_StartupClient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALVL_StartupClient_C>();
	}
};
static_assert(alignof(ALVL_StartupClient_C) == 0x000008, "Wrong alignment on ALVL_StartupClient_C");
static_assert(sizeof(ALVL_StartupClient_C) == 0x000240, "Wrong size on ALVL_StartupClient_C");
static_assert(offsetof(ALVL_StartupClient_C, UberGraphFrame) == 0x000228, "Member 'ALVL_StartupClient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALVL_StartupClient_C, LegalMenu) == 0x000230, "Member 'ALVL_StartupClient_C::LegalMenu' has a wrong offset!");
static_assert(offsetof(ALVL_StartupClient_C, DIGameInstanceBase) == 0x000238, "Member 'ALVL_StartupClient_C::DIGameInstanceBase' has a wrong offset!");

}

