#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LVL_StartupClient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function LVL_StartupClient.LVL_StartupClient_C.ExecuteUbergraph_LVL_StartupClient
// 0x00B0 (0x00B0 - 0x0000)
struct LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDIMenuSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDIMenuSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDIGameInstanceBase*                    K2Node_DynamicCast_AsDIGame_Instance_Base;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0038(0x0018)(HasGetValueTypeHash)
	class UDIMenuSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDIMenuSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class USBShaderPrecompilerSubsytem*           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPrecompileShaders_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGlobalEBusSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInLoginState_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_WasLegalScreenShown_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDIMenuSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient) == 0x000008, "Wrong alignment on LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient");
static_assert(sizeof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient) == 0x0000B0, "Wrong size on LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, EntryPoint) == 0x000000, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::EntryPoint' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000018, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, Temp_bool_IsClosed_Variable) == 0x00001A, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, K2Node_DynamicCast_AsDIGame_Instance_Base) == 0x000028, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::K2Node_DynamicCast_AsDIGame_Instance_Base' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, K2Node_InputKeyEvent_Key) == 0x000038, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000050, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, K2Node_Event_EndPlayReason) == 0x000058, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000060, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000078, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_ShouldPrecompileShaders_ReturnValue) == 0x000080, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_ShouldPrecompileShaders_ReturnValue' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000088, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_IsInLoginState_ReturnValue) == 0x0000A0, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_IsInLoginState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_WasLegalScreenShown_ReturnValue) == 0x0000A1, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_WasLegalScreenShown_ReturnValue' has a wrong offset!");
static_assert(offsetof(LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x0000A8, "Member 'LVL_StartupClient_C_ExecuteUbergraph_LVL_StartupClient::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");

// Function LVL_StartupClient.LVL_StartupClient_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LVL_StartupClient_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LVL_StartupClient_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on LVL_StartupClient_C_ReceiveEndPlay");
static_assert(sizeof(LVL_StartupClient_C_ReceiveEndPlay) == 0x000001, "Wrong size on LVL_StartupClient_C_ReceiveEndPlay");
static_assert(offsetof(LVL_StartupClient_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'LVL_StartupClient_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function LVL_StartupClient.LVL_StartupClient_C.InpActEvt_AnyKey_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0");
static_assert(sizeof(LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0");
static_assert(offsetof(LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'LVL_StartupClient_C_InpActEvt_AnyKey_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

}

