#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MENU_ShaderPrecompile

#include "Basic.hpp"


namespace SDK::Params
{

// Function MENU_ShaderPrecompile.MENU_ShaderPrecompile_C.GetText_0
// 0x0018 (0x0018 - 0x0000)
struct MENU_ShaderPrecompile_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(MENU_ShaderPrecompile_C_GetText_0) == 0x000008, "Wrong alignment on MENU_ShaderPrecompile_C_GetText_0");
static_assert(sizeof(MENU_ShaderPrecompile_C_GetText_0) == 0x000018, "Wrong size on MENU_ShaderPrecompile_C_GetText_0");
static_assert(offsetof(MENU_ShaderPrecompile_C_GetText_0, ReturnValue) == 0x000000, "Member 'MENU_ShaderPrecompile_C_GetText_0::ReturnValue' has a wrong offset!");

// Function MENU_ShaderPrecompile.MENU_ShaderPrecompile_C.GetPercent_0
// 0x0018 (0x0018 - 0x0000)
struct MENU_ShaderPrecompile_C_GetPercent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBShaderPrecompilerSubsytem*           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShaderPrecompileProgress_ReturnValue;  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MENU_ShaderPrecompile_C_GetPercent_0) == 0x000008, "Wrong alignment on MENU_ShaderPrecompile_C_GetPercent_0");
static_assert(sizeof(MENU_ShaderPrecompile_C_GetPercent_0) == 0x000018, "Wrong size on MENU_ShaderPrecompile_C_GetPercent_0");
static_assert(offsetof(MENU_ShaderPrecompile_C_GetPercent_0, ReturnValue) == 0x000000, "Member 'MENU_ShaderPrecompile_C_GetPercent_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MENU_ShaderPrecompile_C_GetPercent_0, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'MENU_ShaderPrecompile_C_GetPercent_0::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MENU_ShaderPrecompile_C_GetPercent_0, CallFunc_GetShaderPrecompileProgress_ReturnValue) == 0x000010, "Member 'MENU_ShaderPrecompile_C_GetPercent_0::CallFunc_GetShaderPrecompileProgress_ReturnValue' has a wrong offset!");

}

