#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MENU_Loading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DeceiveInc_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MENU_Loading.MENU_Loading_C
// 0x0058 (0x02B8 - 0x0260)
class UMENU_Loading_C final : public UDILoadingScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BGImage;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Briefing;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           LevelNamePanel;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LoadingEvents;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              LvlNameScalebox;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_1;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_69;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Tip;                                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             DefaultImage;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MENU_Loading(int32 EntryPoint);
	void OnLoadingScreenInfoEvent_Event_0(const class FString& LoadingInfo);
	void BP_SetMapTexture2(const class UTexture2D* MapTexture);
	void OnInitialized();
	void BP_SetMapFlavor(const class FText& FlavorText);
	void BP_SetMapSubtext(const class FText& Subtext);
	void BP_SetMapName(const class FText& Name_0);
	void BP_RemoveMapTexture();
	void BP_SetMapTexture(const TSoftObjectPtr<class UTexture2D>& MapTexture);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MENU_Loading_C">();
	}
	static class UMENU_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMENU_Loading_C>();
	}
};
static_assert(alignof(UMENU_Loading_C) == 0x000008, "Wrong alignment on UMENU_Loading_C");
static_assert(sizeof(UMENU_Loading_C) == 0x0002B8, "Wrong size on UMENU_Loading_C");
static_assert(offsetof(UMENU_Loading_C, UberGraphFrame) == 0x000260, "Member 'UMENU_Loading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, BGImage) == 0x000268, "Member 'UMENU_Loading_C::BGImage' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, Briefing) == 0x000270, "Member 'UMENU_Loading_C::Briefing' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, LevelNamePanel) == 0x000278, "Member 'UMENU_Loading_C::LevelNamePanel' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, LoadingEvents) == 0x000280, "Member 'UMENU_Loading_C::LoadingEvents' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, LvlNameScalebox) == 0x000288, "Member 'UMENU_Loading_C::LvlNameScalebox' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, Name_0) == 0x000290, "Member 'UMENU_Loading_C::Name_0' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, Name_1) == 0x000298, "Member 'UMENU_Loading_C::Name_1' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, Throbber_69) == 0x0002A0, "Member 'UMENU_Loading_C::Throbber_69' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, Tip) == 0x0002A8, "Member 'UMENU_Loading_C::Tip' has a wrong offset!");
static_assert(offsetof(UMENU_Loading_C, DefaultImage) == 0x0002B0, "Member 'UMENU_Loading_C::DefaultImage' has a wrong offset!");

}

