#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Ace_PassivesBalancing

#include "Basic.hpp"

#include "DeceiveInc_structs.hpp"


namespace SDK
{

// ScriptStruct Struct_Ace_PassivesBalancing.Struct_Ace_PassivesBalancing
// 0x0028 (0x0028 - 0x0000)
struct FStruct_Ace_PassivesBalancing final
{
public:
	float                                         PassiveChargeDuration_5_AB8949C84B7428279524E095CFFD1C45; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassiveEffectDuration_11_DAF4D1B340D4B085BECBFFBA82A449CB; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifiedChargedDamageData             BaseDamageMultiplier_2_A72757EC499BE1841B8B5F94D2C6B23E; // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Mod1SlowPercent_10_E1B83EBE4D3D115504CB24A1FC46A37F; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStruct_Ace_PassivesBalancing) == 0x000008, "Wrong alignment on FStruct_Ace_PassivesBalancing");
static_assert(sizeof(FStruct_Ace_PassivesBalancing) == 0x000028, "Wrong size on FStruct_Ace_PassivesBalancing");
static_assert(offsetof(FStruct_Ace_PassivesBalancing, PassiveChargeDuration_5_AB8949C84B7428279524E095CFFD1C45) == 0x000000, "Member 'FStruct_Ace_PassivesBalancing::PassiveChargeDuration_5_AB8949C84B7428279524E095CFFD1C45' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_PassivesBalancing, PassiveEffectDuration_11_DAF4D1B340D4B085BECBFFBA82A449CB) == 0x000004, "Member 'FStruct_Ace_PassivesBalancing::PassiveEffectDuration_11_DAF4D1B340D4B085BECBFFBA82A449CB' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_PassivesBalancing, BaseDamageMultiplier_2_A72757EC499BE1841B8B5F94D2C6B23E) == 0x000008, "Member 'FStruct_Ace_PassivesBalancing::BaseDamageMultiplier_2_A72757EC499BE1841B8B5F94D2C6B23E' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_PassivesBalancing, Mod1SlowPercent_10_E1B83EBE4D3D115504CB24A1FC46A37F) == 0x000020, "Member 'FStruct_Ace_PassivesBalancing::Mod1SlowPercent_10_E1B83EBE4D3D115504CB24A1FC46A37F' has a wrong offset!");

}

