#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Hans_PassivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Hans_PassivesBalancing.Struct_Hans_PassivesBalancing
// 0x0014 (0x0014 - 0x0000)
struct FStruct_Hans_PassivesBalancing final
{
public:
	float                                         DetectionHeightOffsetOver_2_667F5ACC4389B445130327A7AE6B2A16; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionHeightOffsetUnder_4_A65ADF284E855B99F3F93797E35FC7EA; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionRadius_6_373B319E4689F77602A0B3A7A7F66A06; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2PercentRefunded_8_2C8243714211E241201F9B85EE4FCF45; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlowDuration_13_6526383D4431C68FEC5450BE416B4DED;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Hans_PassivesBalancing) == 0x000004, "Wrong alignment on FStruct_Hans_PassivesBalancing");
static_assert(sizeof(FStruct_Hans_PassivesBalancing) == 0x000014, "Wrong size on FStruct_Hans_PassivesBalancing");
static_assert(offsetof(FStruct_Hans_PassivesBalancing, DetectionHeightOffsetOver_2_667F5ACC4389B445130327A7AE6B2A16) == 0x000000, "Member 'FStruct_Hans_PassivesBalancing::DetectionHeightOffsetOver_2_667F5ACC4389B445130327A7AE6B2A16' has a wrong offset!");
static_assert(offsetof(FStruct_Hans_PassivesBalancing, DetectionHeightOffsetUnder_4_A65ADF284E855B99F3F93797E35FC7EA) == 0x000004, "Member 'FStruct_Hans_PassivesBalancing::DetectionHeightOffsetUnder_4_A65ADF284E855B99F3F93797E35FC7EA' has a wrong offset!");
static_assert(offsetof(FStruct_Hans_PassivesBalancing, DetectionRadius_6_373B319E4689F77602A0B3A7A7F66A06) == 0x000008, "Member 'FStruct_Hans_PassivesBalancing::DetectionRadius_6_373B319E4689F77602A0B3A7A7F66A06' has a wrong offset!");
static_assert(offsetof(FStruct_Hans_PassivesBalancing, Mod2PercentRefunded_8_2C8243714211E241201F9B85EE4FCF45) == 0x00000C, "Member 'FStruct_Hans_PassivesBalancing::Mod2PercentRefunded_8_2C8243714211E241201F9B85EE4FCF45' has a wrong offset!");
static_assert(offsetof(FStruct_Hans_PassivesBalancing, SlowDuration_13_6526383D4431C68FEC5450BE416B4DED) == 0x000010, "Member 'FStruct_Hans_PassivesBalancing::SlowDuration_13_6526383D4431C68FEC5450BE416B4DED' has a wrong offset!");

}

