#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Cavaliere_ActivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Cavaliere_ActivesBalancing.Struct_Cavaliere_ActivesBalancing
// 0x0040 (0x0040 - 0x0000)
struct FStruct_Cavaliere_ActivesBalancing final
{
public:
	float                                         Duration_2_6554AC88495DC76F0A4C5C85214CCB2C;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_4_201CC697415FB24126ED2AA9E35A05AA;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelRefund_7_E27E136E421DBD7E80818EB2AE06F36A;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToAddOnCluePickup_10_42DCB5254E2BE78D1061B58A31ACBC46; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractionDuration_16_B675F1F54D95B06229CEF5BA49779807; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChaseTimeLevel1_27_66BD831D43C8394126B293AA428EB9EC; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChaseTimeLevel2_32_3FF6929941F808195E3810B45AD03475; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChaseTimeLevel3_33_629FAB584A005135F89DC79AD2745242; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2ZoneSize_20_F805D6AD4B48CB0B38861480F4D0DE3D;  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2ZoneVisualSize_22_43F1CBFB4C58237276D9329DE73CE19D; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractDistance_38_9B4D1CEA4910E502EE293EBC19259BC2; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionDistance_39_BA45A3764CA16792DE52EE85C1E2B095; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 HotnessMaxTime_43_1EA11EA14DE08087CEF6AC86E0222297; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Cavaliere_ActivesBalancing) == 0x000008, "Wrong alignment on FStruct_Cavaliere_ActivesBalancing");
static_assert(sizeof(FStruct_Cavaliere_ActivesBalancing) == 0x000040, "Wrong size on FStruct_Cavaliere_ActivesBalancing");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, Duration_2_6554AC88495DC76F0A4C5C85214CCB2C) == 0x000000, "Member 'FStruct_Cavaliere_ActivesBalancing::Duration_2_6554AC88495DC76F0A4C5C85214CCB2C' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, CancelDelay_4_201CC697415FB24126ED2AA9E35A05AA) == 0x000004, "Member 'FStruct_Cavaliere_ActivesBalancing::CancelDelay_4_201CC697415FB24126ED2AA9E35A05AA' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, CancelRefund_7_E27E136E421DBD7E80818EB2AE06F36A) == 0x000008, "Member 'FStruct_Cavaliere_ActivesBalancing::CancelRefund_7_E27E136E421DBD7E80818EB2AE06F36A' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, TimeToAddOnCluePickup_10_42DCB5254E2BE78D1061B58A31ACBC46) == 0x00000C, "Member 'FStruct_Cavaliere_ActivesBalancing::TimeToAddOnCluePickup_10_42DCB5254E2BE78D1061B58A31ACBC46' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, InteractionDuration_16_B675F1F54D95B06229CEF5BA49779807) == 0x000010, "Member 'FStruct_Cavaliere_ActivesBalancing::InteractionDuration_16_B675F1F54D95B06229CEF5BA49779807' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, ChaseTimeLevel1_27_66BD831D43C8394126B293AA428EB9EC) == 0x000014, "Member 'FStruct_Cavaliere_ActivesBalancing::ChaseTimeLevel1_27_66BD831D43C8394126B293AA428EB9EC' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, ChaseTimeLevel2_32_3FF6929941F808195E3810B45AD03475) == 0x000018, "Member 'FStruct_Cavaliere_ActivesBalancing::ChaseTimeLevel2_32_3FF6929941F808195E3810B45AD03475' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, ChaseTimeLevel3_33_629FAB584A005135F89DC79AD2745242) == 0x00001C, "Member 'FStruct_Cavaliere_ActivesBalancing::ChaseTimeLevel3_33_629FAB584A005135F89DC79AD2745242' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, Mod2ZoneSize_20_F805D6AD4B48CB0B38861480F4D0DE3D) == 0x000020, "Member 'FStruct_Cavaliere_ActivesBalancing::Mod2ZoneSize_20_F805D6AD4B48CB0B38861480F4D0DE3D' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, Mod2ZoneVisualSize_22_43F1CBFB4C58237276D9329DE73CE19D) == 0x000024, "Member 'FStruct_Cavaliere_ActivesBalancing::Mod2ZoneVisualSize_22_43F1CBFB4C58237276D9329DE73CE19D' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, InteractDistance_38_9B4D1CEA4910E502EE293EBC19259BC2) == 0x000028, "Member 'FStruct_Cavaliere_ActivesBalancing::InteractDistance_38_9B4D1CEA4910E502EE293EBC19259BC2' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, DetectionDistance_39_BA45A3764CA16792DE52EE85C1E2B095) == 0x00002C, "Member 'FStruct_Cavaliere_ActivesBalancing::DetectionDistance_39_BA45A3764CA16792DE52EE85C1E2B095' has a wrong offset!");
static_assert(offsetof(FStruct_Cavaliere_ActivesBalancing, HotnessMaxTime_43_1EA11EA14DE08087CEF6AC86E0222297) == 0x000030, "Member 'FStruct_Cavaliere_ActivesBalancing::HotnessMaxTime_43_1EA11EA14DE08087CEF6AC86E0222297' has a wrong offset!");

}

