#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Chavez_PassivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Chavez_PassivesBalancing.Struct_Chavez_PassivesBalancing
// 0x0028 (0x0028 - 0x0000)
struct FStruct_Chavez_PassivesBalancing final
{
public:
	float                                         Duration_3_0D8F79C44926F2EAA5120B819EC7DF1B;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageHealingRatio_10_6BD2E5954776EB6B2E34EBAA3AF096E0; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageHealingCapRatio_11_638E20F440D419DA4A10AE9B3C4826D7; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseHealingDelay_9_2A8A8B714A2EDA02D2EB7FBAFE9626A5; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseHealingRatio_13_4DF4BA6D42D196B1C5D7C19E8A857464; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1MaxOverhealAmount_15_022908574A7DC5DBAE3D0A8A67818FB7; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1HealDecayDelay_17_9526C83E4F013F0A81160CB9178D5E6A; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DamageDecayDelay_19_20B1AD7F4203B5B1AEC2CF8BA255485C; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DecayRatio_21_7DA039F246B0137E74A64993340A1395; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2HealingRatioPerDamageDone_23_1E5E9E3740435A36AEB0C19BB397AB61; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Chavez_PassivesBalancing) == 0x000004, "Wrong alignment on FStruct_Chavez_PassivesBalancing");
static_assert(sizeof(FStruct_Chavez_PassivesBalancing) == 0x000028, "Wrong size on FStruct_Chavez_PassivesBalancing");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, Duration_3_0D8F79C44926F2EAA5120B819EC7DF1B) == 0x000000, "Member 'FStruct_Chavez_PassivesBalancing::Duration_3_0D8F79C44926F2EAA5120B819EC7DF1B' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, DamageHealingRatio_10_6BD2E5954776EB6B2E34EBAA3AF096E0) == 0x000004, "Member 'FStruct_Chavez_PassivesBalancing::DamageHealingRatio_10_6BD2E5954776EB6B2E34EBAA3AF096E0' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, DamageHealingCapRatio_11_638E20F440D419DA4A10AE9B3C4826D7) == 0x000008, "Member 'FStruct_Chavez_PassivesBalancing::DamageHealingCapRatio_11_638E20F440D419DA4A10AE9B3C4826D7' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, BaseHealingDelay_9_2A8A8B714A2EDA02D2EB7FBAFE9626A5) == 0x00000C, "Member 'FStruct_Chavez_PassivesBalancing::BaseHealingDelay_9_2A8A8B714A2EDA02D2EB7FBAFE9626A5' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, BaseHealingRatio_13_4DF4BA6D42D196B1C5D7C19E8A857464) == 0x000010, "Member 'FStruct_Chavez_PassivesBalancing::BaseHealingRatio_13_4DF4BA6D42D196B1C5D7C19E8A857464' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, Mod1MaxOverhealAmount_15_022908574A7DC5DBAE3D0A8A67818FB7) == 0x000014, "Member 'FStruct_Chavez_PassivesBalancing::Mod1MaxOverhealAmount_15_022908574A7DC5DBAE3D0A8A67818FB7' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, Mod1HealDecayDelay_17_9526C83E4F013F0A81160CB9178D5E6A) == 0x000018, "Member 'FStruct_Chavez_PassivesBalancing::Mod1HealDecayDelay_17_9526C83E4F013F0A81160CB9178D5E6A' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, Mod1DamageDecayDelay_19_20B1AD7F4203B5B1AEC2CF8BA255485C) == 0x00001C, "Member 'FStruct_Chavez_PassivesBalancing::Mod1DamageDecayDelay_19_20B1AD7F4203B5B1AEC2CF8BA255485C' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, Mod1DecayRatio_21_7DA039F246B0137E74A64993340A1395) == 0x000020, "Member 'FStruct_Chavez_PassivesBalancing::Mod1DecayRatio_21_7DA039F246B0137E74A64993340A1395' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_PassivesBalancing, Mod2HealingRatioPerDamageDone_23_1E5E9E3740435A36AEB0C19BB397AB61) == 0x000024, "Member 'FStruct_Chavez_PassivesBalancing::Mod2HealingRatioPerDamageDone_23_1E5E9E3740435A36AEB0C19BB397AB61' has a wrong offset!");

}

