#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Vigil_PassivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Vigil_PassivesBalancing.Struct_Vigil_PassivesBalancing
// 0x0018 (0x0018 - 0x0000)
struct FStruct_Vigil_PassivesBalancing final
{
public:
	float                                         PassiveCooldown_2_95AFDD364D17AC3E67C04584E00230E9; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanStickToCharacters_5_153D94B64590E981C5824BB89C386B8C; // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AoEDuration_8_66D256BA406C5CE394F38394985AC5A0;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AoEInterval_10_BC8EA5A7468E03D322C5A3AE1DE89787;   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AoERadius_14_1664202948F17482A5FBEE8FF6D26F14;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AoEDamage_16_634AB68D4135C6E2559CFD8C896E84FC;     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Vigil_PassivesBalancing) == 0x000004, "Wrong alignment on FStruct_Vigil_PassivesBalancing");
static_assert(sizeof(FStruct_Vigil_PassivesBalancing) == 0x000018, "Wrong size on FStruct_Vigil_PassivesBalancing");
static_assert(offsetof(FStruct_Vigil_PassivesBalancing, PassiveCooldown_2_95AFDD364D17AC3E67C04584E00230E9) == 0x000000, "Member 'FStruct_Vigil_PassivesBalancing::PassiveCooldown_2_95AFDD364D17AC3E67C04584E00230E9' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_PassivesBalancing, CanStickToCharacters_5_153D94B64590E981C5824BB89C386B8C) == 0x000004, "Member 'FStruct_Vigil_PassivesBalancing::CanStickToCharacters_5_153D94B64590E981C5824BB89C386B8C' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_PassivesBalancing, AoEDuration_8_66D256BA406C5CE394F38394985AC5A0) == 0x000008, "Member 'FStruct_Vigil_PassivesBalancing::AoEDuration_8_66D256BA406C5CE394F38394985AC5A0' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_PassivesBalancing, AoEInterval_10_BC8EA5A7468E03D322C5A3AE1DE89787) == 0x00000C, "Member 'FStruct_Vigil_PassivesBalancing::AoEInterval_10_BC8EA5A7468E03D322C5A3AE1DE89787' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_PassivesBalancing, AoERadius_14_1664202948F17482A5FBEE8FF6D26F14) == 0x000010, "Member 'FStruct_Vigil_PassivesBalancing::AoERadius_14_1664202948F17482A5FBEE8FF6D26F14' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_PassivesBalancing, AoEDamage_16_634AB68D4135C6E2559CFD8C896E84FC) == 0x000014, "Member 'FStruct_Vigil_PassivesBalancing::AoEDamage_16_634AB68D4135C6E2559CFD8C896E84FC' has a wrong offset!");

}

