#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SpyShared_SpawnerWeaponBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_SpyShared_SpawnerWeaponBalancing.Struct_SpyShared_SpawnerWeaponBalancing
// 0x0058 (0x0058 - 0x0000)
struct FStruct_SpyShared_SpawnerWeaponBalancing final
{
public:
	class UAkAudioEvent*                          PrimaryWeapon_ShootSound_1p_97_2211331D44A4B5B7F27DFC9714FF7BC1; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          PrimaryWeapon_ShootSound_3P_98_077F9FFF4832F521FC7DF085DB494905; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          SecondaryWeapon_ShootSound_1P_99_4F005E764DCEB700605DA88F833A9BD5; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          SecondaryWeapon_ShootSound_3P_100_5D6EDFEF40356DDCA87E4B95837C94DA; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          PrimaryWeapon_Charging_104_BF4044E049E1A58DEDCAEF91BD3F090C; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          PrimaryWeapon_FullyCharged_107_1DC9F6604FC89963B4A62D9DFB773079; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          SecondaryWeapon_Charging_110_E00B61A64FBC707DBD674D998E4E8A19; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          SecondaryWeapon_FullyCharged_109_A2EA9A2A4F63C973D5764FB405A46B59; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          ADS_In_85_6340749445E365A3C43DC68F1CD4EF72;        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          ADS_Out_87_E7D83975478A1EED210576B56E8D9899;       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          Impact_89_0D89BCD142E1CA1D73409DB48AF5E931;        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_SpyShared_SpawnerWeaponBalancing) == 0x000008, "Wrong alignment on FStruct_SpyShared_SpawnerWeaponBalancing");
static_assert(sizeof(FStruct_SpyShared_SpawnerWeaponBalancing) == 0x000058, "Wrong size on FStruct_SpyShared_SpawnerWeaponBalancing");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, PrimaryWeapon_ShootSound_1p_97_2211331D44A4B5B7F27DFC9714FF7BC1) == 0x000000, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::PrimaryWeapon_ShootSound_1p_97_2211331D44A4B5B7F27DFC9714FF7BC1' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, PrimaryWeapon_ShootSound_3P_98_077F9FFF4832F521FC7DF085DB494905) == 0x000008, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::PrimaryWeapon_ShootSound_3P_98_077F9FFF4832F521FC7DF085DB494905' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, SecondaryWeapon_ShootSound_1P_99_4F005E764DCEB700605DA88F833A9BD5) == 0x000010, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::SecondaryWeapon_ShootSound_1P_99_4F005E764DCEB700605DA88F833A9BD5' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, SecondaryWeapon_ShootSound_3P_100_5D6EDFEF40356DDCA87E4B95837C94DA) == 0x000018, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::SecondaryWeapon_ShootSound_3P_100_5D6EDFEF40356DDCA87E4B95837C94DA' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, PrimaryWeapon_Charging_104_BF4044E049E1A58DEDCAEF91BD3F090C) == 0x000020, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::PrimaryWeapon_Charging_104_BF4044E049E1A58DEDCAEF91BD3F090C' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, PrimaryWeapon_FullyCharged_107_1DC9F6604FC89963B4A62D9DFB773079) == 0x000028, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::PrimaryWeapon_FullyCharged_107_1DC9F6604FC89963B4A62D9DFB773079' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, SecondaryWeapon_Charging_110_E00B61A64FBC707DBD674D998E4E8A19) == 0x000030, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::SecondaryWeapon_Charging_110_E00B61A64FBC707DBD674D998E4E8A19' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, SecondaryWeapon_FullyCharged_109_A2EA9A2A4F63C973D5764FB405A46B59) == 0x000038, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::SecondaryWeapon_FullyCharged_109_A2EA9A2A4F63C973D5764FB405A46B59' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, ADS_In_85_6340749445E365A3C43DC68F1CD4EF72) == 0x000040, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::ADS_In_85_6340749445E365A3C43DC68F1CD4EF72' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, ADS_Out_87_E7D83975478A1EED210576B56E8D9899) == 0x000048, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::ADS_Out_87_E7D83975478A1EED210576B56E8D9899' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_SpawnerWeaponBalancing, Impact_89_0D89BCD142E1CA1D73409DB48AF5E931) == 0x000050, "Member 'FStruct_SpyShared_SpawnerWeaponBalancing::Impact_89_0D89BCD142E1CA1D73409DB48AF5E931' has a wrong offset!");

}

