#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Ace_ActivesBalancing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Struct_Ace_ActivesBalancing.Struct_Ace_ActivesBalancing
// 0x0038 (0x0038 - 0x0000)
struct FStruct_Ace_ActivesBalancing final
{
public:
	float                                         Duration_2_BF04CDEE4D22C109EE02499D7842602C;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_19_C3C78FD94EEE49A72751D4B09007ADF0;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelRefund_20_9D70C25A4573122D8AA9639B74683AFE;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastTargetDuration_18_250EAE0147E6A2832D89C997561AA4C7; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1ZoneMovementSpeedFactor_27_5CD7193F4E3B8ADFB62F359B99BC8CCB; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1RandomizeTargetOffsetDelay_30_355AB0C54E8F8B298D70248F707CAA3A; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1MinHeatActivation_32_CDA83CEC4FCE20CBB019CCAE7705ACA9; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1TraceHeatAmount_34_72F6C9584785D6CE2A040B97DCCEDC33; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1ScaleFactorMaxHeat_36_9E70EDC449CCCFF8F4C12198BB068D26; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1HeatDetectionRange_38_2A1E7FE0416CDF1B27956E91537DF1F5; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1HeatDetectionHeight_40_8C06F9B54A667DED0B3ECDB64B8B5DDD; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Mod2ZoneScale_26_E24E124E4E2E662A137612A1E640E732; // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Ace_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Ace_ActivesBalancing");
static_assert(sizeof(FStruct_Ace_ActivesBalancing) == 0x000038, "Wrong size on FStruct_Ace_ActivesBalancing");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Duration_2_BF04CDEE4D22C109EE02499D7842602C) == 0x000000, "Member 'FStruct_Ace_ActivesBalancing::Duration_2_BF04CDEE4D22C109EE02499D7842602C' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, CancelDelay_19_C3C78FD94EEE49A72751D4B09007ADF0) == 0x000004, "Member 'FStruct_Ace_ActivesBalancing::CancelDelay_19_C3C78FD94EEE49A72751D4B09007ADF0' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, CancelRefund_20_9D70C25A4573122D8AA9639B74683AFE) == 0x000008, "Member 'FStruct_Ace_ActivesBalancing::CancelRefund_20_9D70C25A4573122D8AA9639B74683AFE' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, LastTargetDuration_18_250EAE0147E6A2832D89C997561AA4C7) == 0x00000C, "Member 'FStruct_Ace_ActivesBalancing::LastTargetDuration_18_250EAE0147E6A2832D89C997561AA4C7' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1ZoneMovementSpeedFactor_27_5CD7193F4E3B8ADFB62F359B99BC8CCB) == 0x000010, "Member 'FStruct_Ace_ActivesBalancing::Mod1ZoneMovementSpeedFactor_27_5CD7193F4E3B8ADFB62F359B99BC8CCB' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1RandomizeTargetOffsetDelay_30_355AB0C54E8F8B298D70248F707CAA3A) == 0x000014, "Member 'FStruct_Ace_ActivesBalancing::Mod1RandomizeTargetOffsetDelay_30_355AB0C54E8F8B298D70248F707CAA3A' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1MinHeatActivation_32_CDA83CEC4FCE20CBB019CCAE7705ACA9) == 0x000018, "Member 'FStruct_Ace_ActivesBalancing::Mod1MinHeatActivation_32_CDA83CEC4FCE20CBB019CCAE7705ACA9' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1TraceHeatAmount_34_72F6C9584785D6CE2A040B97DCCEDC33) == 0x00001C, "Member 'FStruct_Ace_ActivesBalancing::Mod1TraceHeatAmount_34_72F6C9584785D6CE2A040B97DCCEDC33' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1ScaleFactorMaxHeat_36_9E70EDC449CCCFF8F4C12198BB068D26) == 0x000020, "Member 'FStruct_Ace_ActivesBalancing::Mod1ScaleFactorMaxHeat_36_9E70EDC449CCCFF8F4C12198BB068D26' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1HeatDetectionRange_38_2A1E7FE0416CDF1B27956E91537DF1F5) == 0x000024, "Member 'FStruct_Ace_ActivesBalancing::Mod1HeatDetectionRange_38_2A1E7FE0416CDF1B27956E91537DF1F5' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod1HeatDetectionHeight_40_8C06F9B54A667DED0B3ECDB64B8B5DDD) == 0x000028, "Member 'FStruct_Ace_ActivesBalancing::Mod1HeatDetectionHeight_40_8C06F9B54A667DED0B3ECDB64B8B5DDD' has a wrong offset!");
static_assert(offsetof(FStruct_Ace_ActivesBalancing, Mod2ZoneScale_26_E24E124E4E2E662A137612A1E640E732) == 0x00002C, "Member 'FStruct_Ace_ActivesBalancing::Mod2ZoneScale_26_E24E124E4E2E662A137612A1E640E732' has a wrong offset!");

}

