#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Squire_PassiveBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Squire_PassiveBalancing.Struct_Squire_PassiveBalancing
// 0x0010 (0x0010 - 0x0000)
struct FStruct_Squire_PassiveBalancing final
{
public:
	float                                         BaseSpeedDuration_2_EDDD39964E9DE22B216256B7E3828D87; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseSpeedFactor_4_202C00724B4A864E3F565282DEE5BAF0; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1PingIntervals_8_E5E74EEF46014A031923C683313C7D45; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2DamageReductionDuration_11_26A6DA154C1E9492F2BB2BBD60A313B7; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Squire_PassiveBalancing) == 0x000004, "Wrong alignment on FStruct_Squire_PassiveBalancing");
static_assert(sizeof(FStruct_Squire_PassiveBalancing) == 0x000010, "Wrong size on FStruct_Squire_PassiveBalancing");
static_assert(offsetof(FStruct_Squire_PassiveBalancing, BaseSpeedDuration_2_EDDD39964E9DE22B216256B7E3828D87) == 0x000000, "Member 'FStruct_Squire_PassiveBalancing::BaseSpeedDuration_2_EDDD39964E9DE22B216256B7E3828D87' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_PassiveBalancing, BaseSpeedFactor_4_202C00724B4A864E3F565282DEE5BAF0) == 0x000004, "Member 'FStruct_Squire_PassiveBalancing::BaseSpeedFactor_4_202C00724B4A864E3F565282DEE5BAF0' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_PassiveBalancing, Mod1PingIntervals_8_E5E74EEF46014A031923C683313C7D45) == 0x000008, "Member 'FStruct_Squire_PassiveBalancing::Mod1PingIntervals_8_E5E74EEF46014A031923C683313C7D45' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_PassiveBalancing, Mod2DamageReductionDuration_11_26A6DA154C1E9492F2BB2BBD60A313B7) == 0x00000C, "Member 'FStruct_Squire_PassiveBalancing::Mod2DamageReductionDuration_11_26A6DA154C1E9492F2BB2BBD60A313B7' has a wrong offset!");

}

