#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Sasori_ActivesBalancing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Struct_Sasori_ActivesBalancing.Struct_Sasori_ActivesBalancing
// 0x0030 (0x0030 - 0x0000)
struct FStruct_Sasori_ActivesBalancing final
{
public:
	float                                         Duration_8_6AE3C02A428C848B34CA059A77C096BC;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Refund_9_EB60F768412B14B6151222AB30FCB127;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_10_F8A1C72745FE92539D4E71A8E2234E27;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoneRadius_12_AAD33E154377DD9DFBE66B9E61D0D89C;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoneDuration_24_D8D1D635426C0249F63120A8C5962312;  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1ProjectileSpeed_16_4C20D431431B2831CDC473800EE3E951; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Mod2ZoneHeight_21_D753A4D749FBAF1E0BBD66937EADA418; // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2Damage_18_CCE656824001CA2318A169890296E0D4;    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PoisonDuration_20_29CB5B9D4B9CA66448F66DAECA5C6D97; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmpoweredPoisonDuration_27_4607C2324C763D02F69D87AAFC69086A; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Sasori_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Sasori_ActivesBalancing");
static_assert(sizeof(FStruct_Sasori_ActivesBalancing) == 0x000030, "Wrong size on FStruct_Sasori_ActivesBalancing");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, Duration_8_6AE3C02A428C848B34CA059A77C096BC) == 0x000000, "Member 'FStruct_Sasori_ActivesBalancing::Duration_8_6AE3C02A428C848B34CA059A77C096BC' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, Refund_9_EB60F768412B14B6151222AB30FCB127) == 0x000004, "Member 'FStruct_Sasori_ActivesBalancing::Refund_9_EB60F768412B14B6151222AB30FCB127' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, CancelDelay_10_F8A1C72745FE92539D4E71A8E2234E27) == 0x000008, "Member 'FStruct_Sasori_ActivesBalancing::CancelDelay_10_F8A1C72745FE92539D4E71A8E2234E27' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, ZoneRadius_12_AAD33E154377DD9DFBE66B9E61D0D89C) == 0x00000C, "Member 'FStruct_Sasori_ActivesBalancing::ZoneRadius_12_AAD33E154377DD9DFBE66B9E61D0D89C' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, ZoneDuration_24_D8D1D635426C0249F63120A8C5962312) == 0x000010, "Member 'FStruct_Sasori_ActivesBalancing::ZoneDuration_24_D8D1D635426C0249F63120A8C5962312' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, Mod1ProjectileSpeed_16_4C20D431431B2831CDC473800EE3E951) == 0x000014, "Member 'FStruct_Sasori_ActivesBalancing::Mod1ProjectileSpeed_16_4C20D431431B2831CDC473800EE3E951' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, Mod2ZoneHeight_21_D753A4D749FBAF1E0BBD66937EADA418) == 0x000018, "Member 'FStruct_Sasori_ActivesBalancing::Mod2ZoneHeight_21_D753A4D749FBAF1E0BBD66937EADA418' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, Mod2Damage_18_CCE656824001CA2318A169890296E0D4) == 0x000024, "Member 'FStruct_Sasori_ActivesBalancing::Mod2Damage_18_CCE656824001CA2318A169890296E0D4' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, PoisonDuration_20_29CB5B9D4B9CA66448F66DAECA5C6D97) == 0x000028, "Member 'FStruct_Sasori_ActivesBalancing::PoisonDuration_20_29CB5B9D4B9CA66448F66DAECA5C6D97' has a wrong offset!");
static_assert(offsetof(FStruct_Sasori_ActivesBalancing, EmpoweredPoisonDuration_27_4607C2324C763D02F69D87AAFC69086A) == 0x00002C, "Member 'FStruct_Sasori_ActivesBalancing::EmpoweredPoisonDuration_27_4607C2324C763D02F69D87AAFC69086A' has a wrong offset!");

}

