#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Socialite_Passive_Balancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Socialite_Passive_Balancing.Struct_Socialite_Passive_Balancing
// 0x0010 (0x0010 - 0x0000)
struct FStruct_Socialite_Passive_Balancing final
{
public:
	float                                         VictimEffectDuration_2_1E22A53C4407CCA708E3608AD59138CD; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range_4_E896CD57476956145E1735A2BEB87668;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height_6_0F8ABDA44C2CCAD66F5D01BE86BB26F9;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1RecoverDuration_8_CAF071774637753E773059B2724AC401; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Socialite_Passive_Balancing) == 0x000004, "Wrong alignment on FStruct_Socialite_Passive_Balancing");
static_assert(sizeof(FStruct_Socialite_Passive_Balancing) == 0x000010, "Wrong size on FStruct_Socialite_Passive_Balancing");
static_assert(offsetof(FStruct_Socialite_Passive_Balancing, VictimEffectDuration_2_1E22A53C4407CCA708E3608AD59138CD) == 0x000000, "Member 'FStruct_Socialite_Passive_Balancing::VictimEffectDuration_2_1E22A53C4407CCA708E3608AD59138CD' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Passive_Balancing, Range_4_E896CD57476956145E1735A2BEB87668) == 0x000004, "Member 'FStruct_Socialite_Passive_Balancing::Range_4_E896CD57476956145E1735A2BEB87668' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Passive_Balancing, Height_6_0F8ABDA44C2CCAD66F5D01BE86BB26F9) == 0x000008, "Member 'FStruct_Socialite_Passive_Balancing::Height_6_0F8ABDA44C2CCAD66F5D01BE86BB26F9' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Passive_Balancing, Mod1RecoverDuration_8_CAF071774637753E773059B2724AC401) == 0x00000C, "Member 'FStruct_Socialite_Passive_Balancing::Mod1RecoverDuration_8_CAF071774637753E773059B2724AC401' has a wrong offset!");

}

