#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Octo_ActivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Octo_ActivesBalancing.Struct_Octo_ActivesBalancing
// 0x0048 (0x0048 - 0x0000)
struct FStruct_Octo_ActivesBalancing final
{
public:
	float                                         ActiveDuration_2_ACD073854CF18565508AD1B16317D91F; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_4_5E47BFF34E0EC82857F056A8243B0CD2;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveRefund_6_5446677D490B3720A380D8965A49FC63;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionRange_8_5B2F26FD452D987E7E5224BF29A4CC69; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionAngle_10_F89F97BA4816E978E65A1FA079102618; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectDelay_13_2786DCE2489CE41A8C9CAA816D1CB7BF;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntelDrainInterval_40_947FF3C043FF954951D9EC99B0E4B426; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntelDrainAmount_45_701FF7A24827793FC62A2482F7860609; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseFeedbackDuration_15_D40A5C174F19B6A99935CDADBD6A32BB; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1OctoZoneRadius_33_585F7DF34A494FBD15F739BF2E1E6656; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1OctoZoneHeight_34_D91F25B54BF5C8448E6F5FA76D38C229; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DrainZoneRadius_36_A07299C649F67B7DFEBCE89E8D6B4F31; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DrainZoneHeight_37_9EB48A6B4FD86230570EB88BF1DDC238; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DrainZoneFXRadius_39_E4EE5CBC4622540BD260F6A4A6DE916F; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DrainHack_21_2C3FA2364F195958A27161A83A603CC1; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1OctoShare_30_3C3073F84436153F3F326E8BC4940ABE; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1TeamShare_31_AAD1DDFF496F259A82316A8C1A62CB33; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2LingeringDuration_44_CC1DC210406877276E0943A4B75ADA74; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Octo_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Octo_ActivesBalancing");
static_assert(sizeof(FStruct_Octo_ActivesBalancing) == 0x000048, "Wrong size on FStruct_Octo_ActivesBalancing");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, ActiveDuration_2_ACD073854CF18565508AD1B16317D91F) == 0x000000, "Member 'FStruct_Octo_ActivesBalancing::ActiveDuration_2_ACD073854CF18565508AD1B16317D91F' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, CancelDelay_4_5E47BFF34E0EC82857F056A8243B0CD2) == 0x000004, "Member 'FStruct_Octo_ActivesBalancing::CancelDelay_4_5E47BFF34E0EC82857F056A8243B0CD2' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, ActiveRefund_6_5446677D490B3720A380D8965A49FC63) == 0x000008, "Member 'FStruct_Octo_ActivesBalancing::ActiveRefund_6_5446677D490B3720A380D8965A49FC63' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, DetectionRange_8_5B2F26FD452D987E7E5224BF29A4CC69) == 0x00000C, "Member 'FStruct_Octo_ActivesBalancing::DetectionRange_8_5B2F26FD452D987E7E5224BF29A4CC69' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, DetectionAngle_10_F89F97BA4816E978E65A1FA079102618) == 0x000010, "Member 'FStruct_Octo_ActivesBalancing::DetectionAngle_10_F89F97BA4816E978E65A1FA079102618' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, EffectDelay_13_2786DCE2489CE41A8C9CAA816D1CB7BF) == 0x000014, "Member 'FStruct_Octo_ActivesBalancing::EffectDelay_13_2786DCE2489CE41A8C9CAA816D1CB7BF' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, IntelDrainInterval_40_947FF3C043FF954951D9EC99B0E4B426) == 0x000018, "Member 'FStruct_Octo_ActivesBalancing::IntelDrainInterval_40_947FF3C043FF954951D9EC99B0E4B426' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, IntelDrainAmount_45_701FF7A24827793FC62A2482F7860609) == 0x00001C, "Member 'FStruct_Octo_ActivesBalancing::IntelDrainAmount_45_701FF7A24827793FC62A2482F7860609' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, BaseFeedbackDuration_15_D40A5C174F19B6A99935CDADBD6A32BB) == 0x000020, "Member 'FStruct_Octo_ActivesBalancing::BaseFeedbackDuration_15_D40A5C174F19B6A99935CDADBD6A32BB' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1OctoZoneRadius_33_585F7DF34A494FBD15F739BF2E1E6656) == 0x000024, "Member 'FStruct_Octo_ActivesBalancing::Mod1OctoZoneRadius_33_585F7DF34A494FBD15F739BF2E1E6656' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1OctoZoneHeight_34_D91F25B54BF5C8448E6F5FA76D38C229) == 0x000028, "Member 'FStruct_Octo_ActivesBalancing::Mod1OctoZoneHeight_34_D91F25B54BF5C8448E6F5FA76D38C229' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1DrainZoneRadius_36_A07299C649F67B7DFEBCE89E8D6B4F31) == 0x00002C, "Member 'FStruct_Octo_ActivesBalancing::Mod1DrainZoneRadius_36_A07299C649F67B7DFEBCE89E8D6B4F31' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1DrainZoneHeight_37_9EB48A6B4FD86230570EB88BF1DDC238) == 0x000030, "Member 'FStruct_Octo_ActivesBalancing::Mod1DrainZoneHeight_37_9EB48A6B4FD86230570EB88BF1DDC238' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1DrainZoneFXRadius_39_E4EE5CBC4622540BD260F6A4A6DE916F) == 0x000034, "Member 'FStruct_Octo_ActivesBalancing::Mod1DrainZoneFXRadius_39_E4EE5CBC4622540BD260F6A4A6DE916F' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1DrainHack_21_2C3FA2364F195958A27161A83A603CC1) == 0x000038, "Member 'FStruct_Octo_ActivesBalancing::Mod1DrainHack_21_2C3FA2364F195958A27161A83A603CC1' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1OctoShare_30_3C3073F84436153F3F326E8BC4940ABE) == 0x00003C, "Member 'FStruct_Octo_ActivesBalancing::Mod1OctoShare_30_3C3073F84436153F3F326E8BC4940ABE' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod1TeamShare_31_AAD1DDFF496F259A82316A8C1A62CB33) == 0x000040, "Member 'FStruct_Octo_ActivesBalancing::Mod1TeamShare_31_AAD1DDFF496F259A82316A8C1A62CB33' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_ActivesBalancing, Mod2LingeringDuration_44_CC1DC210406877276E0943A4B75ADA74) == 0x000044, "Member 'FStruct_Octo_ActivesBalancing::Mod2LingeringDuration_44_CC1DC210406877276E0943A4B75ADA74' has a wrong offset!");

}

