#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Socialite_Active_Balancing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Struct_Socialite_Active_Balancing.Struct_Socialite_Active_Balancing
// 0x0050 (0x0050 - 0x0000)
struct FStruct_Socialite_Active_Balancing final
{
public:
	float                                         Duration_3_6BEA357A48863A20672753B182CE770B;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_5_BD19A1F14E70F556EA9080A4A53E1634;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveRefund_7_ACAA8295493482B7E4E53D958F3A278C;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeorRadius_16_820077544ECACAB80EC9B6929D4A9E9F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleorHeight_17_5DD879864B6CDABE414EEBB218CB44C5; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharmDuration_20_5CBA033E43CEABBFDC0A1F8662567A34; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeartbreakDuration_22_D348951F4B46AA277106589A0D08AE0E; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1HealAmount_24_610740F04D01BD23443A05A26884E844; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Mod2CylinderTransform_27_6A9975A84F8D64DD9FA9E28FD08E298E; // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Socialite_Active_Balancing) == 0x000010, "Wrong alignment on FStruct_Socialite_Active_Balancing");
static_assert(sizeof(FStruct_Socialite_Active_Balancing) == 0x000050, "Wrong size on FStruct_Socialite_Active_Balancing");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, Duration_3_6BEA357A48863A20672753B182CE770B) == 0x000000, "Member 'FStruct_Socialite_Active_Balancing::Duration_3_6BEA357A48863A20672753B182CE770B' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, CancelDelay_5_BD19A1F14E70F556EA9080A4A53E1634) == 0x000004, "Member 'FStruct_Socialite_Active_Balancing::CancelDelay_5_BD19A1F14E70F556EA9080A4A53E1634' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, ActiveRefund_7_ACAA8295493482B7E4E53D958F3A278C) == 0x000008, "Member 'FStruct_Socialite_Active_Balancing::ActiveRefund_7_ACAA8295493482B7E4E53D958F3A278C' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, RangeorRadius_16_820077544ECACAB80EC9B6929D4A9E9F) == 0x00000C, "Member 'FStruct_Socialite_Active_Balancing::RangeorRadius_16_820077544ECACAB80EC9B6929D4A9E9F' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, AngleorHeight_17_5DD879864B6CDABE414EEBB218CB44C5) == 0x000010, "Member 'FStruct_Socialite_Active_Balancing::AngleorHeight_17_5DD879864B6CDABE414EEBB218CB44C5' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, CharmDuration_20_5CBA033E43CEABBFDC0A1F8662567A34) == 0x000014, "Member 'FStruct_Socialite_Active_Balancing::CharmDuration_20_5CBA033E43CEABBFDC0A1F8662567A34' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, HeartbreakDuration_22_D348951F4B46AA277106589A0D08AE0E) == 0x000018, "Member 'FStruct_Socialite_Active_Balancing::HeartbreakDuration_22_D348951F4B46AA277106589A0D08AE0E' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, Mod1HealAmount_24_610740F04D01BD23443A05A26884E844) == 0x00001C, "Member 'FStruct_Socialite_Active_Balancing::Mod1HealAmount_24_610740F04D01BD23443A05A26884E844' has a wrong offset!");
static_assert(offsetof(FStruct_Socialite_Active_Balancing, Mod2CylinderTransform_27_6A9975A84F8D64DD9FA9E28FD08E298E) == 0x000020, "Member 'FStruct_Socialite_Active_Balancing::Mod2CylinderTransform_27_6A9975A84F8D64DD9FA9E28FD08E298E' has a wrong offset!");

}

