#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Yumi_ActivesBalancing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Struct_Yumi_ActivesBalancing.Struct_Yumi_ActivesBalancing
// 0x002C (0x002C - 0x0000)
struct FStruct_Yumi_ActivesBalancing final
{
public:
	float                                         ActiveDuration_27_FA3126F94E6FD5E9C9E34D98090660A5; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveCanCancelTimer_31_968759124A51C9C5B086FFB3481B4D81; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveCancelPercentToGive_33_D41CF87E46A72E7FBA49DB98A3B67627; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius_4_5B7C578A46A10377E51F1980D24BBF54;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale_7_E2694E9E44A723965B77019DC50C6D68;          // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CoverDrainSpeed_34_19A03D2D4A436374C37231AF514B0EE7; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlowSpeedPercent_35_3FC304104752F7771626138050DD59B2; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealTickPeriod_40_1A61F3934C773047106D54993C5B198E; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealAmount_41_9520F1654D7D419DBCE2B4B1C6E7FDF8;    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Yumi_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Yumi_ActivesBalancing");
static_assert(sizeof(FStruct_Yumi_ActivesBalancing) == 0x00002C, "Wrong size on FStruct_Yumi_ActivesBalancing");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, ActiveDuration_27_FA3126F94E6FD5E9C9E34D98090660A5) == 0x000000, "Member 'FStruct_Yumi_ActivesBalancing::ActiveDuration_27_FA3126F94E6FD5E9C9E34D98090660A5' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, ActiveCanCancelTimer_31_968759124A51C9C5B086FFB3481B4D81) == 0x000004, "Member 'FStruct_Yumi_ActivesBalancing::ActiveCanCancelTimer_31_968759124A51C9C5B086FFB3481B4D81' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, ActiveCancelPercentToGive_33_D41CF87E46A72E7FBA49DB98A3B67627) == 0x000008, "Member 'FStruct_Yumi_ActivesBalancing::ActiveCancelPercentToGive_33_D41CF87E46A72E7FBA49DB98A3B67627' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, Radius_4_5B7C578A46A10377E51F1980D24BBF54) == 0x00000C, "Member 'FStruct_Yumi_ActivesBalancing::Radius_4_5B7C578A46A10377E51F1980D24BBF54' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, Scale_7_E2694E9E44A723965B77019DC50C6D68) == 0x000010, "Member 'FStruct_Yumi_ActivesBalancing::Scale_7_E2694E9E44A723965B77019DC50C6D68' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, CoverDrainSpeed_34_19A03D2D4A436374C37231AF514B0EE7) == 0x00001C, "Member 'FStruct_Yumi_ActivesBalancing::CoverDrainSpeed_34_19A03D2D4A436374C37231AF514B0EE7' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, SlowSpeedPercent_35_3FC304104752F7771626138050DD59B2) == 0x000020, "Member 'FStruct_Yumi_ActivesBalancing::SlowSpeedPercent_35_3FC304104752F7771626138050DD59B2' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, HealTickPeriod_40_1A61F3934C773047106D54993C5B198E) == 0x000024, "Member 'FStruct_Yumi_ActivesBalancing::HealTickPeriod_40_1A61F3934C773047106D54993C5B198E' has a wrong offset!");
static_assert(offsetof(FStruct_Yumi_ActivesBalancing, HealAmount_41_9520F1654D7D419DBCE2B4B1C6E7FDF8) == 0x000028, "Member 'FStruct_Yumi_ActivesBalancing::HealAmount_41_9520F1654D7D419DBCE2B4B1C6E7FDF8' has a wrong offset!");

}

