#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Chavez_ActivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Chavez_ActivesBalancing.Struct_Chavez_ActivesBalancing
// 0x002C (0x002C - 0x0000)
struct FStruct_Chavez_ActivesBalancing final
{
public:
	float                                         Duration_2_90489F264DD9FA63258864AB06821315;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelRefund_17_4D389EEC415837E0EF055A960ED303AA;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_15_AB0EBE7647DDE1FCAD8DE0BA8B150BB1;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1DamageRatio_4_D5A8739543140CC3255D21A580665FB5; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1MaxDamageBuffPercent_6_5CEA8FFF473C03FEE339EC8B55CA0625; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2ImpulseStrengthNPCs_20_279C55854D6EF43C73D5D0AD839D0446; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2ImpulseStrengthSpy_22_6CFC1F944CB516FF79AACE81E8E01C12; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2BumpDamage_24_872079FA47F427DA608E79BB392A6668; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2BumpVerticalOffset_26_6EA901D64DB9E15EED55179B4B329A3A; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2BumpDelayHitSpy_28_AA77D2E2437817D18C9EB489632B46FF; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Mod2AlwaysBlowCover_32_9281D2A849C9F157A19071A7E0710A72; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Mod2OpenLockedDoors_34_49F95F604FF321E49C0D699DC907A14A; // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Mod2DestroyGadgets_36_38E5246E41E6545AAD94C1B3B7028A96; // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStruct_Chavez_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Chavez_ActivesBalancing");
static_assert(sizeof(FStruct_Chavez_ActivesBalancing) == 0x00002C, "Wrong size on FStruct_Chavez_ActivesBalancing");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Duration_2_90489F264DD9FA63258864AB06821315) == 0x000000, "Member 'FStruct_Chavez_ActivesBalancing::Duration_2_90489F264DD9FA63258864AB06821315' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, CancelRefund_17_4D389EEC415837E0EF055A960ED303AA) == 0x000004, "Member 'FStruct_Chavez_ActivesBalancing::CancelRefund_17_4D389EEC415837E0EF055A960ED303AA' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, CancelDelay_15_AB0EBE7647DDE1FCAD8DE0BA8B150BB1) == 0x000008, "Member 'FStruct_Chavez_ActivesBalancing::CancelDelay_15_AB0EBE7647DDE1FCAD8DE0BA8B150BB1' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod1DamageRatio_4_D5A8739543140CC3255D21A580665FB5) == 0x00000C, "Member 'FStruct_Chavez_ActivesBalancing::Mod1DamageRatio_4_D5A8739543140CC3255D21A580665FB5' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod1MaxDamageBuffPercent_6_5CEA8FFF473C03FEE339EC8B55CA0625) == 0x000010, "Member 'FStruct_Chavez_ActivesBalancing::Mod1MaxDamageBuffPercent_6_5CEA8FFF473C03FEE339EC8B55CA0625' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2ImpulseStrengthNPCs_20_279C55854D6EF43C73D5D0AD839D0446) == 0x000014, "Member 'FStruct_Chavez_ActivesBalancing::Mod2ImpulseStrengthNPCs_20_279C55854D6EF43C73D5D0AD839D0446' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2ImpulseStrengthSpy_22_6CFC1F944CB516FF79AACE81E8E01C12) == 0x000018, "Member 'FStruct_Chavez_ActivesBalancing::Mod2ImpulseStrengthSpy_22_6CFC1F944CB516FF79AACE81E8E01C12' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2BumpDamage_24_872079FA47F427DA608E79BB392A6668) == 0x00001C, "Member 'FStruct_Chavez_ActivesBalancing::Mod2BumpDamage_24_872079FA47F427DA608E79BB392A6668' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2BumpVerticalOffset_26_6EA901D64DB9E15EED55179B4B329A3A) == 0x000020, "Member 'FStruct_Chavez_ActivesBalancing::Mod2BumpVerticalOffset_26_6EA901D64DB9E15EED55179B4B329A3A' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2BumpDelayHitSpy_28_AA77D2E2437817D18C9EB489632B46FF) == 0x000024, "Member 'FStruct_Chavez_ActivesBalancing::Mod2BumpDelayHitSpy_28_AA77D2E2437817D18C9EB489632B46FF' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2AlwaysBlowCover_32_9281D2A849C9F157A19071A7E0710A72) == 0x000028, "Member 'FStruct_Chavez_ActivesBalancing::Mod2AlwaysBlowCover_32_9281D2A849C9F157A19071A7E0710A72' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2OpenLockedDoors_34_49F95F604FF321E49C0D699DC907A14A) == 0x000029, "Member 'FStruct_Chavez_ActivesBalancing::Mod2OpenLockedDoors_34_49F95F604FF321E49C0D699DC907A14A' has a wrong offset!");
static_assert(offsetof(FStruct_Chavez_ActivesBalancing, Mod2DestroyGadgets_36_38E5246E41E6545AAD94C1B3B7028A96) == 0x00002A, "Member 'FStruct_Chavez_ActivesBalancing::Mod2DestroyGadgets_36_38E5246E41E6545AAD94C1B3B7028A96' has a wrong offset!");

}

