#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SpyShared_ProjectileBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_SpyShared_ProjectileBalancing.Struct_SpyShared_ProjectileBalancing
// 0x0020 (0x0020 - 0x0000)
struct FStruct_SpyShared_ProjectileBalancing final
{
public:
	float                                         BaseDamage_74_36CF81FC4F917B2A07DA46A43692C138;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChargedDamageMultiplier_77_28D235B84A876A15BA1AF6A24B10A7E2; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CritDamageMultiplier_54_C7265949498B0805DCAFEB9BD0D6E0CE; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LimbDamageMultiplier_56_5FC6648C4B3A734297A1CD8047DD415D; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectileLifetime_61_BC4B0E934BD520ED74D393AB574F5D8B; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FullyChargedSpeed_65_8D0F301C4BD2B0C9292120A6F0A463A8; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialSpeed_69_5F4423A44F453B42152999A01AF24881;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScale_80_2E707B544A1458B361449E8FFF74485C;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_SpyShared_ProjectileBalancing) == 0x000004, "Wrong alignment on FStruct_SpyShared_ProjectileBalancing");
static_assert(sizeof(FStruct_SpyShared_ProjectileBalancing) == 0x000020, "Wrong size on FStruct_SpyShared_ProjectileBalancing");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, BaseDamage_74_36CF81FC4F917B2A07DA46A43692C138) == 0x000000, "Member 'FStruct_SpyShared_ProjectileBalancing::BaseDamage_74_36CF81FC4F917B2A07DA46A43692C138' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, ChargedDamageMultiplier_77_28D235B84A876A15BA1AF6A24B10A7E2) == 0x000004, "Member 'FStruct_SpyShared_ProjectileBalancing::ChargedDamageMultiplier_77_28D235B84A876A15BA1AF6A24B10A7E2' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, CritDamageMultiplier_54_C7265949498B0805DCAFEB9BD0D6E0CE) == 0x000008, "Member 'FStruct_SpyShared_ProjectileBalancing::CritDamageMultiplier_54_C7265949498B0805DCAFEB9BD0D6E0CE' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, LimbDamageMultiplier_56_5FC6648C4B3A734297A1CD8047DD415D) == 0x00000C, "Member 'FStruct_SpyShared_ProjectileBalancing::LimbDamageMultiplier_56_5FC6648C4B3A734297A1CD8047DD415D' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, ProjectileLifetime_61_BC4B0E934BD520ED74D393AB574F5D8B) == 0x000010, "Member 'FStruct_SpyShared_ProjectileBalancing::ProjectileLifetime_61_BC4B0E934BD520ED74D393AB574F5D8B' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, FullyChargedSpeed_65_8D0F301C4BD2B0C9292120A6F0A463A8) == 0x000014, "Member 'FStruct_SpyShared_ProjectileBalancing::FullyChargedSpeed_65_8D0F301C4BD2B0C9292120A6F0A463A8' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, InitialSpeed_69_5F4423A44F453B42152999A01AF24881) == 0x000018, "Member 'FStruct_SpyShared_ProjectileBalancing::InitialSpeed_69_5F4423A44F453B42152999A01AF24881' has a wrong offset!");
static_assert(offsetof(FStruct_SpyShared_ProjectileBalancing, GravityScale_80_2E707B544A1458B361449E8FFF74485C) == 0x00001C, "Member 'FStruct_SpyShared_ProjectileBalancing::GravityScale_80_2E707B544A1458B361449E8FFF74485C' has a wrong offset!");

}

