#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Octo_PassivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Octo_PassivesBalancing.Struct_Octo_PassivesBalancing
// 0x0030 (0x0030 - 0x0000)
struct FStruct_Octo_PassivesBalancing final
{
public:
	float                                         ConfirmDelay_19_F6499F1947B9A7A949E1E49B138164B3;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShowConfirmation_21_488941DE47DC11B81DDA9080BA4B69C5; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextStackDelay_24_A5470E8144B98ED06EAD4A934B0627BC; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxStackedEvent_27_9638EACD4CB9E6CC94C16F865F779B74; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseRequiredIntel_4_76CB882A49D1D97AD80F31A9EF1FAF30; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseIntelUpgrade_7_027B6B5A496DA6B10595AD845418B1EE; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseMaxUpgrade_9_0B3AC35A474BF79BD29F71B472F27EEF; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1Missing1_30_40DA9DEE4A6B82E0742402A5CBBFCE7B;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1Missing10_32_7D5B160E4AD5BE9C45EBE2A483259047; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1Missing20_34_A9710538474C698E263EEAAED4BE406D; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2RefillChance_36_E1DAB6CB4319953F7755E69379D99800; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2Refund_38_E10B0A3446E3A5DC9BBA3DBD967FD8CC;    // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Octo_PassivesBalancing) == 0x000004, "Wrong alignment on FStruct_Octo_PassivesBalancing");
static_assert(sizeof(FStruct_Octo_PassivesBalancing) == 0x000030, "Wrong size on FStruct_Octo_PassivesBalancing");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, ConfirmDelay_19_F6499F1947B9A7A949E1E49B138164B3) == 0x000000, "Member 'FStruct_Octo_PassivesBalancing::ConfirmDelay_19_F6499F1947B9A7A949E1E49B138164B3' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, ShowConfirmation_21_488941DE47DC11B81DDA9080BA4B69C5) == 0x000004, "Member 'FStruct_Octo_PassivesBalancing::ShowConfirmation_21_488941DE47DC11B81DDA9080BA4B69C5' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, NextStackDelay_24_A5470E8144B98ED06EAD4A934B0627BC) == 0x000008, "Member 'FStruct_Octo_PassivesBalancing::NextStackDelay_24_A5470E8144B98ED06EAD4A934B0627BC' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, MaxStackedEvent_27_9638EACD4CB9E6CC94C16F865F779B74) == 0x00000C, "Member 'FStruct_Octo_PassivesBalancing::MaxStackedEvent_27_9638EACD4CB9E6CC94C16F865F779B74' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, BaseRequiredIntel_4_76CB882A49D1D97AD80F31A9EF1FAF30) == 0x000010, "Member 'FStruct_Octo_PassivesBalancing::BaseRequiredIntel_4_76CB882A49D1D97AD80F31A9EF1FAF30' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, BaseIntelUpgrade_7_027B6B5A496DA6B10595AD845418B1EE) == 0x000014, "Member 'FStruct_Octo_PassivesBalancing::BaseIntelUpgrade_7_027B6B5A496DA6B10595AD845418B1EE' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, BaseMaxUpgrade_9_0B3AC35A474BF79BD29F71B472F27EEF) == 0x000018, "Member 'FStruct_Octo_PassivesBalancing::BaseMaxUpgrade_9_0B3AC35A474BF79BD29F71B472F27EEF' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, Mod1Missing1_30_40DA9DEE4A6B82E0742402A5CBBFCE7B) == 0x00001C, "Member 'FStruct_Octo_PassivesBalancing::Mod1Missing1_30_40DA9DEE4A6B82E0742402A5CBBFCE7B' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, Mod1Missing10_32_7D5B160E4AD5BE9C45EBE2A483259047) == 0x000020, "Member 'FStruct_Octo_PassivesBalancing::Mod1Missing10_32_7D5B160E4AD5BE9C45EBE2A483259047' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, Mod1Missing20_34_A9710538474C698E263EEAAED4BE406D) == 0x000024, "Member 'FStruct_Octo_PassivesBalancing::Mod1Missing20_34_A9710538474C698E263EEAAED4BE406D' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, Mod2RefillChance_36_E1DAB6CB4319953F7755E69379D99800) == 0x000028, "Member 'FStruct_Octo_PassivesBalancing::Mod2RefillChance_36_E1DAB6CB4319953F7755E69379D99800' has a wrong offset!");
static_assert(offsetof(FStruct_Octo_PassivesBalancing, Mod2Refund_38_E10B0A3446E3A5DC9BBA3DBD967FD8CC) == 0x00002C, "Member 'FStruct_Octo_PassivesBalancing::Mod2Refund_38_E10B0A3446E3A5DC9BBA3DBD967FD8CC' has a wrong offset!");

}

