#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Squire_ActivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Squire_ActivesBalancing.Struct_Squire_ActivesBalancing
// 0x001C (0x001C - 0x0000)
struct FStruct_Squire_ActivesBalancing final
{
public:
	float                                         Duration_47_A99E370B4F3E6074990708AF8E9DD674;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveCancelDelay_7_4DC78ADC48DA70082C71E3A1DAA35D4B; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveCancelRefund_8_66D4E5464C36698D45E03DA91C820696; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionRange_51_EA641B2540771362A2DDDA9AE9B8182A; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DetectionHeight_52_C00E511C44DE54292432A59DBDB8BBB6; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveMod1SpeedMultiplier_36_898503154A37353EC17E63B803339241; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveMod1ReloadMultiplier_58_10BCF1CB455CA2DB00257CB26C036567; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Squire_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Squire_ActivesBalancing");
static_assert(sizeof(FStruct_Squire_ActivesBalancing) == 0x00001C, "Wrong size on FStruct_Squire_ActivesBalancing");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, Duration_47_A99E370B4F3E6074990708AF8E9DD674) == 0x000000, "Member 'FStruct_Squire_ActivesBalancing::Duration_47_A99E370B4F3E6074990708AF8E9DD674' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, ActiveCancelDelay_7_4DC78ADC48DA70082C71E3A1DAA35D4B) == 0x000004, "Member 'FStruct_Squire_ActivesBalancing::ActiveCancelDelay_7_4DC78ADC48DA70082C71E3A1DAA35D4B' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, ActiveCancelRefund_8_66D4E5464C36698D45E03DA91C820696) == 0x000008, "Member 'FStruct_Squire_ActivesBalancing::ActiveCancelRefund_8_66D4E5464C36698D45E03DA91C820696' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, DetectionRange_51_EA641B2540771362A2DDDA9AE9B8182A) == 0x00000C, "Member 'FStruct_Squire_ActivesBalancing::DetectionRange_51_EA641B2540771362A2DDDA9AE9B8182A' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, DetectionHeight_52_C00E511C44DE54292432A59DBDB8BBB6) == 0x000010, "Member 'FStruct_Squire_ActivesBalancing::DetectionHeight_52_C00E511C44DE54292432A59DBDB8BBB6' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, ActiveMod1SpeedMultiplier_36_898503154A37353EC17E63B803339241) == 0x000014, "Member 'FStruct_Squire_ActivesBalancing::ActiveMod1SpeedMultiplier_36_898503154A37353EC17E63B803339241' has a wrong offset!");
static_assert(offsetof(FStruct_Squire_ActivesBalancing, ActiveMod1ReloadMultiplier_58_10BCF1CB455CA2DB00257CB26C036567) == 0x000018, "Member 'FStruct_Squire_ActivesBalancing::ActiveMod1ReloadMultiplier_58_10BCF1CB455CA2DB00257CB26C036567' has a wrong offset!");

}

