#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Larcin_ActivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Larcin_ActivesBalancing.Struct_Larcin_ActivesBalancing
// 0x0014 (0x0014 - 0x0000)
struct FStruct_Larcin_ActivesBalancing final
{
public:
	float                                         Duration_2_D3C9D81748E5215E96116F921365415F;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelDelay_4_C5120DA841C48FE26C74DCA37C6EDB9D;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveRefund_6_E77077284545F28B3C9E198461AC00B1;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TeammatesSpeedBoostDuration_9_FB095BA44F9449E093557FB42653688F; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1ExitSmokeBombInvisibilityDuration_11_E0A62A2347174BA3B00FBC8588954765; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Larcin_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Larcin_ActivesBalancing");
static_assert(sizeof(FStruct_Larcin_ActivesBalancing) == 0x000014, "Wrong size on FStruct_Larcin_ActivesBalancing");
static_assert(offsetof(FStruct_Larcin_ActivesBalancing, Duration_2_D3C9D81748E5215E96116F921365415F) == 0x000000, "Member 'FStruct_Larcin_ActivesBalancing::Duration_2_D3C9D81748E5215E96116F921365415F' has a wrong offset!");
static_assert(offsetof(FStruct_Larcin_ActivesBalancing, CancelDelay_4_C5120DA841C48FE26C74DCA37C6EDB9D) == 0x000004, "Member 'FStruct_Larcin_ActivesBalancing::CancelDelay_4_C5120DA841C48FE26C74DCA37C6EDB9D' has a wrong offset!");
static_assert(offsetof(FStruct_Larcin_ActivesBalancing, ActiveRefund_6_E77077284545F28B3C9E198461AC00B1) == 0x000008, "Member 'FStruct_Larcin_ActivesBalancing::ActiveRefund_6_E77077284545F28B3C9E198461AC00B1' has a wrong offset!");
static_assert(offsetof(FStruct_Larcin_ActivesBalancing, TeammatesSpeedBoostDuration_9_FB095BA44F9449E093557FB42653688F) == 0x00000C, "Member 'FStruct_Larcin_ActivesBalancing::TeammatesSpeedBoostDuration_9_FB095BA44F9449E093557FB42653688F' has a wrong offset!");
static_assert(offsetof(FStruct_Larcin_ActivesBalancing, Mod1ExitSmokeBombInvisibilityDuration_11_E0A62A2347174BA3B00FBC8588954765) == 0x000010, "Member 'FStruct_Larcin_ActivesBalancing::Mod1ExitSmokeBombInvisibilityDuration_11_E0A62A2347174BA3B00FBC8588954765' has a wrong offset!");

}

