#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Vigil_ActivesBalancing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Struct_Vigil_ActivesBalancing.Struct_Vigil_ActivesBalancing
// 0x0034 (0x0034 - 0x0000)
struct FStruct_Vigil_ActivesBalancing final
{
public:
	float                                         DelayCancel_5_3794C1C844A1D6D3F4A168B491852954;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnequipDelay_8_A063AFB7431B0CA0E72AA48B9C973672;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseZoneDur_13_21B3FD844DC1457A2BB461818A33800F;   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseLingeringDur_12_61C944334415F425481BCF887DD8B4E4; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseAoEDamage_34_FB63BC9A44DD043D64ADFF982DE4BF8F; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseAoERadius_37_66211DF544A1530F0414FCA6345F9FB2; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BaseZoneSize_16_5D0A27834780499C1AB37987CB0D2F8B;  // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1EffectDur_19_1116AD2B43A8EFDE070CB089826FBE13; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2ProjRadius_23_CCAEE98D4F23336A84B4BC8209FCE575; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2AimImpulse_26_9372DED041EED2835F729E94A5B66827; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2GroundImpulse_29_27F4F7C5407F3E8A6002379DF185154F; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Vigil_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Vigil_ActivesBalancing");
static_assert(sizeof(FStruct_Vigil_ActivesBalancing) == 0x000034, "Wrong size on FStruct_Vigil_ActivesBalancing");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, DelayCancel_5_3794C1C844A1D6D3F4A168B491852954) == 0x000000, "Member 'FStruct_Vigil_ActivesBalancing::DelayCancel_5_3794C1C844A1D6D3F4A168B491852954' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, UnequipDelay_8_A063AFB7431B0CA0E72AA48B9C973672) == 0x000004, "Member 'FStruct_Vigil_ActivesBalancing::UnequipDelay_8_A063AFB7431B0CA0E72AA48B9C973672' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, BaseZoneDur_13_21B3FD844DC1457A2BB461818A33800F) == 0x000008, "Member 'FStruct_Vigil_ActivesBalancing::BaseZoneDur_13_21B3FD844DC1457A2BB461818A33800F' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, BaseLingeringDur_12_61C944334415F425481BCF887DD8B4E4) == 0x00000C, "Member 'FStruct_Vigil_ActivesBalancing::BaseLingeringDur_12_61C944334415F425481BCF887DD8B4E4' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, BaseAoEDamage_34_FB63BC9A44DD043D64ADFF982DE4BF8F) == 0x000010, "Member 'FStruct_Vigil_ActivesBalancing::BaseAoEDamage_34_FB63BC9A44DD043D64ADFF982DE4BF8F' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, BaseAoERadius_37_66211DF544A1530F0414FCA6345F9FB2) == 0x000014, "Member 'FStruct_Vigil_ActivesBalancing::BaseAoERadius_37_66211DF544A1530F0414FCA6345F9FB2' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, BaseZoneSize_16_5D0A27834780499C1AB37987CB0D2F8B) == 0x000018, "Member 'FStruct_Vigil_ActivesBalancing::BaseZoneSize_16_5D0A27834780499C1AB37987CB0D2F8B' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, Mod1EffectDur_19_1116AD2B43A8EFDE070CB089826FBE13) == 0x000024, "Member 'FStruct_Vigil_ActivesBalancing::Mod1EffectDur_19_1116AD2B43A8EFDE070CB089826FBE13' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, Mod2ProjRadius_23_CCAEE98D4F23336A84B4BC8209FCE575) == 0x000028, "Member 'FStruct_Vigil_ActivesBalancing::Mod2ProjRadius_23_CCAEE98D4F23336A84B4BC8209FCE575' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, Mod2AimImpulse_26_9372DED041EED2835F729E94A5B66827) == 0x00002C, "Member 'FStruct_Vigil_ActivesBalancing::Mod2AimImpulse_26_9372DED041EED2835F729E94A5B66827' has a wrong offset!");
static_assert(offsetof(FStruct_Vigil_ActivesBalancing, Mod2GroundImpulse_29_27F4F7C5407F3E8A6002379DF185154F) == 0x000030, "Member 'FStruct_Vigil_ActivesBalancing::Mod2GroundImpulse_29_27F4F7C5407F3E8A6002379DF185154F' has a wrong offset!");

}

