#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Xiu_ActivesBalancing

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Struct_Xiu_ActivesBalancing.Struct_Xiu_ActivesBalancing
// 0x001C (0x001C - 0x0000)
struct FStruct_Xiu_ActivesBalancing final
{
public:
	float                                         CancelDelay_4_F0E0050543F94B370F573B962784DA7A;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CancelRefund_20_B6EAA7814ED8E870AD958996A73EBD9A;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range_6_0A740C564263910A0A12A9969B22663A;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height_8_5AAA14454AA553C305E585894FE10853;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumberOfJumps_11_66DF82744ABCF462ECF5399A2380AB06; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod1MaxTimeBetweenJumps_18_F5E24610484095576E4386B2D7416BB1; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mod2TargetDecayTime_14_413FEAE44778E28F8740DEA8769BD608; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStruct_Xiu_ActivesBalancing) == 0x000004, "Wrong alignment on FStruct_Xiu_ActivesBalancing");
static_assert(sizeof(FStruct_Xiu_ActivesBalancing) == 0x00001C, "Wrong size on FStruct_Xiu_ActivesBalancing");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, CancelDelay_4_F0E0050543F94B370F573B962784DA7A) == 0x000000, "Member 'FStruct_Xiu_ActivesBalancing::CancelDelay_4_F0E0050543F94B370F573B962784DA7A' has a wrong offset!");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, CancelRefund_20_B6EAA7814ED8E870AD958996A73EBD9A) == 0x000004, "Member 'FStruct_Xiu_ActivesBalancing::CancelRefund_20_B6EAA7814ED8E870AD958996A73EBD9A' has a wrong offset!");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, Range_6_0A740C564263910A0A12A9969B22663A) == 0x000008, "Member 'FStruct_Xiu_ActivesBalancing::Range_6_0A740C564263910A0A12A9969B22663A' has a wrong offset!");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, Height_8_5AAA14454AA553C305E585894FE10853) == 0x00000C, "Member 'FStruct_Xiu_ActivesBalancing::Height_8_5AAA14454AA553C305E585894FE10853' has a wrong offset!");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, NumberOfJumps_11_66DF82744ABCF462ECF5399A2380AB06) == 0x000010, "Member 'FStruct_Xiu_ActivesBalancing::NumberOfJumps_11_66DF82744ABCF462ECF5399A2380AB06' has a wrong offset!");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, Mod1MaxTimeBetweenJumps_18_F5E24610484095576E4386B2D7416BB1) == 0x000014, "Member 'FStruct_Xiu_ActivesBalancing::Mod1MaxTimeBetweenJumps_18_F5E24610484095576E4386B2D7416BB1' has a wrong offset!");
static_assert(offsetof(FStruct_Xiu_ActivesBalancing, Mod2TargetDecayTime_14_413FEAE44778E28F8740DEA8769BD608) == 0x000018, "Member 'FStruct_Xiu_ActivesBalancing::Mod2TargetDecayTime_14_413FEAE44778E28F8740DEA8769BD608' has a wrong offset!");

}

