#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TwInsectoid

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "TwInsectoid_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class TwInsectoid.TwInsectoidSubsystem
// 0x0028 (0x0058 - 0x0030)
class UTwInsectoidSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UTwMatchDataAggregator>> AggregatorClasses;                                 // 0x0038(0x0010)(ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UTwMatchDataAggregator*>         Aggregators;                                       // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void OnWorldCreation(class UWorld* World);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwInsectoidSubsystem">();
	}
	static class UTwInsectoidSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwInsectoidSubsystem>();
	}
};
static_assert(alignof(UTwInsectoidSubsystem) == 0x000008, "Wrong alignment on UTwInsectoidSubsystem");
static_assert(sizeof(UTwInsectoidSubsystem) == 0x000058, "Wrong size on UTwInsectoidSubsystem");
static_assert(offsetof(UTwInsectoidSubsystem, AggregatorClasses) == 0x000038, "Member 'UTwInsectoidSubsystem::AggregatorClasses' has a wrong offset!");
static_assert(offsetof(UTwInsectoidSubsystem, Aggregators) == 0x000048, "Member 'UTwInsectoidSubsystem::Aggregators' has a wrong offset!");

// Class TwInsectoid.TwInsectoidProviderAdapter
// 0x0000 (0x0028 - 0x0028)
class UTwInsectoidProviderAdapter : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwInsectoidProviderAdapter">();
	}
	static class UTwInsectoidProviderAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwInsectoidProviderAdapter>();
	}
};
static_assert(alignof(UTwInsectoidProviderAdapter) == 0x000008, "Wrong alignment on UTwInsectoidProviderAdapter");
static_assert(sizeof(UTwInsectoidProviderAdapter) == 0x000028, "Wrong size on UTwInsectoidProviderAdapter");

// Class TwInsectoid.AWSS3Adapter
// 0x0020 (0x0048 - 0x0028)
class UAWSS3Adapter : public UTwInsectoidProviderAdapter
{
public:
	class FString                                 APIKey;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 URL;                                               // 0x0038(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AWSS3Adapter">();
	}
	static class UAWSS3Adapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAWSS3Adapter>();
	}
};
static_assert(alignof(UAWSS3Adapter) == 0x000008, "Wrong alignment on UAWSS3Adapter");
static_assert(sizeof(UAWSS3Adapter) == 0x000048, "Wrong size on UAWSS3Adapter");
static_assert(offsetof(UAWSS3Adapter, APIKey) == 0x000028, "Member 'UAWSS3Adapter::APIKey' has a wrong offset!");
static_assert(offsetof(UAWSS3Adapter, URL) == 0x000038, "Member 'UAWSS3Adapter::URL' has a wrong offset!");

// Class TwInsectoid.TwInsectoidWidget
// 0x00F0 (0x0350 - 0x0260)
class UTwInsectoidWidget final : public UUserWidget
{
public:
	struct FReportData                            PendingReport;                                     // 0x0260(0x00D8)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x18];                                     // 0x0338(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AcceptScreenshot(int32 SizeX, int32 SizeY, const TArray<struct FColor>& Image);
	void OnRequestComplete(bool Result);
	void OnStartSubmit();
	void OnSubmitFinished(bool bSuccess);
	void SubmitReport(const struct FReportData& InReport);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwInsectoidWidget">();
	}
	static class UTwInsectoidWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwInsectoidWidget>();
	}
};
static_assert(alignof(UTwInsectoidWidget) == 0x000008, "Wrong alignment on UTwInsectoidWidget");
static_assert(sizeof(UTwInsectoidWidget) == 0x000350, "Wrong size on UTwInsectoidWidget");
static_assert(offsetof(UTwInsectoidWidget, PendingReport) == 0x000260, "Member 'UTwInsectoidWidget::PendingReport' has a wrong offset!");

// Class TwInsectoid.AWSDynamoDBAdapter
// 0x0000 (0x0048 - 0x0048)
class UAWSDynamoDBAdapter final : public UAWSS3Adapter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AWSDynamoDBAdapter">();
	}
	static class UAWSDynamoDBAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAWSDynamoDBAdapter>();
	}
};
static_assert(alignof(UAWSDynamoDBAdapter) == 0x000008, "Wrong alignment on UAWSDynamoDBAdapter");
static_assert(sizeof(UAWSDynamoDBAdapter) == 0x000048, "Wrong size on UAWSDynamoDBAdapter");

// Class TwInsectoid.BugSnagAdapter
// 0x0020 (0x0048 - 0x0028)
class UBugSnagAdapter final : public UTwInsectoidProviderAdapter
{
public:
	class FString                                 BSAPIKey;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 URL;                                               // 0x0038(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BugSnagAdapter">();
	}
	static class UBugSnagAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBugSnagAdapter>();
	}
};
static_assert(alignof(UBugSnagAdapter) == 0x000008, "Wrong alignment on UBugSnagAdapter");
static_assert(sizeof(UBugSnagAdapter) == 0x000048, "Wrong size on UBugSnagAdapter");
static_assert(offsetof(UBugSnagAdapter, BSAPIKey) == 0x000028, "Member 'UBugSnagAdapter::BSAPIKey' has a wrong offset!");
static_assert(offsetof(UBugSnagAdapter, URL) == 0x000038, "Member 'UBugSnagAdapter::URL' has a wrong offset!");

// Class TwInsectoid.TwInsectoidFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTwInsectoidFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool IsInsectoidEnabled();
	static void SubmitReport(const class FString& Summary, const class FString& IssueType, const class FString& IssueCategory, uint8 Severity, const class FString& Description, const struct FVector& PlayerPos, const class FString& Map, const TDelegate<void(bool IsValid)>& Callback);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwInsectoidFunctionLibrary">();
	}
	static class UTwInsectoidFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwInsectoidFunctionLibrary>();
	}
};
static_assert(alignof(UTwInsectoidFunctionLibrary) == 0x000008, "Wrong alignment on UTwInsectoidFunctionLibrary");
static_assert(sizeof(UTwInsectoidFunctionLibrary) == 0x000028, "Wrong size on UTwInsectoidFunctionLibrary");

// Class TwInsectoid.TwInsectoidGlobals
// 0x0008 (0x0040 - 0x0038)
class UTwInsectoidGlobals final : public UDeveloperSettings
{
public:
	TSubclassOf<class UTwInsectoidProviderAdapter> AdapterClass;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwInsectoidGlobals">();
	}
	static class UTwInsectoidGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwInsectoidGlobals>();
	}
};
static_assert(alignof(UTwInsectoidGlobals) == 0x000008, "Wrong alignment on UTwInsectoidGlobals");
static_assert(sizeof(UTwInsectoidGlobals) == 0x000040, "Wrong size on UTwInsectoidGlobals");
static_assert(offsetof(UTwInsectoidGlobals, AdapterClass) == 0x000038, "Member 'UTwInsectoidGlobals::AdapterClass' has a wrong offset!");

// Class TwInsectoid.TwMatchDataAggregator
// 0x0000 (0x0028 - 0x0028)
class UTwMatchDataAggregator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TwMatchDataAggregator">();
	}
	static class UTwMatchDataAggregator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwMatchDataAggregator>();
	}
};
static_assert(alignof(UTwMatchDataAggregator) == 0x000008, "Wrong alignment on UTwMatchDataAggregator");
static_assert(sizeof(UTwMatchDataAggregator) == 0x000028, "Wrong size on UTwMatchDataAggregator");

}

